{"tripadvisor_monas_0":"It's a Luxurious mall in Jakarta. Clean, new building model, easy to access by public transportation, middle up price and quality of fashion, food court, cinema, etc.I usually...read more ","tripadvisor_monas_1":"My most favorite shopping center in south jakarta. The location is strategically near rasuna said road. We can find most of famous stores here. The parking space is a lot. Baby Stroller is easily used. They offer loyalty membership card, too. The more we spend in this shopping center, the more rewards point we get.","tripadvisor_monas_2":"It's a Luxurious mall in Jakarta. Clean, new building model, easy to access by public transportation, middle up price and quality of fashion, food court, cinema, etc.I usually went here with my wife, although it's a luxurious mall, but it's not the best mall in Jakarta I think.Near place like Bekasi are already has a nicer and bigger...More  ","tripadvisor_monas_3":"The mall has every thing you want, clothes, shoes, food, cinema, market, every thing in one place. The stores not all cheap, there also a corner for games ^^. I hope that you go to this mall first before any mall so that you can buy what ever you want. Also it was really big so you need to go...More  ","tripadvisor_monas_4":"I used to work above kota kasablanka mall so everyday I always sightseeing at this mall. What I love about kota kasablanka are:- many restaurants that you can choose to eat- many events at its atrium that you can attend- child friendly; it can rent you baby stroller for free","tripadvisor_monas_5":"So many people here especially on weekend, heavy traffic to go here most of the times - everyone from any direction going to \"Kokas\". Many good culinary stop with many choices of food (Food Society). There are many hang out place for you like Starbuck, Excelso, Oh-Lala, Black Canyon, Kopi Luwak, Bengawan Solo, Nanny's Pavillon .etc - pick your style.","tripadvisor_monas_6":"We were staying at Park Lane Hotel and this mall was just 5 minutes walk. It's a good size mall but not huge like Mall of Indonesia or Grand Indonesia but it had all the stuff you need. Good shops, good restaurants, even a cinema hall.","tripadvisor_monas_7":"Well situated near many of Jakarta's foreign embassies. The mall is relatively old and needs to be refurbished.","tripadvisor_monas_8":"One of mall destination in south Jakarta. Easy to access even though most of time always got traffic jam around there. You can find so many middle or top brands in there. Enjoy shopping and kuliner then. My Favourite rest there: wings stop, star coffee (mie rebus jaws so taste), remboelan restoran (nasi bakar rowa so yummy), white elephant (green...More  ","tripadvisor_monas_9":"If you want to go to shopping malls in Jakarta, maybe this malls could be an option for you. Located in the center of Jakarta (near suburb), this mall provide anything you needs, from grocery, restaurant, fashion, sports, entertainment.For food hunters, this place was so good with so many option of local and international food. So if you want...More  ","tripadvisor_monas_10":"We visited Kota Kasablanka for the 3rd time in August 2016. Our visit was during weekend with 8 months old baby, and we planned to have lunch in on of the restaurants there. This mall has huge selection of restaurants (you name it), full with clothing expo at Ground Floor. The downside of this mall is they have limited nursery...More  ","tripadvisor_monas_11":"The best I visit in Jakarta .. I am not looking for Expensive Brand items I just want sometinh different like Indonesia Brand and high Quality I found some in this mall . also...read more ","tripadvisor_monas_12":"Had a great day here, The staff are very helpful as got lost a few time, amazing coffee shop's and restaurants,","tripadvisor_monas_13":"I was there because Friend wanted to get her Levi jeans here. She said it is 30 % cheaper than in singapore.It is a big mall with many international brands like LeVi, H &M, Mark and Spencer, and eateries( including Korean, Japanese food and fast food chain like A&W)There is a GIANT super at basement and pharmacies.I...More  ","tripadvisor_monas_14":"The best I visit in Jakarta .. I am not looking for Expensive Brand items I just want sometinh different like Indonesia Brand and high Quality I found some in this mall . also there is larg area for Ice land and many resturand and I advice to eat in Pizza hut very nice and good service.","tripadvisor_monas_15":"You can do anything here: shopping, dining, taking your kids to the playground, seeing a movie, etcMany high street brands are available, such as H&M, Zara, Warehouse, etcTons of restaurant and cafes inside, so you won't run out of optionsI brought my active 3 year-old daughter here and rented a \"car\" stroller for her during my visit","tripadvisor_monas_16":"One of the best mall in jakarta I like to visit each time during my trip to jakarta, simply all in one.","tripadvisor_monas_17":"This mall is big like too big , you almost can find every international brand, but what I don't like that the brands they have is not local and I can find it back home . Food court is too big and not limited at all .","tripadvisor_monas_18":"Kota Kasablanka shopping mall is really a cozy place to hang around.It's located at Kuningan CBD, hence central, a plus point.High-end outlets are available and well-designed to lure customers to come in, shopping. The shopping mall is also huge and classy as compared, say to, Gandaria City mall.Next door there are luxurious apartments and offices.Food court...More  ","tripadvisor_monas_19":"The mall wa so big and they have a ladies parking area.. Which is good for woman. They have a big cinemas, food court area, and there's many fashion brands. Wow. I never expected this mall was a good shopping area.","tripadvisor_monas_20":"Big Mall in the large area, complete between food and fashion. Various of the food resto, coffee shop and food court in the all level make a lot of choices","tripadvisor_monas_21":"Kota Kasablanka is one of Jakarta's ubiquitous shopping malls and thankfully one of the better ones. My favorite units would have to be Remboelan restaurant and their ground floor crowded food square. But all in all, it's pretty much similar to every other shopping mall in Jakarta.","tripadvisor_monas_22":"The mall is okay, but since i went to a highschool nearby, and since we went to kota kasablanka (kokas) way too often, i always met someone inside. Its fine but you know when you...read more ","tripadvisor_monas_23":"The mall is okay, but since i went to a highschool nearby, and since we went to kota kasablanka (kokas) way too often, i always met someone inside. Its fine but you know when you want to shop whether alone or with your friends isnt it better when u dont meet someone else? Lol and the lower ground floor is...More  ","tripadvisor_monas_24":"The mall is big & new and has heaps of venues but has a commercial soul not a service soul.Everything in the mall has the sole purpose to empty you wallet with no attention to services.Is bright & sparkling but no service delivered","tripadvisor_monas_25":"At least spend one day in a week in this place. So much options for dining, shopping, etc. So complete stuff mall though this mall is create bad traffic along casablanca road. Dont be here after payday, or you will have difficulty in enjoying this place. Dont be here on weekend too, especially saturday afternoon onwards. Sometimes i find this...More  ","tripadvisor_monas_26":"Routine time pas weekend ke kokas (Kota Kasablanka) this one our favorite mall because everything you need at here, you can playing with your kids in chipmunk playground, wanna buying something to your kulkas tinggal cus saja ke carrefour, if you wanna eating something diffrent you can choose in foodcourt so many store food you can try, and pastinya so...More  ","tripadvisor_monas_27":"This mall is great with lota of choices for shopper, upscale brand you will find easily here, various of restaurants with various meals also easily find here, lots of parking lots even during weekend you will have teouble to find apot either.The only concern for me is just to get to this mall sometimes take lots of effort from...More  ","tripadvisor_monas_28":"Nice Modern Mall, with up class taste. Very clean and nice ambient.3 floors of food goodness, Carrefour and Sogo.And bonus point close to Halim Perdanakusuma (HLP) International Airport.","tripadvisor_monas_29":"This mall is so happening. Recommend ride public transportation to this mall coz parking lot is always full. Lots of good restaurant inside. And good for shopping too.","tripadvisor_monas_30":"Mall with a lot of fashion store and a lot of great cafe and restaurant. Located in Kasablanka, Kuningan, South Jakarta, it's easy to find it with unique glass style building. Overall one of the best mall in town.","tripadvisor_monas_31":"Kota Kasablanka is a big mall with a modern vibe. You will not run out of food choices as one wing is dedicated to restaurants offering different cuisines: Japanese, Italian, Chinese, Indonesian, etc. We enjoyed our dinner at Kafe Betawi (particularly loved the ketoprak) on the 2/F and bought some martabak at a coffee shop on the G/F. As expected,...More  ","tripadvisor_monas_32":"This mall is quite big.There is a cinema, lots of restaurants and cafes, shops, karaoke place, salons, and etc.There is a Masjid inside the mall so really convenient for Muslims to pray.It's not that high class, fancy shopping mall since there is not much of designers outlets here.Hence, it's still comfortable to walk in without having...More  ","tripadvisor_monas_33":"This mall is spacious and modern, plenty of nice restaurants located inside the mall, you would never get disappointed to get good foods in here. I love to shop and dine in this...read more ","tripadvisor_monas_34":"I can say Kota Kasablanka (Kokas) mall is one of the best shopping and eating experience mall in Jakarta. It's kind of one stop shopping centre. We can find many good restaurants such as Sushi Tei, Remboelan, Penang Bistro, Holycow, ShabuShabu Express, Negiya, Shaburi, Duck King, Zenbu, Sushigroove, Solaria, Imperial Kitchen, the Caprese (my favourite restaurant) etc and coffee shop...More  ","tripadvisor_monas_35":"This mall is spacious and modern, plenty of nice restaurants located inside the mall, you would never get disappointed to get good foods in here. I love to shop and dine in this mall.","tripadvisor_monas_36":"I once been there for a meeting with my colleagues and the place served its best for the food and meeting room.","tripadvisor_monas_37":"Kokas is one of the newest mall in Jakarta and it has a good layout design. They organized the shops, dining area in several location. Its a good meeting point in south Jakarta. They are lacking of parking spaces especially if you are visiting in weekends or public holiday.","tripadvisor_monas_38":"I will run, not walk, back to Kota Kasablanka very soon. I am a foreigner staying in Jakarta for a few months and a Sunday was my first day visiting this large mall. It's slick and western looking and has LOTS of shopping options and LOTS of coffee shops. I think there are about 5 floors but I didn't count...More  ","tripadvisor_monas_39":"There are about 5 or 6 malls at this location which is a city central of big companies and entertainment. But this is the perfect one, if you could just pick 1 of the spot at this location! Full of middle and high brand outlets, places to eat, so many which could make you dizzy (in a good way) to...More  ","tripadvisor_monas_40":"We come here for church in the morning. The Mall is big and offers many attractions and places to eat.We preffer to go on sundays because the traffic is not that bad as on weekdays. Garuda office is also here.","tripadvisor_monas_41":"There was Sogo dept store, some eat and eat foodcourt. Some coffeeshop also available. This mall was located in some area where the other mall built. Many embassy feom other country was in there also.","tripadvisor_monas_42":"Kokas, that's the name given by local Jakarta people to this place. This mall has everything, what i mean is the range of the product sold here is large enough, it has everything, from the world leading designer stores until the super cheap hypermarket known as carrefour. This includes the wide range of restaurant in the Food Society (part of...More  ","tripadvisor_monas_43":"Kota Kasablanka or local known as Kokas, is a mall with two offices tower with nice few restaurants, retail shops and café. Its just a similar mid class mall located in the central of Jakarta. Specialty stores? well not really..most stores you can also find at the most mall I Jakarta.","tripadvisor_monas_44":"Our Flight to Bali got cancelled as Mt. Raung was emitting ashes so we visited these few malls to kill time. Anyways I bought a Quicksilvr tee as a souvenir for IDR 275k.","tripadvisor_monas_45":"Our Flight to Bali got cancelled as Mt. Raung was emitting ashes so we visited these few malls to kill time. Anyways I bought a Quicksilvr tee as a souvenir for IDR 275k.","tripadvisor_monas_46":"One of the biggest malls in town is Kota Kasablanka also know as \"Kokas\". The mall is so beautiful with carrefour in it. The only disadvantage is the area is always traffic jammed.","tripadvisor_monas_47":"Quite large mall which offers a lot of variety of cuisine and items, ranging from middle to high end products. Not very crowded and allows you to be able to really enjoying your walks there without being constantly having to dodge another passer by.The lift and escalators are easy to be remembered due to the mall layout. a recommended...More  ","tripadvisor_monas_48":"It was okay. I like the escalators and lifts placement, easy to remember. Well this place even small but has bunch of delicious food vendors and branded vendor. And if you are in rush this place quite helpful but the traffic is unavoidable crowded in weekdays.","tripadvisor_monas_49":"This is New Mall and Newly Open. This mall is big mall and they provide good restaurant and also cinema. Surrounding they also have near Hotel arround this Kota Kasablanka. They also have Cinema which is always crowded on the weekend time.","tripadvisor_monas_50":"A place that a must, at least once a week.Cos me and fam attend the church (JPCC) here.Food : very ok.Brands : very ok.ATM : very ok.Love this place.","tripadvisor_monas_51":"Don't eat at Harris Tebet, walk to Kota Kasablanka, it has nice restaurants and a lot of them! Massage, too.","tripadvisor_monas_52":"I do not know when is this mall is not crowded! Especially in weekend and its cinema. Line up like never ending 😭 But this mall got good variant restaurants, maybe the best in Kuningan residence","tripadvisor_monas_53":"This mall had it all, many selection of restaurant, snack vendor, and others.And its big! So i just come when its open and go home when its close. :)Sephora, beautybox, h&m, and many else.","tripadvisor_monas_54":"Good place to hangout in weekend. There are 2 office tower inside the mall. So if you visit in weekdays, there are so many employee/office staff around here and have lunch in there so you have to come earlier or reserved first.","tripadvisor_monas_55":"The place is easy to find, mall is huge, parking could accomodate up to 1000 cars, many of shop tenant for middle-up scale, there is cinema, travel agents, sport station, games...read more ","tripadvisor_monas_56":"The place is easy to find, mall is huge, parking could accomodate up to 1000 cars, many of shop tenant for middle-up scale, there is cinema, travel agents, sport station, games station, restaurant, etc.","tripadvisor_monas_57":"Of the malls I had visited so far I love it. Well planned and accessible. It is really something enjoyable.","tripadvisor_monas_58":"There is everything you need there.:- carrefour- numerous coffee (starbuck,coffee bean, black canyon, olala, good people, excelsio, etc..)- chucheria chocolate- bakery (tous les jours, breadlife, etc..)- sushi restaurant (sushi tei, etc..)- steak house (meatme)- pizza place (pizza express)- many other food outlet- sogo- ace hardware- eletronic hardware- haidresser...More  ","tripadvisor_monas_59":"The mall has many restaurants that we are familiar with. Come there before lunch time, otherwise you need to wait to get a place to sit. In and out from parking building was quite a challenge.","tripadvisor_monas_60":"many choices for \"cuci mata\", and it's quite big for me personally. good place for hanging out with families, friends, or couples. many choices for food as well. as said before, the parking area was confusing. but still i consider this mall as ordinary as another shopping malls in Jakarta.","tripadvisor_monas_61":"Nice mall with good brands and dining facilities. Toilets are clean too. Easy to get around. Great coffee shops are present which makes it nice to hang out with friends and family. 😊","tripadvisor_monas_62":"This mall is located near Kuningan area. This mall is not tobig. It is famous as fashion and culinary center. As other mall they have supermarket, departmen store and cinema.","tripadvisor_monas_63":"A large mall dubbed as KoKas. A huge mall in a mixed use development property at Satrio - Casablanca street shopping belt with total area 170sqm. Kokas is famous as fashion and culinary center. H&M, sogo, cotton on, zalora, and countless boutique and fashion stores. Bath and body works is the largest in the country. Anchor tenants include Carrefour, chipmunks...More  ","tripadvisor_monas_64":"Another Mall in Jakarta. Never been here even almost two years now in this city.Nice to know so huge Mall. Interesting the people around. Brands of the shops is always the same as the other. Vlassified as a medium averange Mall.","tripadvisor_monas_65":"One of the most happening malls in Jakarta. All types of showrooms and Kids toys shop. Good Food court. Easily can spend 3-4 hours:)","tripadvisor_monas_66":"Visit here during office hours, then you'll feel that the mall is yours because it is not crowded at all. Although the parking is a bit odd because there's only 20-30 car parking...read more ","tripadvisor_monas_67":"Visit here during office hours, then you'll feel that the mall is yours because it is not crowded at all. Although the parking is a bit odd because there's only 20-30 car parking per floor except the basement.","tripadvisor_monas_68":"The good: it's a new trendy integrated shopping area, with business building and apartment all integrated into one. The shopping center has high ceiling, with natural lights from the roof, making it look more spacious then it is from outside. The bad: avoid the peak hour traffic going to Kasablanka. I tried to call for a cab after my meeting...More  ","tripadvisor_monas_69":"Great shopping Mall with various brands of product. More choices of restaurants and Cafe. Very clean and organise Mall.","tripadvisor_monas_70":"Located at Casablanca area, Kota Kasablanka is one of my most visited mall because it's near from my house. Basically, i like this mall. It's quite huge with various outlets in it. It has Zara, HnM, Stradivarius, Mango, BBW, and any other brands that suit my tastes. So if I'm about to shop clothes, this mall is definitely my choice....More  ","tripadvisor_monas_71":"This is a nice place to shop from a range of things from designer pens to dishwasher tablets. The food hall is great and has a variety of places to eat, fromItalian to local cuisine. You'll be surprised how many shops are in this mall. Toilets are plentiful too if you get caught short :)","tripadvisor_monas_72":"Convenient Mall and easy access to go the parking lot, have a lot of store and restaurant inside and outside.The food court also has much option for lunch and dinner.","tripadvisor_monas_73":"My church is inside the building, making me come here every week. Therefore, every week I have to wait for my mom and 11 year old sister shop in this same place over and over again every week. Well, at least the restaurants here are well known and good in taste.","tripadvisor_monas_74":"It's probably the best mall along casablanca area. There are a few malls around this area, but I think kokas is suitable for family, children and even hang out with friends. The parking lot is ladies driverd friendly.Most of tenants here are about the same as tenants in Gandaria City mall.","tripadvisor_monas_75":"Kota Kasablanka is an unattractive mall on Jalan Kasablanka in Jakarta. It is a relatively standard mall but without many attractive features.There are a range of eateries on the basement level and various shops and department stores above. On the plus side it has Marks & Spencer.The restaurant range is not that great. More a place for people...More  ","tripadvisor_monas_76":"It's near my hotel. Only about 10 minutes by taxi, non rush hour. It's big, and not so crowded. There are many things, genuine products, in the store, SOGO and department stores, and quite a lot were on sale... I managed to get something on very good bargain for the kids. We enjoyed our tasty Indonesia food there. Good ambience,...More  ","tripadvisor_monas_77":"We stayed at The Park Lane hotel and walk to Kota Kasablanka shopping centre for meals of just to chill out. The place is spacious and there are many different venues to have...read more ","tripadvisor_monas_78":"Shopping mall in strategic location. Lot of restaurants, fashion stores, daily market and gadget stores. I come to the mall very often. Not so crowded mall, still can enjoy walking around the mall with family and friends.","tripadvisor_monas_79":"During my 5 days stay at Jakarata, I extensively visited lot of shopping malls and I found Kasablancka the best. Though full of customers but still very calm. I loved the environment and food also.","tripadvisor_monas_80":"at The First time go to Kota Kasablanca.I love so much with the variant of Food.They have the most complited kind of food at the Mall.Love this mall so much","tripadvisor_monas_81":"There's nothing extraordinary about this place, just another fancy mall like you can find elsewhere in Jakarta and across Asia. It's not cheap, but you can find most things you would expect to find in a mall. While it's perfectly satisfactory, I can't say there's anything that really makes this place unique, no exceptional stores or restaurants, no interesting fountains...More  ","tripadvisor_monas_82":"From the tenants you will know that this mall supposedly filled with educated visitors. However, the mall was crowded, more of a night market instead of a mall. Full of people, no lines of queueing, and insufficient parking space. These qualities making the tenants inside, like manggo, zara, and other things feels like cheap crap.","tripadvisor_monas_83":"Just another mall in Jakarta, make sure to wear comfy shoes when u visit this mall. Avoid visit this mall on Sunday since a well known church located at this mall and the traffic was unbelievable during the end of the church","tripadvisor_monas_84":"We stayed at The Park Lane hotel and walk to Kota Kasablanka shopping centre for meals of just to chill out. The place is spacious and there are many different venues to have coffee or partake in meals. The retail shops are also quite varied and I am sure anyone will be able to find what they want here.","tripadvisor_monas_85":"This mall has all the international & locals brands plus restaurants. But keep in mind it closes at 10pm. We arrived late and didn't find any food. Most places the last order is at 9.30pm or 9.45pm.","tripadvisor_monas_86":"It s a quite new mall. There are a lot of good restaurants. The H&M is also interesting. Nice architechture as well inside and outside","tripadvisor_monas_87":"First time here. We were impressed because the mall is big and not crowded (we came on Sunday evening), many choices of restaurants (we ate at Sushi Tei - this branch is not available on tripadvisor, unfortunately), and our favorite tenants are mostly here so we also spent some time wandering around. Lovely.","tripadvisor_monas_88":"I was here in Jakarta for an official trip near Kota Kasablanka and got the chance to be here. Really lot of shops to buy with different variety of items. Taste buds have lot of...read more ","tripadvisor_monas_89":"I was here in Jakarta for an official trip near Kota Kasablanka and got the chance to be here. Really lot of shops to buy with different variety of items. Taste buds have lot of varieties here","tripadvisor_monas_90":"I always being here in Sunday from the 7am... Because Jakarta Praise Community Church is in here, my Lovely church. They already Open for breakfast at 9 am. Eat & eat, also a few of coffee house. Have a Big nursery room in ground and 2nd fl. All the toilet always clean. But i still confused when looking for a...More  ","tripadvisor_monas_91":"Big mall, with many major brands in retail, as well as departmental store SOGO. Many many restaurants in the upper floors, a food court on level 2, small snack and food stores at the basement, and a Carrefour.Prices here are not cheap though, expect to pay similar of slightly cheaper prices compared to back home.","tripadvisor_monas_92":"Pros:I can find everything I need here: Ace Hardware, Carrefour, decent cinema. Carrefour not quite well stocked (dairy selection & imported goods not their strong suit), but okay enough.Choice of dining options quite varied, nothing too expensive.Location is quite convenient for me, easy to access. Still central.Cons:Confusing layout. Not as confusing as Kuningan City, though....More  ","tripadvisor_monas_93":"Very cramped, slightly off putting place for westerners. But if knew what you wanted electrical wise, this is the place. Not new technology sadly.","tripadvisor_monas_94":"Like most of the top malls in Jakarta, Kota Kasablanka (or KoKas) provides many shopping centre, restaurants, and cafes. The price is affordable and it's one of my choice to hang out in Jakarta, even not my favourite.","tripadvisor_monas_95":"This mall is near to my office so I used to come to this mall at least once a week for lunch or dinner. I can find any of my favorite cosmetic shop, clothes, music and any small thing in this mall. I also appreciate the management building providing a little mosques in the basement, the mosques is clean and...More  ","tripadvisor_monas_96":"One of the greatest... Designed very well, very classy and lots of Upscale Fashion Brand you can find in this Shopping Center.Also my favorite Sephora and H&M are here too!Even better!","tripadvisor_monas_97":"Great shopping malls and lots if nice restaurant to choose from ....awesome place to chill and shop !Lots of taxi waiting !!","tripadvisor_monas_98":"Visited here couple times as it was near to where I was staying. Though the size is impressive in terms of its tenants and availability of products, the mall itself seems to be focused too much only in fashion and its brands rather than being a family-friendly mall. The fact that elevators no longer operate after 8 p.m. is a...More  ","tripadvisor_monas_99":"Jakarta is for me a city of thousands of malls, and Kota Kasablanka is one of the biggest one. I personally think that it's nice to stop by here and have a nice supper or just...read more ","tripadvisor_monas_100":"Jakarta is for me a city of thousands of malls, and Kota Kasablanka is one of the biggest one. I personally think that it's nice to stop by here and have a nice supper or just have a chit chat with friends in one of its cafes, and wait for the traffic jam to clear up after working hours. Shopping...More  ","tripadvisor_monas_101":"It's a huge mall..it's not too much interesting inside..jst like other mall..but if u are a food hunter..u cn find a lot of a nice n new restaurants in ths mall..i like ths mall cz it's close to my home..","tripadvisor_monas_102":"I like this shopping mall as it is new, clean, with many branded store, Carefour Supermarket, nice food court, Sogo Department Store and have a big parking area. The location is strategic as close to my office in Rasuna Said Kuningan, close to Sudirman Street, Gatot Subroto, and Tebet. What i disliked is the Casablanca Street to reach this mall...More  ","tripadvisor_monas_103":"One of the new Mall in Jakarta, for me - it's more than a Mall. I like all the things in this Mall, especially with their Food court. Beautiful decoration with middle east style, the food was yummy with the good selection menu, or even if you just want to have light meals, they also have:)","tripadvisor_monas_104":"Nothing special. It's very big and there are plenty of things you can do to kill time. Places to eat","tripadvisor_monas_105":"Kota Kasablanka its a superblok at Casablanca Road.They have Apartment,shopping mall and office integrated in their area.It is confinient if you can stay and work at the same places.From the apartments you can directly go to the center of the mall.As a tenant you just need an access card to enter apartment area from the shopping mall.But in office hour...More  ","tripadvisor_monas_106":"Great and large new mall. Went here primarily to go to church (JPCC, a Pentacostal church) on Sunday morning (floor 3-4). Afterwards had great lunch at Kafe Betawi (GF), followed by Icecream (Haagen Dasz) and a coffee (Jco). Mall too large to explore in an hour or two.","tripadvisor_monas_107":"This is the brand new place for Jakartans around Tebet area. For me the highlight of this place is Food Society section. All restaurants & cafes are new faces and or have new concepts. Either on Foodcourt area 3rd floor or lower ground or Eat & Eat, can't stop you from wondering around.","tripadvisor_monas_108":"This on the second floor of the building and you can go up in the lift. We took our young granddaughter to play here. It has a great range of indoor equipment for children of all ages. There are some great slides, a ball blaster and climbing tunnels. She had a great time and was continually on the go. The...More  ","tripadvisor_monas_109":"Kota Kasablance is the closest mall to our apartment and it has everything that we need. Department store, supermarket, restaurants, movie theater and many more. They have a kids' indoor playground called Chipmunks and my son loves it. It get's too crowed on the weekend, traffic on the weekday's rush hours is too much to handle and the parking is...More  ","tripadvisor_monas_110":"Kota Kasablanca was a short stroll from where we were staying so we went there a few times. I was overwhelmed with the choice of restaurants and the whole place is nice and clean...read more ","tripadvisor_monas_111":"Kota Kasablanca was a short stroll from where we were staying so we went there a few times. I was overwhelmed with the choice of restaurants and the whole place is nice and clean and airy. There is a Carrefour supermarket here too which is great. It is a pretty new shopping centre and so a lot of shops are...More  "}