{"tripadvisor_monas_0":"Located at Jalan Jendral Gatot Subroto No. Kav 52 (6°13'48.5\"S 106°49'09.8\"E), the Satria Mandala Museum (Armed Forces Museum), Jakarta may be reached from Kota by Bus 1 - Blok M...read more ","tripadvisor_monas_1":"Must bring your family at least once, to learn about the history of the indonesian army, a good wide variety of displays of old army equipments including planes and tanks, will be memorable for young kids.","tripadvisor_monas_2":"Located at Jalan Jendral Gatot Subroto No. Kav 52 (6°13'48.5\"S 106°49'09.8\"E), the Satria Mandala Museum (Armed Forces Museum), Jakarta may be reached from Kota by Bus 1 - Blok M in 45 min (14 stops) Stop ID: 1-20 to Bendungan Hilir, then walk 25 minutes for 1.8 km. If you take a cab, make sure he knows exactly where he...More  ","tripadvisor_monas_3":"here you can see many things about armythe diorama was wonderfuland also there're so many armament to seereally good place for educate your children","tripadvisor_monas_4":"This was a great museum which you can touch and hold a variety of guns etc. Lots of history in english which was good to be able to read, Great visit had by all..","tripadvisor_monas_5":"THis Museum is where we can see so many Army Stuff from the Old Time. Here we can see so many weapon, tank, uniform, etc. Very nice place to learn history. But this museum need improvement to make the museum become better and interesting to visit.","tripadvisor_monas_6":"Findings:1. The ticket price we paid is IDR 15.000 for 2 adults and 3 children. Based on the ticket should only IDR 9.500.2. Many kids sneak in through the fences on the airplane area of museum from outside.3. The upper level in one of the diorama is completely dark but no sign indicate it was close.4....More  ","tripadvisor_monas_7":"various kind of tank, riffle, weapon, ship and other memorabilia from the past heroes and independence and other war","tripadvisor_monas_8":"It was a memorable experience for my children. I personaly like the great general Soedirman booth. The museum has the cart and coat of the general.However if you come with push chair or baby stroller, it will be difficult for you because the dont have access for them.Anyhow, it was a good education for my children about the...More  ","tripadvisor_monas_9":"It's good to know about a history of a Indonesian Hero and this place is full of the historical things","tripadvisor_monas_10":"This museum is large and consists of several builds as well as extensive garden areas and open exhibits. There is equipment on show from the Indonesian Army, Navy and Airforce. The equipment shown includes planes, vehicles and guns bought from the worlds military industries and local home built equipment.","tripadvisor_monas_11":"museum location in the heart of business district of jakarta, museum content all the past armed force of indonesia, all in good preserve","tripadvisor_monas_12":"museum location in the heart of business district of jakarta, museum content all the past armed force of indonesia, all in good preserve","tripadvisor_monas_13":"This museum is located at Gatot Subroto, a walking distance from my office. This place has a great collection about military things. Old rocket launcher, old president car, tanks, helicopters, aircrafts, etc. Great place for kids to learn about Indonesia. This museum really needs breakthrough action since it looks like to be neglected. Maintenance should be done properly to keep...More  ","tripadvisor_monas_14":"One of the museum located in the city center, and is easily accessible using either private or public transportation. This museum contains of equipment and the history of Indonesian military. The ticket is very cheap, maybe this is what makes it somewhat poorly maintained musueum. Very suitable for kids, because they can ride various combat vehicles and play around. Unfortunately...More  ","tripadvisor_monas_15":"time stopped in her, not much attraction or you can see and fun. But if you take your children, aaah that's great idea. They can see helicopter, tank, anda many more. Kids can play around","tripadvisor_monas_16":"In this museum you will learn all things about Indonesian army. I love to see the olden weapon, airplane, vehicles use to fight against the enemy, but seems the museum needs more better treatment and management.","tripadvisor_monas_17":"Must visit for kids, with good collection of Indonesian's Military History.The sad things is the neglect from government to provide necessary funding for this museum.The fee is too cheap. Rp. 2,500.for kids, bring your schoolmates and friends, the weapon collections was good although not great.Recommended for a family or school activities.","tripadvisor_monas_18":"Me and the kids have been here a few times already. The Kids loved the weapon room and the open space area in the back where all the planes and tanks were located. Many useful information about the war during the occupation which helped parents to teach kids to be proud of being Indonesian. the toilets were poor and praying...More  ","tripadvisor_monas_19":"Located downtown and open during weekends certainly makes this museum very easy to visit. It is closed on Mondays, though. Kids (especially little boys) would love it because they get to see all kind of weapons, old tanks, planes and chopper, and even a ship up close.They have splendid collections from the wartime and extensive dioramas.It used to...More  ","tripadvisor_monas_20":"This place certainly gives you a lot of useful information about Army and Military and their amenities. They have rooms for every section. Most of the visitors here are school kids.","tripadvisor_monas_21":"good items here, historical weopons when indonesian defence and fight for their independents. almost old weopon from world war II. we can find MIG from 70s era, tanks, torpedos, badge and uniform indonesian heroes","tripadvisor_monas_22":"Good place for outdoor pictures with post war aircrafts. The museum is not bad but it needs renovation . It gives you the feeling that it's abandoned","tripadvisor_monas_23":"Good place for outdoor pictures with post war aircrafts. The museum is not bad but it needs renovation . It gives you the feeling that it's abandoned","tripadvisor_monas_24":"Lots of very interesting exhibits, though the curating level is really poor and seems like the people are not keen in actually preserving these military hardware and just displaying them out in the elements expecting people to come in. Still, being a military buff, I do hope they would put in some effort to beautify the place and accord some...More  ","tripadvisor_monas_25":"Went there as just about my only tourist destination during a short visit to Jakarta. I have a great interest in military hardware so this place surprised me with the amount of aircraft, unusual armoured vehicles, and a good collection of small arms. However, it does look like the curating of the collection and updating stopped just after the Museum...More  ","tripadvisor_monas_26":"I did my pre-wed picture here with \"Pearl Harbor\" theme...only add another 2,000.- rupiah for the camera...portray pretty complete Indonesia's militarry history, love it, been there for more than 5 times I suppose","tripadvisor_monas_27":"I enjoy my visit here . The museum is centrally located and has a good collection of armaments, including aircrafts / choppers used by the Indonesian armed forces. The diorama provides excellent information as to how Indonesia had to earn its independence","tripadvisor_monas_28":"Sad to say, this museum is apparently the one and only place in Indonesia where you can look at quite a complete range of military hardware (most of them are outdated) that Indonesia Armed Forces possessed. Located in the heart of CBD, its quite a large complex which will took you around 2 hours to finish the entire tour. There...More  ","tripadvisor_monas_29":"too old. nothing a news. must to make some a new things get make a people interest","tripadvisor_monas_30":"I thought it was just me, but some of my friends also felt the same about this museum: gloomy and spooky. They might have interesting materials, but the display is awful. The poor lighting only add the gloom to this place. Not recommended, especially if you bring small children.","tripadvisor_monas_31":"Since we enter the gate, my toddler son already get super excited with the tank, plane, rocket, canons and helicopter that sprawl on the front yard of the museum. We spent a long time climbing, driving and taking pictures on it.Inside the museum, my son really obssesed with the diorama, the diorama tell the story about the Indonesian heroes...More  ","tripadvisor_monas_32":"this place has a long history even before it become a museum...and now with all the historical material you can see many interesting part of military history in this place","tripadvisor_monas_33":"If you want to learn about Indonesia's history, especially about the Independent War, you should go there and there's a lot of display that represent the history of it.","tripadvisor_monas_34":"If you want to learn about Indonesia's history, especially about the Independent War, you should go there and there's a lot of display that represent the history of it."}