{"tripadvisor_monas_0":"Great impression of the old architecture, and nice view from the look out to old boats! Go for the view and the buildings the collection is just informative plackards and...read more ","tripadvisor_monas_1":"Great impression of the old architecture, and nice view from the look out to old boats! Go for the view and the buildings the collection is just informative plackards and minitiare boats.","tripadvisor_monas_2":"Very interesting place in discoveing the old history of the Sea trade, the Harbour of Batavia and the colonil period under the Dutch. The Museum is located in one of the original Dutch buildings at the Harbour, showing ship models, nautical tools and naval paintings. There is also an antique \"pending\" observation tower with an underground jal.","tripadvisor_monas_3":"You can see history about Indonesian Maritime, you can go with family, and good for childreen for their study","tripadvisor_monas_4":"Wonderful 18th century building and worth the visit to see them and enjoy the architecture. Not worth the visit for the maritime display.","tripadvisor_monas_5":"In the old days, this building used to be the spices warehouse. Quite shabby but very big. Most of its collection are traditional boats.You can see the ancient city fortress here.","tripadvisor_monas_6":"It only takes a few minutes to walk through this small maritime museum. The museum consists of sleepy staff, several rooms and contains life-size boats used through-out the history of Indonesia. I don't recall a lot of text in English, but it was interesting to see the different types of boats. If you are at the harbor, it's worth breezing...More  ","tripadvisor_monas_7":"Quiet a big museum compare to others in Jakarta, and having decent collections as well. One thing they need to do I think is to upgrade the way they show the collections.","tripadvisor_monas_8":"The building was in the old area first developed as early as 16th century by the dutch. Old dutch VOC style building. Close to Sunda Kelapa port and old city. The museum contents were limited and the indoor lights were quite dimmed, but I think the architecture was the star here.","tripadvisor_monas_9":"the building is worth the trip. Let's you imagine how it was back in the days. huge storage rooms. We're the only visitors. 15 minutes walk from 'old town'","tripadvisor_monas_10":"I am one of museum Geek. I Like their collections, love the buildings, helpful guide and nice ambience. However since the access to get the museum its kind of tricky and also the location is kind of far from main attraction, so it is better to come with more friends or you could pick high season to come so you...More  ","tripadvisor_monas_11":"Visit here is a very hidden place. Not to familliar like in town. Inside got a lot of historical shipping at their country. Old building but enough spend 1hour or less here.pay...read more ","tripadvisor_monas_12":"Visit here is a very hidden place. Not to familliar like in town. Inside got a lot of historical shipping at their country. Old building but enough spend 1hour or less here.pay 5000Rp for entry fees and bring them go to the tower reaching buy bus..to see surrounding view at the top.","tripadvisor_monas_13":"The buildings here are a sight to behold steeped in history that altered the future of nations in past 300+ years. A former central holding area for spices beings sent onwards, the warehouses retain their character and are a fascinating site, if you're into learning the history of the spice trade. There are 3 buildings here to see. The staff...More  ","tripadvisor_monas_14":"Honestly inside the museum, the staffs are friendly and helpful. The location of this place is not good due to surround it there is traditional market and it has bad smell. Also the building is very old and low light and make me little bit scary. Also in front of parking car, there are many big truck and need to...More  ","tripadvisor_monas_15":"Maritime Museum located at the Pasar Ikan area. This Museum show so many equipment from the old time. Like Boat, Ship, and all Maritime Things that been used when the old time. This museum locate in very crowded area, in front of this area there are Fish Market. A bit hard to find place to park. But while you are...More  ","tripadvisor_monas_16":"this museum has a alot potential. It has many tools about maritime world, ship replica from Indonesia and other country, and also has maps about Jakarta in old days. But the facility is bad, the collection is covered by dust and there is no lightning at all so it's dark inside eventhough it's at noon. Beside that, the court inside...More  ","tripadvisor_monas_17":"The building and the tower with view to the port and the big channel is a nice place to visit.The museum itself, with some dioramas, is just average.","tripadvisor_monas_18":"The museum (entry IDR5,000 per person) is located in old spice warehouses dating back to the early 1700's, within walking distance of the harbour at Sunda Kelapa. The various warehouses are themed relative to boats, explorers, commerce etc. Again it is not really pitched at the Western tourist, so unless you can understand Bahasa one is at something of a...More  ","tripadvisor_monas_19":"The museum itself is nice and clean, I'm quite happy that our government keeps our historic buildings well. I like the diorama and read the explanations for each parts of the museum. Very good and very important for students to visit this museum.","tripadvisor_monas_20":"The building is wonderful, but the exhibits are poor to average. As a previous reviewer commented, Jakarta seems to be taking it's museums seriously but they are very much still in the early days of developing them. This is a truly wonderful location for a maritime museum as it's in an old VOC spice warehouse. The displays of boats are...More  ","tripadvisor_monas_21":"An interesting old Dutch building, huge rooms which appear to have little in them but despite that there is lots to see. Lots of very ornate and unique canoes & boats. Well worth a quick visit.","tripadvisor_monas_22":"Sketchy walk to the museum through a really bad area, though the walk back was a bit safer (went a different way). We were the only ones at the museum. Large collection of antique...read more ","tripadvisor_monas_23":"Sketchy walk to the museum through a really bad area, though the walk back was a bit safer (went a different way). We were the only ones at the museum. Large collection of antique ships, but very little care given to museum display or maintenance. The building itself is fascinating though.","tripadvisor_monas_24":"Located in the slums with difficult access and poor lighting, the museum looks like a science project that was put together with great haste.","tripadvisor_monas_25":"I took time to visit this Forgotten place ! Rather very less visited ! But what I saw was amazing , very well kept ! Piece of history put together It seems funding seems to be less then other places ,but I must congratulate the authorities for keeping this place ALIVE ! I must thank all of thoseinvolved who have...More  ","tripadvisor_monas_26":"I was really looking forward to seeing the Maritime Museum, and when i got to the watch House tower, I was beginning to think that I had seen it ! But i was wrong, further down the road, there is the Fort / Warehouse and this is where the museum really starts.But back to the Watch Tower, I got...More  ","tripadvisor_monas_27":"Sadly most of the exhibits are not in place at the moment.It appears that Jakarta is trying to take its museology and representation seriously, but it is still in the early stages. There are some interesting panels, and the display of famous explorers is a good idea, but a bit naive in actual representation.This was a VOC spot,...More  ","tripadvisor_monas_28":"This won't be the best maritime museum you have visited but its worth a trek to if you are interested in the maritime history of Old Batavia. You can walk here from the main part of Kota in maybe 15 minutes or something, but there are many trucks on the roads (dusty...) in the area and I would not advise...More  ","tripadvisor_monas_29":"Good museum for the enthusiast - less so for a family with kids.Entry fee is modest.You can tie this one in with a visit to Sunda Kelapa Harbour.The building adds to the atmosphere and gives a feeling for what old Batavia was really like.Displays are numerous, interesting and reasonably well documented but don't expect interactive displays....More  ","tripadvisor_monas_30":"The museum is quaint. The old building adds to the old world charm of the place. A bit difficult to locate. The museum is rather small, and isn't very well staffed either. You could miss out a section of the first floor near the reception because there are no directions on where to go. However, I enjoyed the old maritime...More  ","tripadvisor_monas_31":"It is located not far from Jembatan Kota Intan in Jakarta, across the VOC shipyard and next to the Sunda Kelapa Fish Market. You can go there on foot if you are visiting the old town (old Batavia) in Jakarta.It is also located near De Rivier hotel.To be honest, it is one of a few museum which is...More  ","tripadvisor_monas_32":"When you visit this place, make sure you use guide. And the you will understand the great story behind the wall. This museum is well maintenance. Its hard to find the direction, but better you asked people on the street to find this museum.","tripadvisor_monas_33":"compared to the other museum i check out, this place is rather boring but what really get me going is the architecture design, and how maintained the place is.. the feeling of how...read more ","tripadvisor_monas_34":"I highly recommend anyone even mildly interested in Maritime history to visit this museum. But really, its a highly informative exhibition outlining the rich history of maritime interactions in Jakarta from the first spice traders to the recently expanded multi million dollar port. With umpteen models of ships on display and some mildly freaky mannequins providing an insight into previous...More  ","tripadvisor_monas_35":"compared to the other museum i check out, this place is rather boring but what really get me going is the architecture design, and how maintained the place is.. the feeling of how history goes back is just great","tripadvisor_monas_36":"Museum is always be a educational place to visit for my kid. The museum offer quite good exhibit in Indonesian maritime history in well maintained old heritage building.Do spend another half an hour to one hour to the old port which still have old style boat and still in service.An alternate location for weekend short trip.","tripadvisor_monas_37":"When I visited the museum, part of it was under renovation. A much needed face lift for this neglected museum. For 2,000 Rp which is approximately $0.20 USD, it allows you to view two parts of the museum. The lighthouse tower (small area) and the maritime museum (main area) For the price you pay it's worth having a look inside....More  ","tripadvisor_monas_38":"I go with all my family and i bring lot of children from my family to teach them more about sea, boat etc , really hot when i visit and little bit far away from the town, better go more early when holiday","tripadvisor_monas_39":"this is one of the museum in jakarta that have many beutiful collection of cultural ship, classical ship and other antique ship but the colection not maintaned well","tripadvisor_monas_40":"I was spending my weekend in Kota Tua and hired a bike to take me around. Located across the famous Pelabuhan Sunda Kelapa, not far from busy roads.Illuminate by quite dim lightning...I don't realy enjoy my time here.however, entry fee is very cheap only IDR 2,000.","tripadvisor_monas_41":"There are 2 sites to see with one entrance ticket. One is Menara Syah Bandar [Harbour Watch Tower], and the other is the Maritime Museum. At Menara Syah Bandar 3rd stories, we can see from above Sunda Kelapa Old Port with rows of boats, VOC Warehouse, Fish Market Street and Pakin Street view with bridge and gate.Museum collections majorly...More  ","tripadvisor_monas_42":"The place is incredible, the buildings are nice and I loved the exhibits, the only problem I see in this museum is that it has a lot of potential to be even better.Another problem is that we walk a lot to get here and the surrounding area looks dodgy and dirty, too bad because it is filled with a...More  ","tripadvisor_monas_43":"The history of it. It tell you about the activity during Dutch colonialisme upon Indonesia for 3.5 centuries. This was a very big commercial port at that time","tripadvisor_monas_44":"Visiting this museum brought me back to Indonesia in its maritime golden age, a country rich of spices with strong traditional maritime kingdoms. The museum is a renovated old...read more ","tripadvisor_monas_45":"Its been a pleasure for me to visit this museum. I still can remember how i very amazed to see more after my visit once when i was in elementary school","tripadvisor_monas_46":"Visiting this museum brought me back to Indonesia in its maritime golden age, a country rich of spices with strong traditional maritime kingdoms. The museum is a renovated old building which makes it special and brings back the ambience of the past.There are several replicas and real sea transports, brought from various regions in Indonesia. Also, there are maps...More  ","tripadvisor_monas_47":"Which I believe is underway... let's hope they do the subject and material justice. What a maritime history Indonesia has!!!","tripadvisor_monas_48":"Start at the watch-tower at the opposite side of the street and make your way down to the museum afterwards. The exhibiitoin is nothing too exciting, but the building is amazing.","tripadvisor_monas_49":"Wondering about Jakarta's old history, this is one of the best place to visit !","tripadvisor_monas_50":"The museum is very nice and it is in the harbour area, but you cannot see it from it. The building s very old and has a good patio. It will be refurbished soon, and I look forward to seeing it then, when there will be more information on the boats and the maritime activities of Indonesia.","tripadvisor_monas_51":"The place itself is not very-well maintained but the historical things that you can see and learn is worth to-see.","tripadvisor_monas_52":"The building is really good. The collection is also good. But the surrounding of the building is fishy (literally as in smell like fish) - if you think that's reasonable since this is right by the sea, i give you another reason why it's dodgy. Its surrounding is dirty.But, if you're okay with those, then this is a nice...More  ","tripadvisor_monas_53":"Ship models displayed in an old warehouse. A big makeover is in progress. Interesting area, adjacent to fish market."}