{"tripadvisor_monas_0":"it is not a graveyard. it is just the tombstone. nice tombstone with angel style statue. most of them looks misterious. if you like gothic style, than propably this attraction is...read more ","tripadvisor_monas_1":"it is not a graveyard. it is just the tombstone. nice tombstone with angel style statue. most of them looks misterious. if you like gothic style, than propably this attraction is good for you","tripadvisor_monas_2":"In this memorial park there are many statues of cupids and angels that seem to have come from various graves. There are also two exquisite marble sculptures of weeping ladies, one standing and the other lying over a tomb. Among the graves of the Europeans there are also tombs of Chinese, Japanese and Indonesians, including the tombstone of Miss Riboet...More  ","tripadvisor_monas_3":"This outdoor museum is actually amazing. I believe it's the only outdoor museum Jakarta has–or maybe Indonesia has. I 'dig' so many histories about Jakarta 'written' on the tomb stones.Too bad, I couldn't find my self feel comfort in there. Too many mosquitoes biting me.","tripadvisor_monas_4":"Prasasti Museum is a couple of minutes walk from Citi M Hotel. Entrance fee is $5000. You will have the whole place to yourself as this graveyard is hardly visited by tourists. I don't think people would be so thrilled to visit an old graveyard. Best to visit in the day as it may be eerie after sunset!Here lies...More  ","tripadvisor_monas_5":"I knew that this cemetery was somewhere in Jakarta. Amazingly enough it is hardly visited by tourists. My guide told me that nobody ever asked her to go there in the more than 30 years she was a tour guide! I found it extremely interesting as it tells the story of Dutch people who lived and died in former Batavia....More  ","tripadvisor_monas_6":"The museum is located among busy district and I would not have guessed it. The museum area is actually a little left of once 5.9 hectare cemetery. Hundreds of old gravestone (dated back around 1700) placed on the grounds, some cemented into monuments, on the cemetery walls or on the building walls. Most of the remains have been removed to...More  ","tripadvisor_monas_7":"Many band/singers use this place for their video clip, whenever it has a funeral act part in it. It's good for you, photography lovers, but make sure you bring your hat/umbrella to cover your head from the sunlight. Do you guys know that Soe Hok Gie was buried here?","tripadvisor_monas_8":"proud to see our name on a Large obelisk-statuemonument from our greatgrandfather Lodewijk Launy!We Will try to preserve iT for our children!","tripadvisor_monas_9":"The first thing that is striking about Taman Prasasti is its silence. Tucked in a quiet corner of Jakarta next to the Central Jakarta mayor's office, the silence combined with tombstones of the capital's European and Chinese residents - as well as the obelisk like memorials to the area's original residents -make it the place to contemplate about the transitory...More  ","tripadvisor_monas_10":"Nice to see the old Dutch names of the Graves...only worth to see when you are around..have some other nationalities too","tripadvisor_monas_11":"It has great collections of old gravestones from the Dutch colonial period but the administrators don't treat them right. The gravestones just laid on the ground, sometimes...read more ","tripadvisor_monas_12":"It has great collections of old gravestones from the Dutch colonial period but the administrators don't treat them right. The gravestones just laid on the ground, sometimes children around there played in the museum and step on it. It has a potential to be a great museum as long as the management manage the museum right.","tripadvisor_monas_13":"Nicenplace to pratice your photography hobby. Best time to come is after 3 pm. Not tonhot and your pictures are in good result.","tripadvisor_monas_14":"It should read as the museum for inscription, but actually it contains headstones from the colonial era. You might find it quite eerie, but actually the place itself is quite romantic; even several music clip was shot here. Try to find out the head stone of Jan Pieter Zoon Coen, one of the infamous Dutch Governor General during the Dutch...More  ","tripadvisor_monas_15":"One of the most overlooked museums; this is an open air museum so better not visit on a rainy day.The ticket price is cheap (IDR 5,000 for Adults/general public with a discount for groups of 30 people and above). For professional shootings, they will charge extra.I just paid for my ticket and went in for the first time....More  ","tripadvisor_monas_16":"We never thought that this Taman Prasasti is cemetery! Aniway, I found this cemetery filled with strong history. If you read the thombstones, you'll find lots of people were die in very young age at that time (around year 1800) War I guess. There are also the dutch army and their capten. There are also wodden coffin of Soekarno and...More  ","tripadvisor_monas_17":"Remind me a lot about life and death ;)It supposed to be a good place if the government would taking care as well as other museums.The statues and graves are like speaking loudly with their silentness.Overall, i enjoyed my afternoon in here ;)Notes : they are open everyday except monday from 9am-3pm. Ticket price is just...More  ","tripadvisor_monas_18":"Looking around Taman Prasasti is not interested at all. But if you find a tourist guide, I bet i should be interesting... a lot...Started with Woman who cried statue, 1st President and Vice President of Indonesia coffins, General Kohler, Soe Hok Gie, Olivia Raffles, etcMy tourist guide told historical for some grave, their story in his / her...More  ","tripadvisor_monas_19":"On my personal opinion do not expect too much from this exhibit. They will have lots of statue/prasasti left from the Dutch colonial time. Yes it is a cemetery and influenced mostly by Catholic design. They will have individual tomb in remembrance of single person and larger tomb with lots of people name in remembrance. There's lots of trees there....More  ","tripadvisor_monas_20":"Taman Prasasti Museum has great collections of old gravestones from the Dutch colonial period. but the administrators don't treat them right. the gravestones just laid on the ground. sometimes, children around there played in the museum and step on it.there are also many trashes.it is so sad to see it.the museum has a potential to be a...More  ","tripadvisor_monas_21":"Taman Prasasti Museum located in center of Jakarta. This museum was formally a cemetery, build by Dutch Colonial in 1795. The cemetery area is the oldest of its kind in Jakarta and may have been the oldest modern cemetery in the world by comparison with the Fort Canning Park (1926) in Singapore, Gore Hill cemetery (1868) in Sydney, Père Lachaise...More  ","tripadvisor_monas_22":"This old cemetery has a ton of cool artistic tombs. Most of them are from Dutch/British colonial era. It has become a hotspot for photographers to do some photosession or even...read more ","tripadvisor_monas_23":"This old cemetery has a ton of cool artistic tombs. Most of them are from Dutch/British colonial era. It has become a hotspot for photographers to do some photosession or even solo photohunt.","tripadvisor_monas_24":"A friend told me about an American consul who was buried here, and I had to find out more. Sure enough, Pliny M. Nickerson rests eternally in Taman Prasasti, as do other expat dignitaries who died in Jakarta (earlier known as Batavia) over one hundred years ago. Admission is perhaps the equivalent to $1 and allows you to stroll around...More  ","tripadvisor_monas_25":"Well, this place is not a graveyard anymore. It used to be, but now all the bodies had been removed and only the tomb left. As it was used back from the Dutch era, you can find artistic and ornate tomb in the park. Some famous people's tombs that you can find including Sir Stamford Raffles' wife and Soe Hok...More  "}