{"tripadvisor_monas_0":"Only 50c admission fee and an extensive range of puppets on display. A small museum that is worth a look if you are in the square. Perhaps team with a stop at Batavia Cafe.","tripadvisor_monas_1":"Only 50c admission fee and an extensive range of puppets on display. A small museum that is worth a look if you are in the square. Perhaps team with a stop at Batavia Cafe.","tripadvisor_monas_2":"This is a museum dedicated to the art of Wayang. I suggest you read up on it first, to get the best from this place. There is a lot of local culture and history here.If you are in old town it a must see for me.","tripadvisor_monas_3":"Although very a basic Museum, this is the place to go if you want to see puppets. It's inexpensive so even a quick trip is worth it. I really enjoyed seeing the puppets up close but the lighting and displays are basic. Happy I went, but if you just want to see a few puppets you can see a few...More  ","tripadvisor_monas_4":"Took a friend from Taiwan here and he was hugely captivated. He insisted to buy us a pair of wayang each for our good luck.","tripadvisor_monas_5":"nice museum if you are interested in wayang. They have a big and diverse collection of wayang. It is centrally located so easy to combine it with a visit to other musea/old buildings","tripadvisor_monas_6":"Museum concept is really good. Museum is centrally located in KOTA TUA area. The only downside was the representation which could have been much better.","tripadvisor_monas_7":"If you enjoy the traditional Indonesian puppet shows then check out this museum. It has a great history of the art of puppetry in Indonesia. If you're lucky, your guide will be Aldy, who has a vast knowledge of the art.","tripadvisor_monas_8":"This is an historical place that keeping A lot of Indonesia traditional puppet show story from all around Indonesia. Our puppet show majority from Java Island with A story of adapt from old hindu story \"Mahabarata\". But they also collect other puppet from around Indonesia with their unique story","tripadvisor_monas_9":"Used to be the site of Church in batavia old city, nowadays house the collection of wayang (indonesia's shadow puppet) from across indonesia. There also often live performance of wayang, either wayang kulit (javanese & balinese) or wayang golek (sundanese). Some of the indoor place is air-conditioned, while atrium in the building has tombstone of former dutch governor who was...More  ","tripadvisor_monas_10":"Having a short time to kill after lunch at Café Batavia I decided to invest in the modest entry fee for this nearby museum.I am not sure what I expected from a puppet museum, and it doesn't help that I don't speak Bahasa Indonesia but while there were some very impressive exhibits, I left without a real feel for...More  ","tripadvisor_monas_11":"This is worth a stop in the Kota tua area. It's not a big museum but has a good collection of puppets. Although it's very old school- dimly lit with poor English signage- the...read more ","tripadvisor_monas_12":"This is worth a stop in the Kota tua area. It's not a big museum but has a good collection of puppets. Although it's very old school- dimly lit with poor English signage- the intricacies and craft of the puppets displayed speak for themselves. When we visited on a Saturday, there was a shadow puppet performance going on from 11am...More  ","tripadvisor_monas_13":"I have to say I am a bit skeptic to see, however I am a bit surprised to see the collection of Wayang, puppeteries both local and international. A brief local and english explanation to each collection, though not all of them are well described. All and all, a very cheap entrance, good collection to see, i am indeed loving...More  ","tripadvisor_monas_14":"Had a fun filled day learning about Indonesian history and the influence of the Dutch in Indonesia. Loved the play even though I didnt actually understand a word of it.","tripadvisor_monas_15":"For those who are visiting Jakarta and want to know more about our culture, visiting this Museum is a must. It is located in Kota Tua and there are a few other museums nearby which you can see together with this Museum. This Museum is known for the various Wayang (Puppet) collections from Indonesia and also donations from other Asian...More  ","tripadvisor_monas_16":"Many of the puppets are absolutely beautiful but the museum is poorly layed out, English signs are badly written and uninformative and the place is poorly lit.I would pay twice as much to visit a nicer museum and actually learn about the history behind all these puppets.How can we appreciate the beauty in a poor museum?","tripadvisor_monas_17":"The museum exhibits various forms of puppetry in Indonesia. Almost all exhibits are explained in both Indonesian and English. A section of the museum contains puppetry from various other nations (USA, Thailand, India, etc). A definite visit for those interested in the art form.","tripadvisor_monas_18":"Call me pessimistic, but I actually thought that this Museum were not good, old, dark and poorly maintained. The ticket price is very cheap for locals, only for 5,000 IDR (less than a dollar for two). I was quite surprised that my trip turns out to be quite nice. A very good display of original item of wayang, although some...More  ","tripadvisor_monas_19":"Located in Kota Tua Centre with 5,000Rp for ticket. Orginal stuff is great but no interpretation enough for visitor. Like arrangement stuff in house. Sometimes no English translation in signage.Better if improve, will be a good museum one.","tripadvisor_monas_20":"Even I'm locals here but it's my first time visiting this museum and Kota Tua (Old City of Jakarta) :D even for locals the staff gave us a good services and very welcome, but make sure you don't cross the prohibited/closed area, or the staff will urge you to go...to the other place :p the air con is good, and...More  ","tripadvisor_monas_21":"Good chinese building and many stories about indonesian culture,legends and kings and many more the theatre was very old but my rating is avarage but the cleaness is good","tripadvisor_monas_22":"If you came for puppets, this place has all sorts of them : native, foreign, some hybrid in between. There is quite a lot on display. Took about 45 minutes of strolling through...read more ","tripadvisor_monas_23":"If you came for puppets, this place has all sorts of them : native, foreign, some hybrid in between. There is quite a lot on display. Took about 45 minutes of strolling through the different rooms (non-stop).The downside is that the building is fairly old (supposed to be part of the city's administrative office complex from Dutch times) and...More  ","tripadvisor_monas_24":"The wayang comes in a number of varieties -- wayang kulit (shadow play), wayang wong (actors) and wayang golek (marionettes). The stories are all much the same in the three varieties. I have seen wayand kilit and wayang wong. It is quite fascinating. The shadow play is mainly performed in the country around havest time, but you may see the...More  ","tripadvisor_monas_25":"Worth going to see if you have half an hour to spare. This place gives you a good historical view of the concept of puppetry in Asia, not just Indonesia. As usual the building is poorly maintained and the displays leave something to be desired. I would hate to see what this is like in 5 years!","tripadvisor_monas_26":"If you love the wayang, you should have been here because it has so many diversity of wayang and the souvenirs in form of wayang (prices vary from idr20 to idr 200).Except that, i dont think there will be the second time unless it is re-renov. The places dont have aircon, or maybe because of the too many people...More  ","tripadvisor_monas_27":"Puppets in Indonesia range from quite small to over 15 ft high. The artistry is amazing, if somewhat strange to 'western' eyes at times. Just a fascinating place to visit.","tripadvisor_monas_28":"Cheap and cheerful 10 minute museum of local puppetry. This is a large collection of indonesian heritage puppets. Badly displayed and with little explanation. But it is cheap and worth the short time it takes to go around and see some fantastic creations. Gift shop is good for a souvenir","tripadvisor_monas_29":"museum is adjacent to the square in Old Town. Some areas are with air con, the other areas are hot. there are interesting tombstone of some early Dutch residents who were buried in the area where the museum was erected. The words on the stone are in Dutch but you would have an idea what it says if you understand...More  ","tripadvisor_monas_30":"this place is good to visit for solo or family to get more knowledge about wayang history. went here alone, if not mistaken the ticket was only idr 5000. you can see many traditional puppets","tripadvisor_monas_31":"There are a lot of Wayang here. You can learn a lot about their history.The light a little bit dark.There is a Musholla here.","tripadvisor_monas_32":"This museum is in a beautiful place, the puppets exposed have an incredibly potential, I mean, this country is very rich and his heritage is amazing. Unfortunately a lot of museums cannot display well this richness and this museum is the example. Not well described, not clean, a lot of puppet displaied not so well.","tripadvisor_monas_33":"This museum really need renovations and lamps. It is too dark dan dusty, not comfortable for children.","tripadvisor_monas_34":"Some of the exhibits are a bit run down, and its relatively small museum. But the puppets from all over Java are cool to see.","tripadvisor_monas_35":"This museum really need renovations and lamps. It is too dark dan dusty, not comfortable for children.","tripadvisor_monas_36":"i'm not a wayang lover but i found this spot interesting as it told me quite a lot about the history, stories and also live performance.. wayang is a puppet or doll, dressed and performed by hands, the stories are often about hindunese stories","tripadvisor_monas_37":"Indonesia has a very rich tradition of puppetry, particularly shadow puppets and the wooden puppets. This museum is dedicated to displaying a significant collection of puppets from the various cultural areas of Indonesia and also ones from further afield which have been gifted.The museum is VERY cheap to enter 5000IDR (0.50AUD). However, unless you are lucky enough to secure...More  ","tripadvisor_monas_38":"A large group of us visited on a Saturday morning. Wayang museum is superb! Beautiful and the puppets are just amazing. 2 floors and a range of puppets from Vietnamese water puppets to punch and Judy. Thai, Indian and French puppets too! Some are pretty spooky so be on your guard! Our guide and puppet master Andy Sanjaya was the...More  ","tripadvisor_monas_39":"The Wayang Museum is near Taman Fatahillah in the heart of old Jakarta. The Museum is quite fascinating, especially if you have an interest in the wayang, which is usually translated as \"shadow play.\" The wayang kulit is so called because the puppets are made of buffalo skin. Wayang golek is the name for marrionettes and wayang wong is a...More  ","tripadvisor_monas_40":"Museum Wayang is housed in a former protestant Dutch church and that adds to the ambience. Great collection.Our guide was very knowledgeable and apparently travels with his Wayang group to many places in the world.Museum Wayang is closed on Sunday.","tripadvisor_monas_41":"there is a good selection of puppets here and maybe they could take some display advice from the bank of Indonesian, its charm is that it is not too modern though for such a traditional art. i agree with other comments that they need to be displayed with better lighting and for some pieces back lighting would demonstrate their intricate...More  ","tripadvisor_monas_42":"This museum has one of the best collections of puppets from different parts of Indonesia as well as from China, India, Vietnam, and even some from Europe. I just wished that the museum should be renovated and the puppets to be enclosed in a more creative manner, as well as in a climate controlled environment. It is an interesting museum...More  ","tripadvisor_monas_43":"it's good when visitors know sometijng about the wayan. Then you see and understand more of the visit.","tripadvisor_monas_44":"Really interesting, quite a wide collection. Entrance fee is Rp5,000 for all people so can't blame them about lack of a/c. Presentation could do with some work, some explanations...read more ","tripadvisor_monas_45":"They have a beautiful collection of Wayang but this museum is so poorly lit and they are poorly displayed.This is so important to the Indonesian culture but the museum doesn't get it right.Also beware you will be accosted by a tour guide who will expect a \"tip\" at the end. I would have rather spent more to get...More  ","tripadvisor_monas_46":"We were greeted with a big smile at the door and given a tour with the history and lots of information about all the puppets in the museum and a little history about the area too. We then went into the theatre where we saw how they were made and had the opportunity to buy a puppet to take home....More  ","tripadvisor_monas_47":"I had high hopes for this museum but left very disappointed. The Wayang culture is so important to the history of Indonesia and this museum doesn't do it justice. Many of the exhibits were poorly maintained and ill lit. A curator is desperately needed. Also we were accosted at the front door by a guide who wanted to show us...More  ","tripadvisor_monas_48":"Make it references abt art of puppet and enjoy the dance show. Here u can findout the cultured style influence on the puppet art and fees for d entry abt 5000rp.","tripadvisor_monas_49":"An extensive display of puppets, musical instruments and costumes from Indonesia's history all housed in an old part of Jakarta built by the Dutch settlers","tripadvisor_monas_50":"Really interesting, quite a wide collection. Entrance fee is Rp5,000 for all people so can't blame them about lack of a/c. Presentation could do with some work, some explanations in Indonesian and English, others not.","tripadvisor_monas_51":"It was a great visit. My first visit indeed. Some infrastructure needs improvement, aircon was not working properly.Overall, great experience both in fun in learning! if you go there on weekends, make sure you don't miss various attractions just outside the museum.","tripadvisor_monas_52":"This museum located in OLD Jakarta , in the side of Fatahilah , for Indonesian people entrance fee Rp 5.000 , you can see variant of Indonesia wayang here, puppet, wayang Kulit , Sunday they have wayang performance .","tripadvisor_monas_53":"It is a cheap museum and quite small. the collection itself might be quite extensive but the way it is presented is just not appealing. The exposition cabinets are dusty and grey, lighting is insufficient and there ar eno proper infos in English. If you have some time to kill, go see it- but making an extra effort to see...More  ","tripadvisor_monas_54":"This wayang museum located close to Cafe Batavia Jakarta or people usually call the area 'Kota Tua'.Its like a cultural area where you can find few museum here and old heritage Cafe Batavia.An interesting museum to learn the history of Puppets and butterfly as a bonus. And cup of tea or coffee at Cafe Batavia afterward.","tripadvisor_monas_55":"Its nice to walk around and see the interesting puppets. But its a quick tour without a ton of info. For the price its great.","tripadvisor_monas_56":"Its nice to walk around and see the interesting puppets. But its a quick tour without a ton of info. For the price its great.","tripadvisor_monas_57":"If you'e not into dolls and puppets, this museum can feel a bit creepy. But it's well-kept although mostly, you'll be on your own when you look around so better have a companion with you. The huge collection of wayangs (puppets) are impressive and really showed Indonesian culture at its best.It was good that we saw a puppet show...More  ","tripadvisor_monas_58":"This place stored lots of Indonesian puppets and some of the international puppets.We happened to meet Mr Aldi , one of the guide that speak English. He will gladly to tell the story of the puppets and how they make them. If you were lucky, he might give a spesial performace.","tripadvisor_monas_59":"this museum is full of puppet or wayang from Indonesia and other part of the world like Malaysia, Thailand and even Europe. Other than puppet, there is Jan Pieterszoon Coon tomb and that is that. If you're lucky you can see live wayang show for free.","tripadvisor_monas_60":"Museum Wayang is Located at the same place at Fattahilah Square. It's like beside the Fattahilah Museum. Here we can see the Culture of indonesia in Puppet. You can find so many Puppets here, from many Part of Indonesia. They also have so many Character. If i'm not mistaken here they have performance of Puppet on Certain Time, you can...More  ","tripadvisor_monas_61":"a year ago, me and my friends got a project, to make a trip to the tourist attractions and do a presentation in front of the class. Our choice fell to the puppet museum. once we got there, we were greeted by a friendly officer who give us a ticket. for the ticket prices, there are various ticket prices (e.g...More  ","tripadvisor_monas_62":"I am an avid museum visitor. I think this museum needs some TLC. Exhibits are old and poorly - managed","tripadvisor_monas_63":"I took a guided tour and it was a little fast. You could spend ages here if you are interested in puppets and their use in local culture. The Museum is housed in an old church and is one of the few in the area to actually be looked after. You get a very brief look at how the puppets...More  ","tripadvisor_monas_64":"It was a great museum. It showcased the Wayang or the dolls native from Indonesia. I really enjoyed it although it was really hot in the museum. They should fix the AC.","tripadvisor_monas_65":"The English translations need some serious work. This is definitely not meant for foreign tourists. However, you do not get to see puppet museums in many places.","tripadvisor_monas_66":"Beautifully made dolls, interesting experience specially if you know some about Ramayana (Rama & Shinta)","tripadvisor_monas_67":"indonesian heritage wayang we must see and learn. a lot of phylosophi there. so we are good in mental.","tripadvisor_monas_68":"A unique experience to see how the traditional Indonesian puppets are made. The museum teaches out of work children this timeless art and uses donations and purchases to fund this activity. Some puppets are over 100 years old and if you are lucky the puppetmaster will give you a personal show :-)","tripadvisor_monas_69":"Beautifully made dolls, interesting experience specially if you know some about Ramayana (Rama & Shinta)","tripadvisor_monas_70":"We had a good time seeing the vast collection of puppets that range from traditional wooden stick puppets to ornately decorated two dimensional puppets. Captions explain small bits of the cultural significance of each character, though the English is sometimes hard to decipher.We were really impressed by the craftsmanship of the various puppets and enjoyed imagining how they are...More  ","tripadvisor_monas_71":"the wayang museum is really interesting because they have almost 1000 collection from wayang and not only from Indonesia but all over the world. Its really interesting to know how are the puppet in Indonesia and other countries.","tripadvisor_monas_72":"it's just the problem with most museums in Indonesia. It's old, dusty and it needs renovation. Mostly visited by school groups or tourists who happen to be in the neighborhood. As a local, it's not a place that I would come back to visit. The ticket price is cheap so I don't think they can maintain the upkeep of the...More  ","tripadvisor_monas_73":"Located near the Fatahillah Museum at Kota Tua, Jakarta, Wayang Museum is a museum that keeps historical traditional puppets from Indonesia and other countries. There are so many puppets such as Wayang Potehi, Wayang Kulit, Boneka Unyil (Unyil dolls). for each puppet, you will see the explanation, the history of the puppet. But the English translations are 'screwed-up'.How to...More  ","tripadvisor_monas_74":"I love museums. Museum Wayang or Puppet Museum is very lovely. If you've never been there, you should. Just put it in your itinerary if you are planning to visit the Kota Tua (Old Town) area. However, too bad the displays are old and some of them are not cleaned properly.But you still must go there ;-)","tripadvisor_monas_75":"Wayang means a theatrical performance using shadow puppets or human dancers.The museum is located next to Fatahillah square. On display are various puppets made of leather or wood, collected from different parts of the country like Bali and Central Java as well as Malaysia, Cambodia and Thailand.You will also see an extensive set of brass and copper 'gongs'...More  ","tripadvisor_monas_76":"The museum sits on the foundations of a Dutch Church in the old city square. The museum entry was about Rp 5,000 per adult and less than half of that for small kids. The exhibit consists of various types of wayang. Most placards/explanations are in Indonesian, some are in English. The museum pamphlet/map you receive at the entrance does help...More  ","tripadvisor_monas_77":"I visited this museum on May with my friends. I like to go to the museum to learn about everything that I can learn. This is one of the old museum, located at the old town of...read more ","tripadvisor_monas_78":"Museum Wayang is my favorite museum. I visited Museum Wayang this June with my best friend. I think this museum condition is getting worse and worse.","tripadvisor_monas_79":"I visited this museum on May with my friends. I like to go to the museum to learn about everything that I can learn. This is one of the old museum, located at the old town of Jakarta. This museum contains wide collection of puppets from Indonesian puppets to worldwide puppets. It also has the description of each puppet that...More  ","tripadvisor_monas_80":"Rundown museum with nothing much to see. Not worth your time to visit it if you are familiar with the Javanese culture and puppets. Wayang kulit. Can consider going if you want to check out the weekend market and stalls at the square outside the museum. Only on certain weekends.","tripadvisor_monas_81":"Shadow puppets, tall puppets, antique puppets, etc. If you're interested in the evolution of puppetry in Asia, and specifically Indonesia, come to the Museum Wayang. There are docents available to talk you through the displays. Worth an hour of your time","tripadvisor_monas_82":"In the charming Old jakarta square this old church converted to a leather puppet museum is quite quaint!There are Dutch era tombstones still in its central courtyard. In other rooms there are several puppets to show the cultrural edifice of Indonesia. Many are characters from the epic Ramayan and Mahabharta. Mr Happy at the entrance is unique. There is...More  ","tripadvisor_monas_83":"If you wanna know about puppets, go to this museum! At least you can broaden your horizon more about puppet. It is surprisingly makes me shocked there are so many wayangs puppets entire Indonesia. I was so happy visiting it. I can buy wayang souvenir here. So lovely! It is recommended for family, friend or couple visit! Enjoy Jakarta","tripadvisor_monas_84":"I particularly liked the men who answered questions and had a good knowledge of wayang performances, puppet names, and quick private show of shadow puppets","tripadvisor_monas_85":"It's not really worth going. The puppets aren't really visible as the displays they're in are poorly lit. Some displays are on knee height. Besides that it's hard to see anything with all the local visitors taking selfies continuously in front of every display. I think when it's less busy it's probably a better experience.","tripadvisor_monas_86":".., each figure has its own history ... wanting to stay illusorily alive!These puppets are a book to devour with your eyes... very ineresante!","tripadvisor_monas_87":"the place is not too good or not too bad. just old place with many old puppet and little bid haunted caused the place.better you see old town (kota tua) museum","tripadvisor_monas_88":"Entrance fee is between IDR 5000 or 10000 per person (I forgot). The museum is a two story building. At first floor mostly about wayang golek. It has poor light downstairs so I...read more ","tripadvisor_monas_89":"Entrance fee is between IDR 5000 or 10000 per person (I forgot). The museum is a two story building. At first floor mostly about wayang golek. It has poor light downstairs so I found the place is creepy.There are big statues from rock that has something written in Dutch. I dont understand what's the meaning. I imagined it's a...More  ","tripadvisor_monas_90":"We took this tour given by the Fraser where we live. Daniel the Curator of the museum gave us a small group tour and I would suggest if you go to have him give you the tour. Daniel knows all about the puppets and history because its what his family has done for years. I was amazed at the history...More  ","tripadvisor_monas_91":"We liked the English speaking 5th generation tour guide, Mohammed Adli.Lucky to have avoided the 500 school kids who were scheduled to arrive!","tripadvisor_monas_92":"Very nice setting and lots of history around Wayang, be careful with the manager it imposes on you as a guide and it is not worth it. Must of the written stuff is in Indonesian and in English.","tripadvisor_monas_93":"We had a quick tour of the facility, and even got a brief shadow puppet performance. The host was very friendly and accommodating. It's location off of the Fatahillah Square is also convenient.","tripadvisor_monas_94":"I like puppetry and learned much from this museum. It was fascinating seeing the different characters used in the puppetry, though with my untrained eyes, it was difficult to tell the 5 brothers from Sri Rama and Sita.Yet, it left me wanting to see a little bit of the puppetry under the instruction of an interpreter in order to...More  ","tripadvisor_monas_95":"This museum was just okay. It didn't live up to some of the reviews I'd read about it. If you have extra time, then definitely stop in. If not, don't feel too bad about it.","tripadvisor_monas_96":"The Puppet Museum has a comprehensive collection of all types of puppets (and marionettes) but specializes in the Wayang shadow puppets from Indonesia, China, Malaysia, and India. As our guide, we had a famous puppeteer who both made puppets and also performed and toured most of the world for the past 40 years. He was significantly better than some of...More  ","tripadvisor_monas_97":"We got a lovely show from the son of the man who owned the museum. We bought some puppets and other related souvenirs. It is near the Batavia cafe, the leaning tower, the dock area, the city museum and the canal bridges.","tripadvisor_monas_98":"Museum Wayang has tremendous collections from around the world. I like.being here and do sightseeing, reading all.the stuffs they display. The only thing that very fundamental is the poor.maintenance.","tripadvisor_monas_99":"I already visited this museum a couple of times. They have many collections of wayang (puppets). The entrance fee is very cheap, 5000 Rupiah for adult, 2000 Rupiah for kids and...read more ","tripadvisor_monas_100":"Great variety of exhibits. Very interesting collection of antique puppets. They try to get you to purchase souveniers at the exit and were a bit pushy. Prices turned out to be much less than anywhere else though.","tripadvisor_monas_101":"I already visited this museum a couple of times. They have many collections of wayang (puppets). The entrance fee is very cheap, 5000 Rupiah for adult, 2000 Rupiah for kids and students. I advise you to visit this museum on Sunday because they also have traditional wayang performance every Sunday start at 10am. Very interesting but they need better maintenance...More  ","tripadvisor_monas_102":"I loved learning the history of the puppets and the important part they played in past Indonesia culture. I definitely recommend visiting, although it helped that I had a tour guide with me to provide more information. Such incredible detail on some of the puppets.","tripadvisor_monas_103":"Museum wayang as the name say shows of a vast array of wayangs (puppets). There is a good variety of 2 and 3-dimensional puppets. A must for performing arts enthusiasts. They are currently renovating.Generally the corridors and exhibition sites are dark and rather spooky, air condition and ventilation is quite poor so you get a mixture of old items...More  ","tripadvisor_monas_104":"Ok, a bit dark and dusty and somewhat interesting. Suggestion, hop in the front door and look around the lobby and at the teeny tiny gift shop and then move on down the road. I took a couple pics inside. Really really hot inside.","tripadvisor_monas_105":"This museum could be much more comfortable if treated properly.The museums is dirty , smell musty and dark.Hope government more attention","tripadvisor_monas_106":"I had visited several years ago, I thought they had done some reservations so just visited again when I was passing through Kota but it's still the same as always. Maybe things would be different for a special event or with a guide but we didn't do either.If you're really into wayang it's worth it, but for those who...More  ","tripadvisor_monas_107":"You can see all kind of wayang /puppet in this museum. Wayang from west Java,Central Java,Cirebon and from other places of Indonesia gather in this museum.The collection of this museum are complete and beatiful,but the display and lighting are not well managed.However this museum is educative and informative.","tripadvisor_monas_108":"We were led through the museum by the head puppeteer, who also makes the puppets. He was able to provide a really good explanation of the history and manufacture of the puppets.","tripadvisor_monas_109":"The museum shows a lot of Wayang collections and almost represent all of the Wayang arts in Indonesia. Honestly, I don't really into Wayang things so it quite creepy to see those creatures. What made me Interested was the building formerly had a cemetery of Dutch Governor in colonial era. Well, maybe if you love Wayang things or don't know...More  ","tripadvisor_monas_110":"Wayang Museum is a must-see especially for the kids. This museum also presents the Ramayana and Mahabharata using their puppets. Traditional musical instruments were also played...read more ","tripadvisor_monas_111":"Wayang Museum is a must-see especially for the kids. This museum also presents the Ramayana and Mahabharata using their puppets. Traditional musical instruments were also played during the presentation... Puppets made of various materials were well kept and preserved.","tripadvisor_monas_112":"Go early to avoid school groups. The puppets are amazing and intricate but the explanations are somewhat limited. My interactions with the manager were what made this so worthwhile. He took the time to explain how the puppets are made, his family's role in the tradition, and the stories that the puppets are used to illustrate.","tripadvisor_monas_113":"Provide lots of puppets models and also explain the story within and explain. Most of the puppets are traditional puppets from Indonesia. Standard maintenance. They put puppets in the showcase.","tripadvisor_monas_114":"I think this is a museum with one of the best collection in Jakarta. Especially if you compare it with museum Fatahillah which is located nearby. However, similar with most of museums in Indonesia, the building is not really well maintained. Never mind, as you will forget about it once you see the huge collection of puppets there. As not...More  ","tripadvisor_monas_115":"looks it have a very low budget… may be a good sponsor would be needed. the building is nice located in the old Batavia city center.","tripadvisor_monas_116":"Have been dying to learn more about this fascinating craft. Museum is cheap, so it is really accessible to all. However, there is decided lack of proper curation and presentation, so a story that could be so very rich and informative is not. It just isn't. Poorly lit. I feel like I missed so much. There was a tout who...More  ","tripadvisor_monas_117":"This museum has lots of great wayang puppets, but the displays are very poorly put together, with very bad lighting and little or no information about the exhibits. However, the puppets themselves are very interesting. They also have performances at certain times during the day, so it's worth checking the times.","tripadvisor_monas_118":"I love wayang, and being in a building with a bunch of them is HEAVEN. With a very cheap ticket you can take a look of the vast collection of wayang and traditional puppets from different locations of Indonesia and the world with a friendly guide explaining to you about their origins and stories. One minus point though for the...More  ","tripadvisor_monas_119":"We were the last visitors before the museum closed for the day. We were offered a free tour of the museum by a local puppeteer. Great command of English, funny, and very informative. He told us stories about his father and grandfather who were also wayang kulit makers and gave very detailed explanations of the puppets on display.At the...More  ","tripadvisor_monas_120":"It is a nice place with a great collection, pity about lighting arrangement in some rooms. some of the puppets are superb. there is a show every sunday 10 am and 2 pm so try and make it if you can. The musueum is located in a very central place so u can access a number of attractions in Kota...More  ","tripadvisor_monas_121":"The museum is in an old Dutch building that I believe was a church or something at one time as there are some graves (a governor?) in the courtyard. The puppets are also cool to...read more ","tripadvisor_monas_122":"The museum is in an old Dutch building that I believe was a church or something at one time as there are some graves (a governor?) in the courtyard. The puppets are also cool to photograph or just to look at plus there is a big collection of the instruments that are played during a puppet show. However, I could...More  ","tripadvisor_monas_123":"Really well worth the hour or so to walk through and see all of the puppets. Great art and cultural heritage. If you're lucky (I was) you'll see a performance, too, with great musical accompaniment. Recommended!","tripadvisor_monas_124":"When I visited this museum, I was surprised. This museum exhibits a lot of things and very very good. Despite the old and unmaintained building, all the puppets show a lot of knowledge of puppet in Indonesia, as well as all over the world.Amazing!!Unfortunately, the museum looks ugly from outside. And also all the collection seems dirty.Though...More  ","tripadvisor_monas_125":"Lots of puppets collections and story behind them, but the building needs major refurbishment. Maybe increase the entrance fee, then start to do refurbishment little by little. C'mon, this is the museum where students and tourist will learn a lot from.","tripadvisor_monas_126":"it was quite busy while we were there loads of puppets and not much else,then at the end a show that you could sit in and watch,but it can go on for up to 9 hrs,cheap to visit","tripadvisor_monas_127":"Great museum, puppets were excellent, well presented, lighting excellent. Fantastic place to view some of Indonesian history. Excellent place to take children.","tripadvisor_monas_128":"An interesting reflection on one small part of Indonesian culture - shadow puppetry...worth having a look at the range, style and various sizes of puppets that make up the artistry of puppetry.","tripadvisor_monas_129":"You can see wayang from Indonesia, I like Si Unyil very much! This place also have other puppet collection from other country.. The entry ticket is very cheap. But I don't really like the atmosphere, a little bit creepy. Especially in section which shown international puppet collection :(","tripadvisor_monas_130":"Easy to get to from the Kota KRL station, this museum houses... thousands?... of marionettes and traditional Javanese shadow puppets. The intricate design on many of them is fascinating! There's also a room full of puppets that have been donated to the museum by other countries. Most of the English signs (where they exist) don't make any sense at all,...More  ","tripadvisor_monas_131":"In the heart of Batavia, old Jakarta, this museum is dedicated to traditional Indonesian Wayang. We were met by a very informative member of the puppeteers. He has travelled all over the world entertaining.The museum is extensive and very interesting with plenty of information but not always in English. However another very enthuastic member was very excited about His Museum.","tripadvisor_monas_132":"I was curious about the old town district so I brought along my boyfriend to accompany me here.The first museum we got in was this Museum Wayang. The entrance ticket was only...read more ","tripadvisor_monas_133":"This unique museum, in an old Dutch building in the heart of what used to be called Batavia, has been lovingly created to illustrate the fascinating art of Indonesian puppetry. For anyone with an interest in Indonesian culture this museum is a \"must see\".","tripadvisor_monas_134":"Set in the old Dutch colonial district on a site formerly housing two churches, overlooking this square. Puppetry as a major art form of story telling in Indonesian culture is well represented and displayed, along with a collection of puppets both old and contemporary from around the world.","tripadvisor_monas_135":"Definitely worth a visit. I believe the puppet shows start at 11 a.m. on Sundays each week. I sat in on one, but you can also spend at least an hour roaming about looking at the puppets. Beware the men who approach you as you exit -- they will take you to the building across the road and give you...More  ","tripadvisor_monas_136":"I was curious about the old town district so I brought along my boyfriend to accompany me here.The first museum we got in was this Museum Wayang. The entrance ticket was only a few thousands!There were various type of wayang inside. From local to international. All is fascinating. I found myseld looking at one of the wayang thoroughly,...More  ","tripadvisor_monas_137":"This is a place where you could find puppets, any kind of puppets. Too bad is not well-managed nor maintained. If it were, this could've been one of most favourite cultural places in Jakarta.","tripadvisor_monas_138":"We visited this museum with '' Hidden Jakarta Tour'', and this is how we learned how important Muppets were in the Indonesian culture . For an Westerner where muppets are considered as toys , a guide is recommended to fully appreciate the characteristics and the values of the different pieces of art ( not toys ) presented ! So to...More  ","tripadvisor_monas_139":"The lighting was extremely poor here and it was difficult to see the excellent collection of puppets.","tripadvisor_monas_140":"There was a puppet show that was going to start but we didn't have 2 hours to see it. Just walked around and viewed the many puppets in display cases. Worth a visit as it's located in Taman Fatahilah Square.","tripadvisor_monas_141":"Located in the Taman Fatahilah Square (the historical district of Jakarta), this puppet museum keeps collections of wayang from various territories in Indonesia and even from other countries. To gain some knowledges about shadow puppet before you go there would make your visit more interesting.","tripadvisor_monas_142":"We had a nice guide who explained to us the stories behind the puppets and origins of the puppets.But after a while, my daughter found it rather repetitive. I did too.After the walk, our guide brought us to a puppet seller elsewhere. It was unexpected and I didn't feel very comfortable following him to the back streets. It...More  ","tripadvisor_monas_143":"If you're familiar with Indonesian puppet shows and/or speak Indonesian, this museum will appeal to you but if you're not, it's a curiosity, without much of an explanation for its...read more ","tripadvisor_monas_144":"If you're familiar with Indonesian puppet shows and/or speak Indonesian, this museum will appeal to you but if you're not, it's a curiosity, without much of an explanation for its appeal.","tripadvisor_monas_145":"In the main square of old town Jakarta, in a old Dutch building, it can be very interesting if you found of wayang, and if you do not know about it, on Saturday morning there is a wayang show that worth while go.","tripadvisor_monas_146":"Look for Bapak Alex. He is the puppet-master and has traveled the world representing Indonesia. He'll give you a private tour at this museum and the other museums nearby. Just give him a tip afterwards. Very nice man and speaks English. The Dutch catacombs at the back of the museum is interesting.","tripadvisor_monas_147":"If you ever saw the great movie \"Year of Living Dangerously\" you will really love this museum! It is the world's best collection of Indonesian puppetry from the old Wayang ceremonies. A deep cultural attraction that just takes a little research to really appreciate. Definitely worth an hour or two!","tripadvisor_monas_148":"Museum wayang is location in an old town, which famously known by local as Kota Tua. It's a really interesting little place to visit with a mixture of the wonderful puppets that are so renowned throughout the world and some histories behind. It will be great if you can do some studies on their background so you can get a...More  ","tripadvisor_monas_149":"We were shown around the museum by a puppet maker. He explained the symbolism of the different types of puppets and was really interesting. He answered questions we had about the puppets. We did not get to see a puppet show unfortunately. At the end we saw how the puppets were made and could buy the finished product. We had...More  ","tripadvisor_monas_150":"I visited this museum to take my families from abroad, it has so many puppets and i think they also have one deutch graveyard inside CMIIW.Nothing much to see, if you like puppets and other old collectibles which related to puppets this place is the way to go.believe or not, when my niece which is 12 years old...More  ","tripadvisor_monas_151":"We deliberately went to this museum to see a rare display of daggers from all over Indonesia. However, we also spent some time looking at the puppets and also viewing the burial place of the man strongly involved with Jakarta's beginnings - Jan Pieterszoon Coen - which is also located within the museum grounds.","tripadvisor_monas_152":"Nice museum: gives a great overwiew of Wajang culture. Also it's nice to see the location as it's an old church with many landmarks. Friendly people, go to CAFE across the road upstairs : Batavia for great ambience.","tripadvisor_monas_153":"I've been here several months ago. I only paid 2000idr for entering this museum. The puppets collections are many but unfortunately they are not managed well. Some puppets are broken and dusty.The rooms are lack of light and also the air conditioner in each room didn't function properly :( In fact, there are many foreigners visiting this museum.I...More  ","tripadvisor_monas_154":"This is a nice little museum with various types of puppets and dolls on display. Its housed in an old church in the Kota area. The displays could be better but the puppets are...read more ","tripadvisor_monas_155":"This is a nice little museum with various types of puppets and dolls on display. Its housed in an old church in the Kota area. The displays could be better but the puppets are very unique and interesting.","tripadvisor_monas_156":"Personal guide through the displays so was able to appreciate the symbolism of these intricate puppets. Some time in the puppet show to understand the role of puppet shows and experience the whole production with an orchestra ….Productions can go for up to 9 hours and are used to educate and present moral choices and consider consequences. Chance to see...More  ","tripadvisor_monas_157":"My ratings for museums correlate with the price paid to enter. Considering this museum cost all of $0.40, I didn't expect much.The Museum Wayang isn't very big, but it does have some very interesting and odd looking puppets from Indonesia history. Definitely worth checking out. There is also a nice courtyard in the middle.They are renovating the second...More  ","tripadvisor_monas_158":"Entrance is only 5000rupiah..around Kota Tua area..I just love the interior of this building..old nice cosy..you see alot of puppet around Indonesia n some around the world..Worth to visit...","tripadvisor_monas_159":"It's right across the famous Cafe Batavia, anyone comes to Kota Tua for a dose of yesterday should not miss seeing this museum. Lots of shadow puppets on display. However, most part of the building is not air-conditioned, it can be quite stuffy. Also there is insufficient lighting and very small signs in English. Bring a small torch just to...More  ","tripadvisor_monas_160":"interesting but small museum, probably the only place where you can find traces of culture in Jakarta.","tripadvisor_monas_161":"We were lucky to visit Indo on Sunday, since we had a chance to visit this place.Very nice museum and the historical value.I loved the traditional atmosphere. The puppets were mainly from Indonesia. They expressed their tradition and their customs very well.I really loved it. Somehow, they helped me to love more Indo people, Indo country and...More  ","tripadvisor_monas_162":"Traditional puppet show on Sunday morning. The puppets on display are mainly from Indonesian provinces however there are a few puppets from other parts of the world","tripadvisor_monas_163":"The museum is nice, especially the (historical) building itself. I found the collection rather limited.","tripadvisor_monas_164":"we were informed that wayang kulit show is informed on sudays; hence were not able to see the show but the general information offered was informative and helpful.very impressive colonial builing.","tripadvisor_monas_165":"This place was awesome, it showcases traditional puppets and costumes. I really enjoyed my visit to the museum.","tripadvisor_monas_166":"This place was awesome, it showcases traditional puppets and costumes. I really enjoyed my visit to the museum.","tripadvisor_monas_167":"We were only in Jakarta for one day but decided this sounded like something different. It was only 5000rp entry and its Suprisingly interesting (if a little creepy). Staff are friendly and speak great English. Lots of puppets. Something totally different. Just pop in...","tripadvisor_monas_168":"This is well worth visiting as it contains many of the traditional wayang from around Indonesia. It is better to have a guide because the labels on the exhibits are poorly translated. If you visit on a Sunday there is usually a performance but not during Ramadan.Make sure you set off early to visit because the traffic is always...More  ","tripadvisor_monas_169":"i was in the right time before they performed the show, its very nice museum that you shouldn't miss during your visit to Jakarta! its one of the few place to get a grab on Indonesian cultural heritage","tripadvisor_monas_170":"Not exactly what you expect but really interesting. Staff speak languages as well so it is good for tourists.","tripadvisor_monas_171":"The only thing that interested me about this museum was the art and detail in the puppet designs and the Batavia architecture of the museum.It portrays a lot of history, so its good that this information is preserved for the nationals.Outside this museum there is a busy market plain and as a foreigner you need to take care...More  ","tripadvisor_monas_172":"There are various puppet from all parts of Indonesia, some other countries, and also traditional mask. They are unique. If we have time, going through every information of the puppets must be interesting.However the puppets arrangement from the entrance alley could be better and lighting could help as it was a little dark and dusty.The entrance fee is...More  ","tripadvisor_monas_173":"I liked this Wayang pupppets, but also the reminding tombstones of the dutch. they do us remember quite a history far from their homes !","tripadvisor_monas_174":"Museum wayang is a really interesting little place to visit. A mixture of the wonderful puppets that are so renowned throughout the world and some history thrown in. In Kota Tua (old town) it is a bit of a tourist trap and as a bule you will be charged more. However more means nothing, a matter of an extra few...More  ","tripadvisor_monas_175":"This is an interesting Museum. Wayang, is a traditional puppet throughout Indonesia, they are traditionally shadow puppets and told with very ancient stories.....that people in Indonesia flock to see. The Wayang tradition is held within families and the crafting of these puppets is revered. Some of the guides do speak suffiecient English and will enhance your experience here.","tripadvisor_monas_176":"I love museums, and this one displays lovely and interesting shadow puppets - an important part of Indonesian culture. The puppets are intricate and lovingly made, detailed beyond...read more ","tripadvisor_monas_177":"I love museums, and this one displays lovely and interesting shadow puppets - an important part of Indonesian culture. The puppets are intricate and lovingly made, detailed beyond belief and quite beautiful (in a slightly bizarre way) But don't expect to understand anything about them, because unless you speak Indonesian, you won't.If you're lucky you'll get a chance to...More  ","tripadvisor_monas_178":"great stop to get out of the heat as the museum is air conditioned, has clean restrooms and some of the coolest marrionettes and puppets around. when I was there they had a free punch and judy show included. can't beat the 5000 Rupiah admission (50 cents U.S.) don't miss it.","tripadvisor_monas_179":"This place is more interesting than the other museums put together, despite suffering from the usual poor signage. It has some really beautiful pieces, and if you go at the right time, you can watch a performance.","tripadvisor_monas_180":"The museum preserves a lot of puppets which gives you an idea of many ancient Indonesian myths and stories, or even history. However, I was a bit disappointed on the puppet show since it took a long time for an opening with only music and singing. You can see many foreign tourists left after waiting for a long time for...More  ","tripadvisor_monas_181":"To see the beautiful puppets is really nice. They are pieces of real art and so colorful. It only costs you one dollar and half an hour to walk through this museum.","tripadvisor_monas_182":"Loved it here. So many creative puppets. Would love for an update of this museum, needs love. It truly is a diamond in the rough.","tripadvisor_monas_183":"A very interesting place for people who likes 'wayang'. This museums got lots of collections, each with a clear explanation in both english and indonesian.","tripadvisor_monas_184":"Puppet museum is located on one side of Fatahillah Square near Kota Railway Station, Jakarta. It was originally the site of a church established in 1640, and got damaged in an earth quake. Then it was restored and now from 1975 is used as puppet museum. The museum is also a venue for training and research on shadow puppets.You...More  ","tripadvisor_monas_185":"2 floors of wayang character puppets which are very interesting to look at. Unfortunately most of the descriptive signage is in Indonesian and those that have English are very badly translated. The museum is often poorly lit making photos difficult and badly ventilated making it hot and stuffy at times. Could do with some renovations but the price is right...More  ","tripadvisor_monas_186":"I have attempted to visit this Museum several times over the years and have backed off until this visit. The deterrent for me is the \"guide\" who purports to be variously, the nephew, the son or some other close relative of the the man who makes the puppets. He is high pressure and desperate. This time I succumbed because I...More  ","tripadvisor_monas_187":"The museum itself is not that big and not well managed but there are a lot of interesting puppet and mask pieces ! Most of the puppets are from Indonesia, while others include...read more ","tripadvisor_monas_188":"The Wayang Museum is fine for a quick visit if you're nearby. There puppets are beautiful and highly detailed. However, don't be too polite (or gullible) to turn down the free guide, allegedly related to a long line of puppeteers. You'll be bombarded with unbelievable stories about the puppets and building before being led to a \"workshop\" to buy overpriced...More  ","tripadvisor_monas_189":"The museum itself is not that big and not well managed but there are a lot of interesting puppet and mask pieces ! Most of the puppets are from Indonesia, while others include Canton, French, Thai, British puppets (dont expect a huge collection on these, only a few from each places). Sincer Indonesia is famous of puppet show, this museum...More  ","tripadvisor_monas_190":"You can see many kinds of Indonesian Puppet. And also we will know more about puppet from another countries (from China, Thailand, etc)...Very Nice !!You can also learn about history of puppet from many cities in Indonesia.","tripadvisor_monas_191":"Not only do theyamazing collection of the traditional Wayang (pupets) but they also have performances so that visitors can see the Wayang spectacle. Usually the script of the story evolves with the performance, and quite often the performers include members of the audience in the ad hoc script, it is real fun","tripadvisor_monas_192":"I visited the museum around last year, 2011 . The museum not well manage, very dark, spooky. Not one of the best museum in Indonesia.","tripadvisor_monas_193":"here you can see, learn and find out what wayang is, we take a short tour and learn much about wayang and Indonesian tradition.","tripadvisor_monas_194":"I didn't expect much of this place. One of the owners befriended us in a nearby museum and gave us a very personal tour of this place founded by his grandfather. He showed us the first 12 exhibits or so and then launched into what must be a necessary (but low key) sales pitch for maintenance of the (otherwise free)...More  ","tripadvisor_monas_195":"Good collection of puppets, presentation is sufficient but high humidity and temperature made this visit uncomfortable.","tripadvisor_monas_196":"I've never thought that the puppet museum has a lot to offer. So many informations.. great collections with some interactive programs. Really enjoying my visit.","tripadvisor_monas_197":"MUSEUM it is quite hidden, the location is kind of challenging to find because it's not along the road but what would help you to locate is to keep the entrance photo in your memory (you may view it here on trip advisor) because the buildings around it look kind of similar.THE PUPPETS really good display. There are life-size...More  ","tripadvisor_monas_198":"The museum is located at Fatahillah Square, Old Town Jakarta. It has a collection of various kinds of wayang, such as wayang kulit, wayang golek, grass wayang, mask wayang...read more ","tripadvisor_monas_199":"The museum is located at Fatahillah Square, Old Town Jakarta. It has a collection of various kinds of wayang, such as wayang kulit, wayang golek, grass wayang, mask wayang, gamelan sets, wayang sculptures, and wayang painting. It also displays various collections of wayang and dolls from countries like Malaysia, Thailand, Suriname, China, Vietnam, France, India and Cambodia. Inside the museum...More  ","tripadvisor_monas_200":"I visited Museum Wayang about a month ago, accompanying some guests from USA. At first I was only planning to take a short peek, since we have lunch appointment. Once entering the building, paying only 2000IDR (about US$0.20) for each person, we were greeted by a gentleman offering free guide thru the museum. I hesitantly agreed. But little did I...More  ","tripadvisor_monas_201":"We took this is in while walking about the old square. The facility could use a little updating but the substance of the displays was very interesting and the knowledge and enthusiasm of the guide was very good to see. All things considered, it was time well spent if you like to enjoy a bit of the history of a...More  ","tripadvisor_monas_202":"JAKARTA’S MUSEUM WAYANGIndonesia has one of the richest cultures in Asia. Wayang refers to their puppet performances, some based on the Ramayana and Mahabharata of Indian mythology. There are various different forms of Wayang. Wayang Golek puppets are made of wood and are dressed in colourful cloth costumes. The Wayang Kulit range of puppets are usually made of buffalo...More  ","tripadvisor_monas_203":"This is might be the most ordered museum in Jakarta (beside national Museum). The place maybe quite small, but everything is in order by the culture and kinds of Wayang. The place located in great History Museum, nice location. I once made a travel book about Jakarta and this place is a must to write and to travel.","tripadvisor_monas_204":"Yes, it is in need of a revamp, but we had a lovely relaxed hassle free wander around the Puppet theatre one Sunday after lunch at nearby Cafe Batavia. There is a huge array of puppets spanning decades, as well as a selection of puppets from other Asian cultures. Descriptions in Bahasa with some English translations mean you can get...More  ","tripadvisor_monas_205":"This museum actually has a lot of potential to be one of the best in Jakarta. However, some improvements are needed ( perhaps the lightning, the decoration, the ambience) to make it more interesting for the visitor. But if you're in Kota Tua, this museum is worth to be visited, it gives you many information about Indonesian Traditional Puppet :)","tripadvisor_monas_206":"\" Wayang Kulit \" in Indonesian language denotes \" Shadow Puppet \". Since this unique theatrical performance originated and popularised from Java Island of Indonesia , it is called\" Javanese Wayang Kulit \". Stories played under \"Wayang Kulit\" are usually drawn from theIndian epics Ramayana and Mahabharata. It is a unique form of puppets' theatre employing light ,...More  ","tripadvisor_monas_207":"This museum located inside an old colonial building, even inside you could see inscription with JP Coen's name (dutch general during colonial era). but surprisingly the collection are arranged in a kinda modern way (for indonesian museum). and the collection also varies from indonesian wayang (leather puppet) up to european porcelain doll.","tripadvisor_monas_208":"Unfortunately it was closed for renovations during my visit but the guy who runs it, invited me to his training school a few doors down - I am not really into puppets as such but it was educational and interesting to see how they were made.","tripadvisor_monas_209":"Good to know the time of performances. Be prepared to be guided (don't be shy have pre-agreed fees) and the \"guides\" can be quite handful in getiting you to buy souvenirs.","tripadvisor_monas_210":"Good to know the time of performances. Be prepared to be guided (don't be shy have pre-agreed fees) and the \"guides\" can be quite handful in getiting you to buy souvenirs.","tripadvisor_monas_211":"The collection is wonderful and eclectic and the building itself is historical and fun to wander around. Aside from some fantastic traditional puppets, there are some great political ones.I remember it being quite hot inside so I recommend going in the morning before it gets too hot.","tripadvisor_monas_212":"It is a great place to visit to appreciate the unique Wayang puppets. the displays are very good.","tripadvisor_monas_213":"This is my favorite museum in Jakarta. It has a lot of wayang collection. At weekend, we can see wayang show. it is already included in admission fee.","tripadvisor_monas_214":"unless you are really into wayang puppets and performances, the displays are very repetitive and rather boring...but if you're visiting the area, you might as well have a quick look, the entrance fee is very cheap anyways...beware of the 'guides' that give you a free tour, you'll be stuck with them for way too long, having to listen to endless...More  ","tripadvisor_monas_215":"Have been to the puppet showplace before, show with actual marrionetts very good entertainment for kids. Just went to Nappy Sing a Long show with our grandchild Very disappointingshadows on a screen was not the look of a puppet show.Go see the actual puppet in the open forget Nappy","tripadvisor_monas_216":"Im not a huge fan of puppet but i love museum. This museum is small but It has many collections. I suggest you to come here if u come to kota tua cause It only costs u $0.2 and worth it","tripadvisor_monas_217":"If you love culture, history, and folklore, this is one of the places you must visit in Jakarta. It has great collections of different traditional puppets from different areas and ethnicity in Indonesia as well as some from around the world. The display is pretty good, lots of written information in both Bahasa and English. The building is old and...More  ","tripadvisor_monas_218":"Enormous collection of puppets. Presentation as in XIX century, however descriptions are provided also in English which helps in understanding the phenomenon of puppet theatre in Indonesia.","tripadvisor_monas_219":"We happened upon this museum (in Old Town) when it had only been open for 1 week, in May 2010. At that point the puppet theatre was in the process of being set up, but half way around our wander of the building, the owner, Daniel, met up with us and gave us a tour of the puppet theatre and...More  ","tripadvisor_monas_220":"Wish it was was more interactive, but overall a good museum.","tripadvisor_monas_221":"Wish it was was more interactive, but overall a good museum.","tripadvisor_monas_222":"The Wayang Museum in Batavia Square is certainly packed to the rafters with puppets of all sizes and all ages. The history of the wayang in Indonesia is very well represented and quite fascinating. I can understand the tour guides pride in his tradition but the tour was a little too long with a lot of repetition of displayed wayangs...More  ","tripadvisor_monas_223":"A good place to learn about the types,history etc of puppet theater in Indonesia","tripadvisor_monas_224":"Pretty busy on weekends, but worth while to catch a puppet performance (Sunday, 10 am).","tripadvisor_monas_225":"Not very large, but very repetitive. When you've seen one, you've seen 'en all. Well, let's be more accurate. When I had seen one I had seen 'em all. I lost interest after ten minutes. My wife spent an hour, and really enjoyed it. This is a very specialized museum: for some people, it's priceless. For others, it's worthless. Might...More  ","tripadvisor_monas_226":"No fascinating attraction in the museum. The museum is not well maintained. You only need to spend 10 minutes inside the museum.","tripadvisor_monas_227":"Great place, great museum, display well, a good place to learn Indonesian puppet","tripadvisor_monas_228":"When I was there the room a bit smell dust and old,but actually that a good place to learn if we have many different type puppet,and that's good media to give story telling to our kids.","tripadvisor_monas_229":"In the back courtyard, there are still plaques and tombstones marking the sites of the Dutch governors. The principal curator of the museum is a 3rd generation puppet maker.","tripadvisor_monas_230":"The Puppet Museum is situated in a somewhat decrepit building, close to Cafe Batavia. It's very cheap to get in (we paid 2,000 IDR each) and although a little gloomy inside, there's a wonderful display of different kinds of Indonesian puppets, both carved from wood or from buffalo leather. Upstairs, we were fortunate enough to meet the proprietor, who gave...More  ","tripadvisor_monas_231":"Generally the interior is no no exciting, but all puppet inside is so nice. We can learn more about Indonesian puppet from many legend history. Very nice presentation, although...read more ","tripadvisor_monas_232":"Generally the interior is no no exciting, but all puppet inside is so nice. We can learn more about Indonesian puppet from many legend history. Very nice presentation, although some of the lack of quality. But mostly it's very nice for learning something about Indonesian puppet history. Also we can see any others puppets from others countries.","tripadvisor_monas_233":"Facing Fatahillah Square, the center of the old town, the Puppet (or Wayang) Museum is not to be missed. Recently renovated with funds from the U.S.A., the building is an attractive space through which you can learn more about the characters of the ancient Ramayana story, enacted throughout the island of Java - a very important cultural tradition here.Unrelated,...More  ","tripadvisor_monas_234":"Many things to see but currently they are renovating the place, things are messy.","tripadvisor_monas_235":"The puppet museum to be honest just got my deepest attention to its collection of hundreds of puppets coming from the various region in Indonesia. Along with the different style of how the puppets were made, we can surely go into details on the puppets' clothing, that automatically lead us to guess from which area they came from.The museum,...More  ","tripadvisor_monas_236":"This is a nice little museum in an interesting part of town. You can learn a lot about wayangs but it would be best to go when there is a wayang show (you can check but usually it's on a Sunday).","tripadvisor_monas_237":"One of the reasons I made a visit to Indonesia was to see the cute and creative wayang puppetsSeeing those housed here in this Museum impressed me about the art of the puppets and the performance in itselfIt has a great collection of masks, the wayang kulit puppets, wooden wayang puppets and even gamelan instrumentsMy father and...More  ","tripadvisor_monas_238":"This museum has undergone major refurbishment in 2010 and definitely has pleasant new looks. I visited there recently and here's my observation for the refurbished museum:Good points:1. Signage and Entrance fee information is displayed clearly on the front door. Receptionist is ready to welcome you (not in the hospitable way, but more like government staff attitude - cold...More  ","tripadvisor_monas_239":"In a relatively rundown (and historic) part of town, this hidden gem is not to be missed. There are free performances on Sunday afternoons. I was approached by a \"guide\" whose family is well-known for their generation-long tradition of creating and performing Wayang puppets. He gave a great impromptu tour of the museum, but at the end, he expected me...More  "}