{"tripadvisor_monas_0":"Accompanied my nephew on their holiday. Quite interesting, and easy to access. The \"show\" was quite okay, overall for children amusement enough to entertain them.","tripadvisor_monas_1":"am with my friends visit that place .it nice to see but foreigner problem is that place people not know english well, if want ask something they dont know anything","tripadvisor_monas_2":"Accompanied my nephew on their holiday. Quite interesting, and easy to access. The \"show\" was quite okay, overall for children amusement enough to entertain them.","tripadvisor_monas_3":"Went there years ago, then I visited here again last month with my daughter. She looovvveeedddd everything there. And I was also enjoyed their walking tunnel a lot. Since it was the most attractive view for me, I bumped into the tunnel twice :)They have several aquariums in the area, and two of the best are those that made...More  ","tripadvisor_monas_4":"It is one of the place to visit in a rather big Ancol Beach Area with lot of attractions.It is a small place with loads of fish. I thought it would be a bit bigger but it just have few fish tanks although very good. There are a variety of fish in different fish pools and a sea tunnel...More  ","tripadvisor_monas_5":"Very enjoyable and certainly value for money. The tanks were very clean, lots of helpful staff and very informative. Sharks, jellyfish, seahorses and a good area where you can touch the fish and turtles. Slightly cheaper weekdays as opposed to weekends, highly recommend.","tripadvisor_monas_6":"Very good it has play area for kids .. a lot of kinds of fish children from 4 to 15 will enjoy it. Alot also you can touch some fish by your hands like little sharks","tripadvisor_monas_7":"Sea World is getting a bit old but still worth the visit for the kids preferably during week days as week ends is too crowded and you would not be able to enjoy the aquariums. Sharks, turtles, grouper, dugong, arapaima, under water tunnel ...","tripadvisor_monas_8":"Certainly a delightful place to bring the family for an outing and to get away from the afternoon heat of Jakarta city. This place will fascinate especially children; so make it a point to bring the kids for a day out to Sea World.","tripadvisor_monas_9":"We enjoyed our visit to Sea World. It is not a huge aquarium, but there are an interesting selection of marine animals. Whilst we were there there was some type of live show; this was very noisy, very crowded and in Indonesian (obviously) so we didn't pay it much attention, but it was cool to see divers in with the...More  ","tripadvisor_monas_10":"When i was child i often to be in sea world, and it feels so alrge, nowadays i visited there actually the place is not so large. But this place is good for kids & family. In 2014 untul mid 2015 the place is closed due to dispute of ownership & license. nowadays the place has been reopened.","tripadvisor_monas_11":"Took my son there and he was very excited to see all the marine biota there. I think that place need a little more maintenace, and in high season the place is too crowded so it's...read more ","tripadvisor_monas_12":"The whole family loved it!!!!We enjoyed every minute of it.Very good value for money!!!We have a 16 year old and a 7 year old and bob loved it.","tripadvisor_monas_13":"We stayed at the Mercure Resort for a week. This is a totally relaxing place to be. Take a ride in the cable car, go to seaworld, take a ride on the various thrillers, visit the aeroplane restaurant - yes a real Boeing 737 - or just walk around the resort. Very secure place with security guards and gated entry....More  ","tripadvisor_monas_14":"Took my son there and he was very excited to see all the marine biota there. I think that place need a little more maintenace, and in high season the place is too crowded so it's not very comfortable to bring babies.Overall it's a nice place to go with kids and great experience for them.","tripadvisor_monas_15":"We can see \"inner side\" of the sea. We can touch some animals. We can see how they were fed. Really educating visit for children","tripadvisor_monas_16":"Water clarity not so good compared with the first time they opened this aquarium.. Need more maintenance...The AC also not enough to cool down the room temperature..Animals collection seems no improvement since years ago...","tripadvisor_monas_17":"Modern destination for people who want a place provide massive sea aquarium and sea creatures, including rare ones. Placed in Ancol and can be easily reached.","tripadvisor_monas_18":"Expected more form the place but i did not find such a great amazing things.Its holiday place were we can spend happily with family.","tripadvisor_monas_19":"(+)well, not much to say, it's seaworld(-)is getting smaller due to the renovation? more of a 'building' than 'world'there were many people waiting in line for the ticket entrance and there were only 2 ticket booth opened and it was holiday seasonshould add more info about single ticket or bundling ticket at the beginning of...More  ","tripadvisor_monas_20":"This is the best and could be the only one aquarium conservation in Indonesia. Good for our ocean knowledge especially for kids. They will have fun learning in here. Not so expensive but have to pay Ancol pass fee also.","tripadvisor_monas_21":"Absolutely entertaining place to be. Huge and a lots of things to enjoy. Fun games, aquarium, pet shows are quite amusing.","tripadvisor_monas_22":"Sea World Ancol is a nice place to take your small kids. Our kids had a lot of fun watching different kinds of fish, eels and sharks swimming around. The place is not very big...read more ","tripadvisor_monas_23":"If it's not the holidays or the weekend I can recommend sea world very well set out orderly which is unusual for attractions in Jakarta.With kids a great place to visit I would come back again","tripadvisor_monas_24":"Sea World Ancol is a nice place to take your small kids. Our kids had a lot of fun watching different kinds of fish, eels and sharks swimming around. The place is not very big, which is perfect for our kids, as they did not have to walk very far. They also offer opportunities for visitors to touch rays, sharks...More  ","tripadvisor_monas_25":"This is a fun little place to visit. It won't take you long to get through it, but it is definitely worth it. The animal exhibits are all very well done. It is one of only 5 places in the world to have a Dugong that in its self is reason enough to go. You can buy a combo ticket...More  ","tripadvisor_monas_26":"Like Sea World in another country, they have many collection of marine biota. Tips : came early they open coz this place always full even weekend. At our last trip this place need renovations immediately.","tripadvisor_monas_27":"Most of the fishes and animals are living in the Indonesian waters. A few are from other places like the Amazone River. The aquaria are well kept and interesting, even for people who does not understand the Indonesian language. There is also a big aquarium with a tunnel of 80m long were you can see the many fishes and sea...More  ","tripadvisor_monas_28":"We have been here now three times, our children now 7 and 9 years old. It is a small area but the attractions are really good quality. Especially the dolphin show. We strongly recommend swimming with the dolphins. Arrange directly on arrival or a day in advance.","tripadvisor_monas_29":"Sea World is my favorite place in Ancol after Dufan. I always get excited with anything ocean-related. I always remember fondly my childhood memories of Sea World and once in a while I like to relive them as an adult. I love the dim lighting and the mysterious ambience. I admit that I don't read enough of the abundant scientific...More  ","tripadvisor_monas_30":"This is my first time for my son to get here, and he is so excited. My son is 2 yrs old. He can see many kinds of fish in here, not only fish there are alligator, turtles, and many more. There are two kind of view in here, that you can touch and not.","tripadvisor_monas_31":"Note that Sea World is NOT closed! A lovely attraction in Jakarta. Great that you can handle the starfish and pat the turtles. The tunnel is fantastic - great to see the sea creatures close up within the tunnel. Highly recommend this great attraction.","tripadvisor_monas_32":"Indonesia as an archipelago country which consist with more sea than island, should be have more variety of fish than any other place...But in this place, you can only see an ordinary fish!!Nothing special... Expensive ticket!!!","tripadvisor_monas_33":"Sea World Jakarta needs an upgrade. Definitely a good place to go if you missed it when you were a kid.","tripadvisor_monas_34":"Sea World Jakarta needs an upgrade. Definitely a good place to go if you missed it when you were a kid.","tripadvisor_monas_35":"Maybe because Im just going back from the equivalent \"sea world\" from Singapore, this Sea World become less attractive, too small-too few species area for 80.000+20.000 IDR money value. But i do understand, local govt has did their best, so I am appreciated their effort","tripadvisor_monas_36":"The Phone Booth Idea and Fishes Inside Car idea Is goodhere sharing the pics of my visitCheers To Peace !","tripadvisor_monas_37":"this place is basically same as other aquarium places. The price is not too expensive and the aquarium is good.This is a side visit if you happen to go to Dunia Fantasi. You will spend at least 2-3 hours here.","tripadvisor_monas_38":"This aquarium is highly recommended. You can come across diverse spices from tiny river fishes to giant sharks. Certainly, you will get astonished by walking through corridors.","tripadvisor_monas_39":"A nice place to let the children enjoy the natural sea life.Small not to big. Well suited for a visit with small children.","tripadvisor_monas_40":"unfortunately, we went there on the wrong time... too crowded and several of the aquarium are foggy, blur, you name it... but overall, the experience is worth it.... we got to see and learn some unique creatures/animals...","tripadvisor_monas_41":"My boyfriend and I went here in the beginning of October. A lot of police was standing in front of the entrance telling us that Sea World was closed. When we asked why they told us: 'Renovation'. Which seems weird, because Sea World does not mention this at all. It might be a problem with the government in our opinion...","tripadvisor_monas_42":"This place seems smaller than i thought. My little family enjoying this place very much. My 2 years old son so happy, touching fish, turtle, starfish. But for me, this place unattractive and need some improvement","tripadvisor_monas_43":"I went to this place with my family, because my kids are loved to see animals inckuding fish and their friends. So, I took them here when I've got holiday. First of all I want to say about its location. This place, Sea world, located in North-Jakarta, inside Taman Impian Jaya Ancol. There are so many attractions here in Ancol....More  ","tripadvisor_monas_44":"This is an exciting activity for the whole family, but I was there during the Eid Mubarak holidays and it was so crowded. The aquarium is not that big but provides enough...read more ","tripadvisor_monas_45":"This is an exciting activity for the whole family, but I was there during the Eid Mubarak holidays and it was so crowded. The aquarium is not that big but provides enough entertainment and gives you a good idea of the sealife around Indonesia.","tripadvisor_monas_46":"In Jakarta, the \"normal\" activities during weekend is going to the mall.A non-mall place like Sea World is not easy too find.Last month, me and my family went to Sea World.We used promotional coupons from an online shop, so we are directed to the customer service to check the validity of the coupon before we could enter...More  ","tripadvisor_monas_47":"We were in Jakarta this month and went to sea world , not really much to see here , wouldn't go again , kids didn't mind it but we had only been in there 10 minutes and had seen it all , luckily it was not to expensive to get in was only 100,000 each . Just not what we...More  ","tripadvisor_monas_48":"There are not a lot of good fun and interesting places to take children in Jakarta. So this is a good one for people who have kids.The entrance fee is expensive by local standards, but not to bad if compared to developed-country equivalent. Some big fish to look at, don't expect too much though.","tripadvisor_monas_49":"Good place to educate children. I went there with my wife and baby. My baby was very interested in a various species of fish inside a big aquarium, especially shark. We could know the type and the name of fish. The place was quite dark, maybe need to add some lighting at some place.","tripadvisor_monas_50":"Good place to show and experience the under water world view. Many show case with touch and feel experiences.Weekends and holidays many-many-many peoples like to coming...","tripadvisor_monas_51":"Going here with my 22 months old son to give him experience about sea life, the ticket for me is a bit overprice, but the collection pretty nice. There's new collection Hammerhead Shark there, you should try to see.","tripadvisor_monas_52":"located at Ancol beach, one of many attractions.Took wifes family and all kids enjoyed visit.many things to seea good walk through and great pictures.","tripadvisor_monas_53":"I attended here based on there advertised display of Hammerhead Sharks. I was disappointed to find that all of these sharks were juveniles and none were any bigger than maybe 600mm in length.The display of sea creature was not representative of what was advertised with many creatures not on display. To my horror they had touch tanks for sharks,...More  ","tripadvisor_monas_54":"This was our third visit.And this time we gave ourselves time to see all the feeding occasions.Kids will love it.The newly introduced Hammer head sharks are awesome and so are the massive dugongs.It is very crowded on weekends and you need to be very alert to keep track of your kids.Touch pool is quite safe....More  ","tripadvisor_monas_55":"This place has different things to do. Take the aquarium of Sea World. Quite impressive actually. Touch real fish. Walk under the mantas. Good fun for children.There is also a...read more ","tripadvisor_monas_56":"This place has different things to do. Take the aquarium of Sea World. Quite impressive actually. Touch real fish. Walk under the mantas. Good fun for children.There is also a swimming pool and art craft village nearby.You'll need a car (taxi) to get there.Reduction for the \"eldery\", which in Indonesia starts at 55...","tripadvisor_monas_57":"We didn't really have high expectations but what we found was even worse. Being a week day it wasn't very busy at all. We paid for the Dolphin show which was scheduled for 4.15 but we left at 5pm after waiting in an empty arena. As we walked out we saw the dolphin enclosure and was horrified, it was about...More  ","tripadvisor_monas_58":"Although the place is not as big as I imagined, it was all right. I went on a Sunday and the crowd was a bit too much for comfort and going through the short tunnel in a jam packed condition make it a bit disappointing as we would not have the opportunity to really enjoy the sights inside the aquarium....More  ","tripadvisor_monas_59":"Nice place to learn and interact with sea creature.Located at North Jakarta. During high season, it will be jammed and crowded with visitors.Have 3 nice restaurants just in case your family feel the hunger… :-)Just avoid the high season, go early and enjoy it...","tripadvisor_monas_60":"Sea world is not at big as i thought it was. They had a short length tunnel, and i thought that everything was too packed together in one floor. They try to make it look big, but really, it's just not.The price was not as much as they stated on their website. Instead of Rp.60.000 for weekdays, i paid...More  ","tripadvisor_monas_61":"Came here on normal days, i believe saturday and sunday will be packed with people. kids definitely love it, you can touch and hold the star fish, u see shark, stingray and any other fish so close. and they are huge.... not a small one.overall the place is well maintain, hope they can keep it up and make it...More  ","tripadvisor_monas_62":"If you only want to come here this exhibit is indoor. Air con, well kept and clean, there will be some areas covered by travelator. On each aquarium there will be reference and remark on each species. Its very educating and entertaining.They also have small pond inhibit by sea cucumber/teripang and star fish. The guide there will let you...More  ","tripadvisor_monas_63":"There is some good displays and it is cheap to enter. Not as good as ocean park Hong Kong but only $7 to get in. Worth a visit. The sharks were closed but everything else was open.","tripadvisor_monas_64":"This is my third visit of the Sea World in Ancol, There are still so many fish to see and glare in those amazing aquariums. There are some new thing inside the sea world, like the \"Shark Quarium\" and some fish that i have never seen in my life.But one thing makes me sad, when i realized that my...More  ","tripadvisor_monas_65":"Real piranhas. I could see many many types of fish. From shark, catfish, octopus and... Piranhsa. Yay.It was a really good destination. Very well maintained and clean.Air conditioned and do not smell.Quite small but it's still ok at all.I was a lovely place to visit.","tripadvisor_monas_66":"I've been dissapointed greatly by Manila sea world, but this place must be something, there are quiet varieties of species (some shark and piranhas there!) in there and the place...read more ","tripadvisor_monas_67":"I've been dissapointed greatly by Manila sea world, but this place must be something, there are quiet varieties of species (some shark and piranhas there!) in there and the place is well-maintained! The aquarium tank showcase is very good and took a little while to actually finished it,","tripadvisor_monas_68":"The aquarium is small, but a good family destination and a good way to kill an hour and a half. There are sea turtles, rays and small sharks that you can touch. There are otters that are fun to watch and a viewing tunnel. It's worth checking out if you like aquariums and it was cheap. I actually wrote a...More  ","tripadvisor_monas_69":"Not the best Aquarium I have been too could have a better variety of marine life, but Ancol is a lovely place and a great way to spend a day.","tripadvisor_monas_70":"Kids will enjoy this aquarium. Turtle feeding at 1030 is fun. Air conditioned and quite clean, good range of fish etc, staff friendly","tripadvisor_monas_71":"Good place to saw what happened in underwater but its too small place, you just take a view minute to around the place","tripadvisor_monas_72":"I recommend my fellow to come & visit Sea world. They present U variety of sea life, from the fish till sea horse.Nice to visit this spot. Enjoyable with friends or families","tripadvisor_monas_73":"We can see shark , catfish , octopus , arapaima , and piranha . The place is nice but need expansion due to many many visitor .","tripadvisor_monas_74":"When we visited this place we expect to see a big spacious marine life, yet,we find it quite small and kinda crammed since so many people also visiting this place, it was quite dark, but somehow interesting, it do have many collection of fish and sea creatures (love the otter)After 30 minutes or so, we are so done with...More  ","tripadvisor_monas_75":"$6 entrance, shows almost nothing inside, unless you also thought you would see the giant sea crab with 3 meter reach, we saw an equivalent crab but its reach was closer to 50cm! miniature giant crab, or just normal crab? jury still undecided","tripadvisor_monas_76":"This place is not really big.i think i just need 30minutes to see around.Nothing special.If u go with kids u may come to visit","tripadvisor_monas_77":"An amazing collection of marine life - fresh water and sea water in a clean environment. The place is sizeable although not massive with a seating area in couple of sections to...read more ","tripadvisor_monas_78":"An amazing collection of marine life - fresh water and sea water in a clean environment. The place is sizeable although not massive with a seating area in couple of sections to watch marine life. It has amazing turtles and you can even touch turtles in the shallow pool. Just at the exit are restaurants, important for most visitors here...More  ","tripadvisor_monas_79":"i came to seaworld Jakarta with bunch of a pre-schooler.I notice that this place already have some improvement since i came to this place last time maybe about 5 years ago.but there's not much change, and i see that the aquarium become smaller than last time.sea world should be the largest aquarium in the country but how...More  ","tripadvisor_monas_80":"there are a lot of fish from all over the world and some baby of fish, with the nice place surrounding by fun attraction, sometimes you can try as a diver and feeding the fish but u hv to book before...items of fish I think better than Singapore and Melbourne..they provide restaurant and souvenir shop too, to enjoy there need...More  ","tripadvisor_monas_81":"i would say this place is a very well-maintained and showed great varieties of species, really enjoyed the underwater aquarium... compared to the one that i had visited in KL, this place is quiet huge..","tripadvisor_monas_82":"+ Not too very far from the city centre+ The place is not too fancy but just nice for family trip+ Many kind of sea animals with clear explanation of each animals+ Nice experience walking on the horizontal travellator under the gigantic aquarium+ On some animals booth, you can touch and feel them; starfishes and turtles...More  ","tripadvisor_monas_83":"A delight to visit the Seaworld with children and even otherwise.Well laid out and maintained with young well dressed and courteous staff, the aquarium is a child's paradise with the ' Touch Pools' being the entree to their wonder world","tripadvisor_monas_84":"been here on several occasioni think they need to come up with something newi dive in their aquarium twice and it was a wonderful experienclplan to comeback one day for my third","tripadvisor_monas_85":"I went to visit sea world with my friend in Jakarta. It was quite big and size is out of my expectation. Entrance fees are quite costly. We see many sea creatures in there, generally is a good place if you intend to bring your kids there.","tripadvisor_monas_86":"i think if in 1990 era it's excellent, but if compare Siam Ocean World Bangkok now, this need major renovation to make same level.No sign make visitor get loss in Ancol. If you satisfied with local-rural people visitor it enough, but for international tourist i think its too old.","tripadvisor_monas_87":"When I went there, there were 8 sharks (White tip, Grey reef adn black tip), swimming around in the tank. It was good, okay if you want to see them closer. However, the tank was too small for 8 sharks swimming around.","tripadvisor_monas_88":"Great for families with kids. The walk through in the aquarium is very enjoyable. The place is well kept too.","tripadvisor_monas_89":"Great for families with kids. The walk through in the aquarium is very enjoyable. The place is well kept too.","tripadvisor_monas_90":"Sharks and dolphins are meant to be in the sea, freely, especially dolphins, they're not meant to play tricks for people's entertainment and not meant to be kept in a tiny pool (comparing to their habitat, of course) with hundreds of people making noise, they rely on their sonar, for God's sake!","tripadvisor_monas_91":"If you want to find a break from mall to mall visit in Jakarta, Sea World is one of the places to go. Especially during 17 August, the Independence Day in Sea World was memorable, I was sitting in front of the shark aquarium with my good friend, these sharks are the non harmful type and the size was not...More  ","tripadvisor_monas_92":"when \"don't know where to go\" is flying in my mind. I went here with my boyfriend do some experience with baby shark. i really want to swim in this big aquarium someday, but my bf don't let me to do this. ah :s","tripadvisor_monas_93":"We can see a lot of under water creatures here. But the place quickly bored you. All the foods and drinks sold here are quite expensive. So you better bring you own beverage especially if you bring your kids.","tripadvisor_monas_94":"This place is a nice to visit place in Ancol. There are so many colorful fishes to observe & increase your knowledge on sea creatures. They are big, small & different sizes but it is worth seeing. There is a moving horizontal elevators where you can observe big sting ray, shark & other fishes under a aquarium. Also you can...More  ","tripadvisor_monas_95":"Although the attraction centre looks small but it is impressive at the main entrance. For those tourists who are the first timer to watch interesting collections of fish and sea creatures, it is worth to tour the Sea World, and closer look at the sea creatures.My wife and I went there on Monday, and so it was easy and...More  ","tripadvisor_monas_96":"Shark vessel was a different experience with a human being inside, Jelly fishes were awsome and new experience.","tripadvisor_monas_97":"i really love the collection of fish there. but its too bad the size of seaworld in jakarta is a bit small. but still its a good place to visit.","tripadvisor_monas_98":"Large displays with a lot variety of species. It's really great to go round and watch interesting sea creatures, fun, and a lot of education. Great for family with young kids. The Sea World is too crowded on weekend, but still fun all the same. Room displays are dim, so watch your kids closely as they may got lost easily....More  ","tripadvisor_monas_99":"Great place to hang up with your family. This place its great, with a lots of fish there. The location is inside of Ancol dreamland. Unfortunately, its a bit small if you compare...read more ","tripadvisor_monas_100":"one line you love this place when you got inside. dolphin, scuba diving, more than 100 types of fishes too see.","tripadvisor_monas_101":"Great place to hang up with your family. This place its great, with a lots of fish there. The location is inside of Ancol dreamland. Unfortunately, its a bit small if you compare to others sea world in other countries. But still its a great place to go.","tripadvisor_monas_102":"Usually go there to go diving inside the aquarium. Pay a small fee, include tanks and a guide. Looking out from inside the aquarium, there are always too many people. Variety of fish that we can swim with is good, in other tanks they also have good collections. The museum is a bit 'sad', and the food court area is...More  ","tripadvisor_monas_103":"As one of the largest maritime country,visit here is a must.Especially for young guys,it give you a lot of new perspective about the oceans and marine life surround us.This place truly worth a lot of educational factor.Come here to see endangered species like sharks,dugong and many more..","tripadvisor_monas_104":"Price not that steep. Sharks, piranhas, otters, tigerfish, japanese crab, walk-through aquaria. Touch pools for sting rays, turtles, baby sharks. Alligator-headed turtles and some specimens of yesteryears sea creatures in the learning section. Good experience for my family.","tripadvisor_monas_105":"Its good for the kids, we could touch the baby sharks on the big pond, some sting ray. They fed the manta ray and the fishes and you can watch. Its not bad to try.","tripadvisor_monas_106":"when you dont have much time to dive somewhere else, and your diving gear dusty or you just want to experiment with low light underwater photography. This place worth to go. its cheap and kids loved to see diver. Keep waving to the visitors.... here, you are the star.","tripadvisor_monas_107":"My daughter dive with the fish while I am waiting and looking the surrounding. It will be better if this place can be tidy up and have a constant monitoring of the cleanliness. Fish need to be fed and take care, too. My daughter and her friends was so surprised to know that most of the shark didn't have any...More  ","tripadvisor_monas_108":"Should you want to introduce the sea life to your family, this place is recommended. With touch pool, giant aquarium, and a lot offish, you n family could realize the amazing of sea and its life.","tripadvisor_monas_109":"For Jakarta, having a Sea World is a nice plus. But we were not overly impressed with the offerings in sea life, or the potential this location has to become a major attraction for both locals and foreigners. Much of that has to do with the Ancol area and the lack of modernized facilities and other activities. But at some...More  ","tripadvisor_monas_110":"Don't go there during school holidays if you don't like tons of kids running around you:p ..but it's always nice experience to go there with your family to see different fishes...read more ","tripadvisor_monas_111":"Don't go there during school holidays if you don't like tons of kids running around you:p ..but it's always nice experience to go there with your family to see different fishes & see the \"awe\" from the kids faces:)Quite expensive price.","tripadvisor_monas_112":"It's only 1 in Jakarta. If you are into fish, you should come to this place.If you are not a fan of fish (just want to eat fish) then visit Muara Angke.","tripadvisor_monas_113":"Seaworld was not found on the map at the entrance of the ancol dreamland and we had a hard time finding it on foot.I have visited several aquarium in the region, including KL's and Singapore's. In comparison, there was a poor variety of marine lives in the Sea World. The entrance price of 80k rp is certainly not justified.","tripadvisor_monas_114":"I enjoy the fish feeding time in the afternoon. The walking mill helps me to get the middle part of the site. And the most amazing thing is that I get to see a lot of sea fish from the archipelago.","tripadvisor_monas_115":"This was my second time visiting Seaworld Jakarta. The first time was almost 10 years ago. The quality of the place was reducing a lot. Sea World was not as interesting as before. The public toilet was in poor condition, not representative as a tourist attraction. If you had tight schedule in Jakarta, you may not regret if you skip...More  ","tripadvisor_monas_116":"It was Sunday and the line up was huge but we managed to get up there. It could use biger elevator. Because of tne view it is worth a visit.","tripadvisor_monas_117":"I have saw much more exotic and better fish in my local garden center. The location is wonderful, the only part of Jakarta we were prepared to visit.","tripadvisor_monas_118":"You will find all kind of fish from the small one up to the big one. How someone give the fiding food for the shark. Evertything is like in the real sea word. Everything is balance, hope like the real life in the sea word.","tripadvisor_monas_119":"it's a great place to learn about zoology. large of diversity in this marine world makes me enthusiast. I will be there again with whole of family.","tripadvisor_monas_120":"Great idea to go with kids, you can't compare with other places around the world like in Singapore or any where else. But if you live in Jakarta it's a good option than your regular mall. I recommend going there early in the morning and better on weekdays, the place is not too crowded, if you have to go on...More  ","tripadvisor_monas_121":"Well, as our family love the sea and its fabulous creatures, Sea World is a good alternative where we don't have to snorkel or dive to enjoy the beauty of underwater...read more ","tripadvisor_monas_122":"Well, as our family love the sea and its fabulous creatures, Sea World is a good alternative where we don't have to snorkel or dive to enjoy the beauty of underwater world...Relatively cheap, compared to other attractions in the same area, SW provides good venue for family get-together time...With Rp 60.000,- (USD 7) during weekdays and Rp 70.000,-...More  ","tripadvisor_monas_123":"I visited Seaworld in Ancol Jakarta.60'000 entrance in a weekday and 70'000 on a weekend day.15 aquarium with dugong, ray, sharks, moray eels, nice 80m tunnel under the main aquarium, and feeding time every 30' in different aquariums. possibility to dive in the main aquarium.nice for kids and adults who want to see the amazing underwater of...More  ","tripadvisor_monas_124":"A good attraction for children, and that's about it. It's an average 'aquarium', they don't have that many collection of sea creatures. It's really worth the price though.","tripadvisor_monas_125":"it's good for a half day excursions, do not plan to sped the a whole here. Better also plan to see other parts of Ancol. Do not forget to see the shows though","tripadvisor_monas_126":"good place for kids' education about marine life, my almost 2 year old baby can stop saying \"fish...fish..\" a fun place, with good price, especially with \"hiCard\" holder (the hypermart card), believe me!","tripadvisor_monas_127":"I bring my daughter there and she is really happy to see lots of fish from lots of place, spend time with my family here is worth it ( go more early when holiday, cause will be crowded everywhere.","tripadvisor_monas_128":"I recommended this place if you come along with your kids, here you can show to your kids about sea life and walk to the aquarium tunnel.","tripadvisor_monas_129":"This is the bigest aquarium in South East Asia. We like the 'tunnel of the underwater sea'. A good experience for children and ex children to enjoy being among underwater creatures.","tripadvisor_monas_130":"Sea world was a decent attraction in the Ancol district of the city. It had a good range of sealife but nothing spectacular, especially considering that Indonesia is surrounded by several seas and oceans. They had a good rock pool where kids enjoyed a more hands on experience with the wildlife and a walkthrough aquarium but if you plan to...More  ","tripadvisor_monas_131":"Shared our visit with a heap of school children who had lots of fun running around in the dark and chasing each other down the moving aquarium tunnel/walkway. Cheaper that the Melbourne aquarium, however a bit run down.","tripadvisor_monas_132":"I came there because I had a 50% discount coupon for this exhibition. Good variety of fish and other sea creatures, but the air con was hot and it wasn't worth the ticket price we...read more ","tripadvisor_monas_133":"I came there because I had a 50% discount coupon for this exhibition. Good variety of fish and other sea creatures, but the air con was hot and it wasn't worth the ticket price we paid especially without discount.","tripadvisor_monas_134":"Not a very big place, but the charges are reasonable. The fishes types are quite a variety, with a few touch pool where you can touch the sea creatures like turtle, stingray and blue shark. Interesting experience. There is also a large tank which they claim to be the largest in South East asia, and we are moving in a...More  ","tripadvisor_monas_135":"The sea world at Ancol is very good with a lots of varieties of dofferent types od fishes on display. It also had a moving tunnel where the fishes were moving in the enclosed spaces overhead.","tripadvisor_monas_136":"a lot of fish and variety....I go when my school has a studytour to there....amazing how to watch the lives underwater and see the miracle of creatures of God. Its such a big places, I wanna go there again someday.But the ticket is so pricey nowadays....","tripadvisor_monas_137":"Been here for my kids' education of sea creatures. The place is so hot and dark. the water in the aquarium looks dirty.But my main concern of this place, regardless the condition of the aquarium and habitats, the place is so hot and the air flow in the area is not healthy. Such a distraction towards the whole experience....More  ","tripadvisor_monas_138":"I love the collection, the area is kept very well, helpful staff and clear signs. Must see and spend at least half day watching fishes in all sizes.","tripadvisor_monas_139":"At first it was an exciting thought to go to Seaworld..even better that when we got there, there was no queue (thanks to Ramadhan). So, all along it was okay and predictable, as in, it has similarity (of attractions) that most seaworld in the world have, the collections, touch the animals, feeding show and even the giant aquarium tunnel.But...More  ","tripadvisor_monas_140":"May not be as large as the Sydney Aquarium or Singapore's, but indonesia is blessed with such biodiversity. Watch the feeding time and enjoy the fish perform naturally.","tripadvisor_monas_141":"Had a good time at Sea World, we were there at feeding time.","tripadvisor_monas_142":"I brought my primary 2 school children (around 17 of them) with their parents to enjoy a field trip to Sea World. They were amazed by the many different water creatures especially the sharks that swam with the trainer. Great show for kids indeed.It's pretty small in size. You can finish the 'tour' within 2 hours. End the tour...More  ","tripadvisor_monas_143":"This is for sure another options for family weekend trip. Good place for maritime education and it is price wort it.","tripadvisor_monas_144":"This is a really worthwhile place to go.. it's well-maintained, you really get to learn a lot about marine life and you can even get to feed the amazon fish, hold the puffer fish and watch the guide feed the hungry piranhas!","tripadvisor_monas_145":"This is for sure another options for family weekend trip. Good place for maritime education and it is price wort it.","tripadvisor_monas_146":"Seaworld has a higher price to get in but it's worth the price as they seem to have a clean and good educational area for all to use. Go there to watch the shark feeding or walk through the viewing tunnel you can't enter with food or water but that's to stop people from putting these in the tanks. You...More  ","tripadvisor_monas_147":"The SeaWoorld on Indonesia is a fun program for the kids, but it is just an aquarium.Is a much simpler than SeaWorld on the US, even though it is nice to spend half of day there with the family.You can go there on the Saturday morning and get out during lunch time and have lunch in the same...More  ","tripadvisor_monas_148":"Got a taxi here - with a meter - however - could not get a metered taxi back to the hotel - had to bargain for the fare.don't forget a camera - as I did","tripadvisor_monas_149":"i found nothing special in sea world ancol...not worth the money...","tripadvisor_monas_150":"as the my title \"sea world\", i love it there where the place I can see something under water while i'm on the land without having my body wet by sea water and make myself amazed with the beauty of sea without making me paranoid. LOL! it was fun there with friends or family, just to enjoy sea world :))","tripadvisor_monas_151":"when u loved funny animal not bad..watching their so lovely..but the dolphin so sad they just swim on the small pool..","tripadvisor_monas_152":"its very dark, so not easy to make a picture through the glass ;-)","tripadvisor_monas_153":"The Area not to bigvery convenience if you go there as a groupLimited snack bar","tripadvisor_monas_154":"Good variety of fish,corals and ecosystem looks researched,touching pool looks nice,otherwhise the music they play while in the entrance is annoying and ruin some of the...read more ","tripadvisor_monas_155":"Good variety of fish,corals and ecosystem looks researched,touching pool looks nice,otherwhise the music they play while in the entrance is annoying and ruin some of the mood,don't miss if you're in jakarta","tripadvisor_monas_156":"This place contains some creatures from the sea, mostly fish. But you only see those in such display places and not more. Somehow, I feel Sea word needs something new that will attract more people. I have spent approximately 30 min. wandered the whole by pay IDR 75.000 for me it's too expensive. One good point, it is a good...More  ","tripadvisor_monas_157":"it's the biggest venue of aquarium in Asia. they have bunch lots of sea creatures, sharks, dolphins, scorpion fish, lion fish, seals, napoleon fish, clown fish, morray eel and lots of more..thank god it was air conditioned.. cause it's warm outside","tripadvisor_monas_158":"I have visited this place so many times. The place is not so big, you will only need 1 hour to visit the whole place. It is well maintained and the fishes look quite healthy. The main attraction is the main aquarium and the feeding time, where divers will feed the animals by hand - including the sharks in the...More  ","tripadvisor_monas_159":"I was expecting something pretty big and incredible the first time I visited Sea World in Jakarta, and I was disappointed. Everything is inside, and there are relatively few exhibits overall. However, considering that Indonesia is generally considered a third-world country, it does have some aspects that are good. There is a walk-though aquarium where you can see large manta...More  ","tripadvisor_monas_160":"- The knowledge on various aspects of sealife- Walking under the tunnel like walking on the sea","tripadvisor_monas_161":"Nice place especially for kids. But don't come on school holiday, very crowded.","tripadvisor_monas_162":"The place is quite expensive but worth to go, they are on of the place that kept the rare Dugong, Some aquatic shows are frequently shown in the tank.","tripadvisor_monas_163":"Kids love this place and very educational too! Can make it a bit more bright but maybe the dull lighting has to do with the marine life, not too sure!","tripadvisor_monas_164":"The Seaworld not to big, but entertaining enough.We can see various sea fish and other creatures. The place is quite dark and food stall choices is bad.","tripadvisor_monas_165":"Lot's to see, worth a two hour visit. Loved going through the conveyor belt and seeing the fish swimming over you, and feeling the rays!!!","tripadvisor_monas_166":"Lot's to see, worth a two hour visit. Loved going through the conveyor belt and seeing the fish swimming over you, and feeling the rays!!!","tripadvisor_monas_167":"nice places for kids to educated them. attraction walrus, dolphin are daily present. it's inside ANCOL, for people age over 60 it's free entry, bu do not know for foreign.","tripadvisor_monas_168":"have you ever seen that dolphins can counting ?see them counting here ! 1,2, 3, ....","tripadvisor_monas_169":"The best marine shows and indoor aquarium in Indonesia. Maybe because it is well taken care of. The entrance fee is a little bit expensive but worth trying.","tripadvisor_monas_170":"It's ok.. but not yet amazing... i like the huge aquarium... but not many kind of fish i can found.","tripadvisor_monas_171":"the water is not clear (dugong), some place are dirty, but quite a nice experience","tripadvisor_monas_172":"This is NOT related in any way to the Sea World found in Orlando and some other places .... this one has an interesting shark tank, and we loved the petting area (baby sharks and rays), but overall was a little dark and run down. Not good food choices. Not a must-see, in my opinion.","tripadvisor_monas_173":"this is the biggest aquarium in jakarta. They have plenty collections of sea animal and creature, very diverse species in it. Is very suitable for families and parents who want to educate their children. I recommend visiting this recreational site.","tripadvisor_monas_174":"Next place to visit inside Taman Impian Jaya Ancol is Sea World. My daughter enjoy the sea creatures and still have fun, not boring at all. Cheap entrance fee. Much bigger than Kelly Tarlton in Auckland.","tripadvisor_monas_175":"this place is a very good place to see animal show and the only one in Jakarta...","tripadvisor_monas_176":"This is a salt water aquarium in ancol, jakarta utara, 'coz there's a freshwater aquarium in taman mini indonesia indah (TMII), jakarta timur. This is my first trip to sea world...read more ","tripadvisor_monas_177":"This is a salt water aquarium in ancol, jakarta utara, 'coz there's a freshwater aquarium in taman mini indonesia indah (TMII), jakarta timur. This is my first trip to sea world, i've been to fresh water aquarium in taman mini (TMII), compare to fresh water aquarium,sea world is a lot better aquarium. with many kind of sea fish, well actually...More  ","tripadvisor_monas_178":"Love the display, the giant aquariums, the animal shows and even the feeding corner. One thing is to keep overenthusiastic children away from sensitive animals. It's cruel if you can have fun there while the animals are stressed out.","tripadvisor_monas_179":"Went here with my 2 kids (3 and 5). Both enjoyed it very much, especially the touch sea turtle tank. I love that they improved the aquariums over the year. We also tried the fish massage. It was quite an experience. Will definitely come back again!","tripadvisor_monas_180":"We didn't know you can go for diving there. But it wasn't a problem. Great what you can find in the tank..... Guitar rays, big turtles and when they have feeding time you feel like in a \"bouillabaisse\". For info: during Ramadan its not allowed for divers!","tripadvisor_monas_181":"Really enjoyed to see different verities of Fish and I would like to visit this place once again.","tripadvisor_monas_182":"it has alot of salt water species in it (i guess not only salt water) and my son love it, please pick your time to visit, because if you visit at the right time, you'll see the feeding attraction, it's quite entertaining.","tripadvisor_monas_183":"bring your entire family here because this has an entertainment for all ages. starting the tour by watching all the sea creatures swmming in a tank full of sea water and ended up watching sealions attraction. that would make your day, I guarantee. possibility of coming back : 93% (based on me)","tripadvisor_monas_184":"What I love about this place is they try to improve the service from time to time. The collection of the fish and others are also improve. I think the only thing that you might consider is the 'pricey' entry ticket :)","tripadvisor_monas_185":"Kids who've never gone to a Sea World will love it, but the place could do with more attractions...","tripadvisor_monas_186":"Located in North Jakarta, this isn't the easiest attraction in the city to reach. But it is worth if if you have a curious young person and a couple of hours to spare. The types of marine life on display here are varied and interesting. The best part is the moving-walkway, glass-enclosed tunnel from which you can see large fish...More  ","tripadvisor_monas_187":"The only and the biggest giant aquarium tank in Indonesia. Contains a lot of sea animal, and you also can pet the animal like turtle and small shark.","tripadvisor_monas_188":"i have visited sea world jakarta several times...it's nice for relax... and also very good for kids...","tripadvisor_monas_189":"The only and the biggest giant aquarium tank in Indonesia. Contains a lot of sea animal, and you also can pet the animal like turtle and small shark.","tripadvisor_monas_190":"The main aquarium is a really great aquarium! Excellent fishes display! Excellent for kids and adults!","tripadvisor_monas_191":"excellent location, very good food, number of rides, children's play area, excellent spa, huge parking space, sea-view restaurant, full day enjoyment & lot more..............................................","tripadvisor_monas_192":"It was very bad experience . It is not clean , no one speak English or Arabic. The show was very simple and the ticket we paid was 450000 Rp never deserve at all. The dolphins show was so crowded and hectic and no privileges to tourists . Hope to see good places in Jakarta that worth visit. Those who...More  ","tripadvisor_monas_193":"This Seaworld is nothing like what you find in the Western World, or even in richer countries in the region like in Bangkok. It is quite small, but features some nice animals (I particularly liked the dugong, quite rare to see). We went there during a holiday, so it is not really relaxing as the place gets packed and there's...More  ","tripadvisor_monas_194":"We must proud by this attraction cause it give a lot of information for education purpose especially for teen and kids who can see marine animal in the ocean","tripadvisor_monas_195":"first of all, don't compare this to Sea World in Australia or even USA because this one is definitely smaller in scale. yes, SW in Jakarta is head to head with Gelanggang samudra that has numerous shows of Bears, Sea Lion, Dolphins, etc. try purchase their special package, could save lots of money.back to SW, I have visited twice...More  ","tripadvisor_monas_196":"We spent about 1/2 a day at Sea World & found it very good value for money. It's not a huge, expensive place like the western Sea Worlds - it's a smaller, very inexpensive diversion for a few hours. The kids loved the piranhas - you get to see them devour their food, with a clock counting down how long...More  ","tripadvisor_monas_197":"It's just @ ancol, Cheap ticks, nice collection of marine animals,A relax trip with my gf to Seaworld at ancol. I was impressed by the shark's tank where they have several different kind of sharks to view. a piranas tank also!!!","tripadvisor_monas_198":"If you have visited any of the Sea World attractions in the US and are expecting this Sea World to be to the same standard then you are in for a bad suprise. I have been to the...read more ","tripadvisor_monas_199":"If you have visited any of the Sea World attractions in the US and are expecting this Sea World to be to the same standard then you are in for a bad suprise. I have been to the Sea World in Orlando so visited the Sea World Jakarata with high expectations and was disappointed.The indoor aquarium as you enter...More  ","tripadvisor_monas_200":"I went to SeaWorld Indonesia on several occasions in the past few years and see this place is getting better from time to time. New for 2008 is their new collections, the albino crocodile. In Indonesia, they call it 'Buaya Putih'. Besides, SeaWorld offers many other marine animals on display such as freshwater fish (e.g. the big arowana), deep sea...More  "}