{
  "tripadvisor_monas_0": "We didn't plan anything and where walking in the park when a guy asked us where we came from. After realising we are dutch he showed us his best dutch ;).He told us to go inside...read more ",
  "tripadvisor_monas_1": "Beautiful view from the top. In the Centre of Jakarta. One of nice things to see when u are in jakarta ;)",
  "tripadvisor_monas_2": "We spend a wonderful week in the hotel the service is excellent the room is very big and clean and the staff are good looking and lovely in dealing with people, the manager Rizal helped us in upgrading our room in a reasonable price he also offers us many services , he is very helpful and did his job professionally,...More  ",
  "tripadvisor_monas_3": "We didn't plan anything and where walking in the park when a guy asked us where we came from. After realising we are dutch he showed us his best dutch ;).He told us to go inside the tower, that it was a must see and showed the entrance (without wanting to be our quide or expecting money).There was...More  ",
  "tripadvisor_monas_4": "it was bad before,but now when jokowi and ahok is a governoor, now monas is very clean.if you come from another country, monas is one of a must visiting destination",
  "tripadvisor_monas_5": "If you come to Jakarta, you have to go to Monumen Nasional (Monas). Monas is the iconic of Jakarta. You can go with your family, couple or solo. You can inside to the museum, cawan and top of the Monas. Please attention the time and term of condition if you want to go to the top.",
  "tripadvisor_monas_6": "People say if you visit Jakarta but you haven't been to MONAS that means you haven't been to Jakarta LOL. Stretching 132 m above sea level with a flame covered with gold foil on its top,this is it the landmark of Jakarta. This is one of the most touristique spots in Jakarta. The museum of history of Indonesia is underneath...More  ",
  "tripadvisor_monas_7": "If you're a tourist, you may come here, take a couple of picture, hire a horse cart and that's it. Not much interesting spot available here. You may go up to the tower for a small fee to get skyline view, but not much you will get. Since now Jakarta has much more taller building surrounding this area. You may...More  ",
  "tripadvisor_monas_8": "Good as the gold that is said to make this monument, I was impressed by the height of the structure and what it represents. If there was something representing prosperity this would be it!",
  "tripadvisor_monas_9": "Loved visiting monas. Unfortunately didn't get a chance to go up as it was a 2 hour wait but I did go into it and look around and the general area is very nice. Be prepared for a long wait at weekends!",
  "tripadvisor_monas_10": "A good place to chill i suppose, nothing much. you can queue to get up to the top of the tower to enjoy the scenery, other than that, really nothing much about it. Its beautiful though.",
  "tripadvisor_monas_11": "location is amazing since its inside huge park , even they have small park for gazelle .. we didnt have chance to go to the top ( actualy its middle not top ) because many people...read more ",
  "tripadvisor_monas_12": "location is amazing since its inside huge park , even they have small park for gazelle .. we didnt have chance to go to the top ( actualy its middle not top ) because many people were waiting there .. the negative point is that this park has many doors but they force people to exit and enter only fron...More  ",
  "tripadvisor_monas_13": "It's a part of Indonesia's histrorical places. You will be amazed when you get into the top of it and see Jakarta's view frim there.",
  "tripadvisor_monas_14": "The grounds are large and the monument is a beautiful. The view from the top was good the day i visited as it was not cloudy or hazy. Well worth a visit 360* views at top.",
  "tripadvisor_monas_15": "It was really nice place to visit. It a walking distance from Masjid Istiqlal. There was night market with affordable and good things to buy as souvenir.",
  "tripadvisor_monas_16": "Been here with my friend in 2013 and had a great time in the Museum under the monument. One of the most beautiful monuments I have ever seen in Indonesia.",
  "tripadvisor_monas_17": "Landmark \"to do\" in Jakarta. I recommend go early in the day and buy a VIP ticket if possible to avoid a long wait. the history of Indonesia display in the underground area is interesting.I went on a hazy day so unfortunately, the view wasn't spectacular.",
  "tripadvisor_monas_18": "For me this was a pure waste of time. It might have some important meaning for Indonesians which i really do respect and appreciate, but from tourist perspective it is absolutely boring. Museum inside is the best part since it tells the story of the Indonesian history but not really taken care off on a proper way. Waiting in a...More  ",
  "tripadvisor_monas_19": "one of the best monument in indonesia, its around 400 feet and have lift to take you up to just below the golden fire.the special thing in this place i think are the diorama for indonesian history, its located at the basement.i suggest u take the shuttle service inside since it quite a walk from the entrance to...More  ",
  "tripadvisor_monas_20": "We visited the monument as part of a city day tour. Our tour guide was very enthusiastic about its importance and although we did learn something from reading the displays it was not worth the bother. It is a long, hot walk to enter the monument via a crowded underground subway.The queues to get upstairs for the view were too...More  ",
  "tripadvisor_monas_21": "I am indonesian and lived in Jakarta for long time. In Monas, you can buy the food or if there are a event in Monas, there will be lot of food and drinks from different regions, such as pempek, ketoprak, kue cubit or if there are not a event in Monas you can find around road of Jakarta there are...More  ",
  "tripadvisor_monas_22": "I see this monument everyday but I was warned by the local that lot of theft takes place around this area , So one has to be careful the bus stop is close to this place",
  "tripadvisor_monas_23": "I see this monument everyday but I was warned by the local that lot of theft takes place around this area , So one has to be careful the bus stop is close to this place",
  "tripadvisor_monas_24": "We were fortunate in visiting this place on a Sunday morning. Even at 8 AM the place was teeming with local and tourists.The monuments grandeur is mesmerizing and the lawns around are very well maintained.The market around the monument is vibrant but you need to bargain.",
  "tripadvisor_monas_25": "Worse place to visit in Jakarta. Long long walks. Poor signage. Absolutely handicap unfriendly. Too many steps, no elevators, rude employees, no English speaking employees, very hot inside and no place to sit n relax. I had a knee replacement and walking with an ankle brace and I would pay anyone whatever amount to find me a wheelchair. They just...More  ",
  "tripadvisor_monas_26": "Nice view of Jakarta, and worth visiting this monument commemorating independence from the Dutch. Only in daytime, closing at 4pm when I was there in August. Have your concierge check opening hours. North Entrance to gated Merdeka Square (Merdeka means independant or free) is only one open. I walked to East gate from Istiqlal Mosque thinking that I would reach...More  ",
  "tripadvisor_monas_27": "This is the historical place in Jakarta.There is the monument in that place. The monument made with gold",
  "tripadvisor_monas_28": "there is a theme park, a market and sprawling space surrounding this monument. had there been more time, my colleagues and i would fall in line to ride the elevator and see the view up there. we were not ready to brave the long queue. maybe next time...",
  "tripadvisor_monas_29": "This place worth a visit, it is safe, clean and has a lot of interesting details and history, not to mention the modern architecture",
  "tripadvisor_monas_30": "Great views of the city ... very colorful lighting.Jots of steps to climb to get to the elevatorNot wheel chair friendly",
  "tripadvisor_monas_31": "Monas...well, its a monument and the park is huge. However not much to see but it is nice to have some space to walk in that traffic choked city.",
  "tripadvisor_monas_32": "Recommend for all the next generation to learn our history... Need to have more attention on well keeping this historic place... We need to preserve this place",
  "tripadvisor_monas_33": "The monument is worth checking out if you are in Jakarta. It doesn't take very long to take a look around in here. Downstairs, they display information about the history of...read more ",
  "tripadvisor_monas_34": "The monument is worth checking out if you are in Jakarta. It doesn't take very long to take a look around in here. Downstairs, they display information about the history of Indonesia and you can get to the top. They only have one small elevator so the queue can be quite long. The top is not a very good spot...More  ",
  "tripadvisor_monas_35": "The National Monument and surrounding square reminded me of a poorer version of Tiananmen Square in Beijing. I assume it was once a sight to behold, but honestly it has fallen on hard times. The cobblestones are uprooted, there is grass growing in the stone and there are homeless people lying all over the gardens. The monument itself is just...More  ",
  "tripadvisor_monas_36": "I was here on car free day and the weather was nice. It was relaxing and I enjoyed it, would come back again.",
  "tripadvisor_monas_37": "The best time to visit National Monument or Monas is its known locally is during the morning, and that too on weekdays where one will have the chance to go all the way to the top and get a birds eye view of jakarta. Sadly , by the time we reached therir around 3:30 PM the tickets for the observation...More  ",
  "tripadvisor_monas_38": "Monument was constructed to commemorate long national struggle of Indonesia and people integrity. And even the construction of monument do represent the same. Its a tourist friendly spot. The only downside was limited visit tickets for top. We couldn't grab the one despite our efforts both in the morning and in the evening.Dont forgot to visit base tower museum....More  ",
  "tripadvisor_monas_39": "Monas is one of places in Jakarta fit for walking tour. In the weekend, you could go up to the highest tower of Monas to see Jakarta from the top.It also has museum that represent the story of Independence Day of Indonesia. A must visit place to go.",
  "tripadvisor_monas_40": "A must see place in Jakarta.You can access the museum and also go to the top of it.Ticket pretty cheap.very interesting and informative.",
  "tripadvisor_monas_41": "It is maintained nicely n green with lots of games inside monument area (e.g.: basketball) .Can know Sm part of history of Indo at basement of monument with a great statues to tell stories .Cheap entry fees",
  "tripadvisor_monas_42": "its the national Monument located in central Jakarta. The surrounding park of moans is oped from 7am - 12 am and entry inside Monument is restricted from 8.30 am to 5 pm. The entrance fee is around 1$ that include National Historic museum,Independence room and elevator to top yard. At top yard you can see the skyline of central Jakarta...More  ",
  "tripadvisor_monas_43": "Monas is the most popular tourist spot in Jakarta. You haven't visited Jakarta if you've not visited this monument.Visitors can go inside and up to the top of the monument, with an entrance fee of Rp 20.000  7.500 if you want to go to the top.Not just tourists, locals also love visiting this area. It has a...More  ",
  "tripadvisor_monas_44": "While the monument is very nice and a focal point to visit in the city, the procedure one has to go through to obtain a ticket to get in is ridiculous. Why would I pay for a...read more ",
  "tripadvisor_monas_45": "The line to get to see the top takes around 1.5 hours to get through. It is a nice view but im not sure that as a foreigner it is worthwhile investment of time. If theres some nationalistic reason for you to visit here then sure why not",
  "tripadvisor_monas_46": "Don't go there to see it, a picture on the internet gives you the same experience. Weird pink lights and the park surrounding it is also not very nice and surrounded by loads of traffic",
  "tripadvisor_monas_47": "While the monument is very nice and a focal point to visit in the city, the procedure one has to go through to obtain a ticket to get in is ridiculous. Why would I pay for a 30,000 rupiah card to access the monument if the admission fee is only 5,000 rupiah per adult? I do not plan to visit...More  ",
  "tripadvisor_monas_48": "The National Monument (Indonesian: Monumen Nasional, abbreviated Monas) is a 132 m (433 ft) tower in the centre of Merdeka Square, Central Jakarta, symbolizing the fight for Indonesia. It is the national monument of the Republic of Indonesia, built to commemorate the struggle for Indonesian independence.Construction began in 1961 under the direction of President Soekarno. Monas was opened to...More  ",
  "tripadvisor_monas_49": "Monas is of of the best and amazingly Monument among others in the world, it's huge and have like a Gold metal on top of it, and you can go there through elevator from below... ALL you can see the history of Indonesia Heroes especially their independence heroic. Near behind the Monas it's a wide huge field and very nice...More  ",
  "tripadvisor_monas_50": "AT National Monument, There's a very BIG monument of Indonesia. The area is so large, clean and fun. There's even a large amount of pokemon and pokestop! The perfect place to visit with your family. You can walking, running, bicycling in here",
  "tripadvisor_monas_51": "Other than the monument itself this is a vast open space in the middle of the city for the locals to exercise and relax. Lots of tourists too.",
  "tripadvisor_monas_52": "dint find anything interesting, had to wait in a long queue to get there and then it was disappointment",
  "tripadvisor_monas_53": "For some reason at the top of the viewing platform they have installed flood lights that point directly towards the viewers. This means that what should be a spectacular view of Jakarta by night is squinting and looking at flood lights!",
  "tripadvisor_monas_54": "True symbol of Indonesians' brave struggle for freedom. Mere glimpse of the monument fills you with pride for the sacrifices made by the whole country to achieve independence. Very well maintained and absolutely clean despite thousands of visitors thronging the place every day. A must visit for all.",
  "tripadvisor_monas_55": "Came here again after my last visit 6 years ago. Many improvement found here. No more \"asongan\" and \"juru parkir liar\". Great place when you need an outdoor activity and some...read more ",
  "tripadvisor_monas_56": "Recommend this place to everyone who wants to know Indonesia. The museum display is well done displaying Indonesia's fight for independence. Transportation is provided to the monument or you can walk to it.",
  "tripadvisor_monas_57": "The National Monument at Jakarta (otherwise known as MONAS), really requires much improvement to be a tourist attraction. One of the vital requirements of a public spot is good and accessible public amenities such as restrooms. At MONAS, it's quite a challenge to find one! Once you near it, you discover that it is seen only by its roof and...More  ",
  "tripadvisor_monas_58": "If you go, make sure you take your own Chicken. They skull really appreciate the walk.Had a brilliant time.",
  "tripadvisor_monas_59": "Have to stop here to taking picture when you in Jakarta City because it is the national monument of the Republic of Indonesia",
  "tripadvisor_monas_60": "Came here again after my last visit 6 years ago. Many improvement found here. No more \"asongan\" and \"juru parkir liar\". Great place when you need an outdoor activity and some refreshment after being stuck on daily routinities but doesn't have much time.",
  "tripadvisor_monas_61": "If you go to Jakarta City, never forget go to monas (national monument). That is a monument symbolize the spirit of Indonesia people to get our independence from colonialism at that time. Design directly by our first president Mr. Ir. Soekarno as an architech. Memorable and the park already neat and clean after controled by Jakarta Government.",
  "tripadvisor_monas_62": "Visited one day as there's not loads to do in Jakarta. Took some photos outside, went to enter and were told they weren't taking people to the top anymore so didn't bother with the museum. Personally didn't find it that impressive",
  "tripadvisor_monas_63": "this is jakarta most iconic statue,, not so famous like twin tower malaysia, but this statue hold so much meaning and historical spirit of indonesian legacy",
  "tripadvisor_monas_64": "Got lots of walking to do 😂 I wouldn't recommend people to go to monas if you hate walking a lot especially in the stairs lool but in the end it was all worth it! could see the beautiful view from above :)",
  "tripadvisor_monas_65": "The national monument is the key attraction to see in the city of Jakarta. It is centrally located in the city and easy to get to. It lights up at night.",
  "tripadvisor_monas_66": "Is Jakarta the symbol .. Everyone coming to Jakarta is must come, is good for afternoon activity, is so beautiful place.. Is recommended",
  "tripadvisor_monas_67": "Is Jakarta the symbol .. Everyone coming to Jakarta is must come, is good for afternoon activity, is so beautiful place.. Is recommended",
  "tripadvisor_monas_68": "Walking in the green alleys covered with trees is changing from the crowd of Jakarta. If you want to enter the monument, you will have to buy a card to pay the entry fee of 5.000/person. Inside the monument you will find a little museum, describing the history of Indonesia. It's a good and simple way to learn more about...More  ",
  "tripadvisor_monas_69": "It was fun to visit this place. I was there on a Sunday so the place was pretty packed with lots of people from all over Indonesia that was there to check out the national monument and some were not that used to seeing people from far away (like myself coming from Norway). So lots of people wanted to say...More  ",
  "tripadvisor_monas_70": "I'd love to give it more than 3 stars but on a weekday morning I had to wait for 30 minutes to get on the single elevator to the top of this monument;that just takes the lustre of this well maintained monument,its gardens.",
  "tripadvisor_monas_71": "I visited this monument with group of friends on the evening. We could go up until the allowed level possible for visitors. The view from the top is amazing. We could see city of Jakarta until the harbor in Tanjung Priok and the mountain of Salak. It was such a great experience.",
  "tripadvisor_monas_72": "Good to have alook at.Can go up to the top of you have time.Entrance is not obvious - is across from the monument not at the actual base of the monument-a directional sign might help( also some English signs)",
  "tripadvisor_monas_73": "Me and my friend go to Monas at 5:30pm. We want to go to the top of monument.Start from the gate you need a prepaid card (jakcard only) you can buy at there to but so many queue.Ok, after that there was so long long long lines to go to the top of monument. About 2 hours, finally...More  ",
  "tripadvisor_monas_74": "After being awhile not visiting this area (well, about more than 10 years ago since my last visit), I was bit surprise with Monas now. Alots of fun, sports, gardens. Not too hot anymore. If you have more time in Jakarta, try to visit Monas! its worthed!",
  "tripadvisor_monas_75": "We went to this monument after visiting the National Museum. Did not wait for the top to be opened again in the evening and just visited the museum in the ground-floor. Quite an interesting description of the history of Indonesia, but do not expect any exhibits. One negative aspect was that whenever you came close to the bathroom, it was...More  ",
  "tripadvisor_monas_76": "It is just that this is a very symbolic of Jakarta, as Eiffel in Paris or Colloseum in Roma. Therefore having a photo in front of Monas is such a must. You don't need to say anything, the photo will speak by itself that you've been in Jakarta.",
  "tripadvisor_monas_77": "This is a very tall building and you have to use the lift. There are long queues unfortunately but the view is amazing. Downstairs there are models to look at but I wouldn't...read more ",
  "tripadvisor_monas_78": "This is a very tall building and you have to use the lift. There are long queues unfortunately but the view is amazing. Downstairs there are models to look at but I wouldn't bother going again.",
  "tripadvisor_monas_79": "This is a place worth going if you want to spend an hour or two after visiting the national museum. A big park, full of local people and tourists. There's also free concerts over the weekend, when it's packed with local youngsters. You may do jogging over there too. Many locals do exercises such as badminton, jogging and soccer. I'm...More  ",
  "tripadvisor_monas_80": "Monas as National Monument of Indonesia and a Landmark of Jakarta. This monument is a friendly to all citizen and tourists to visit. Only pay to enter the building and tower. For the rest in a huge park with green garden view is free to enjoy.",
  "tripadvisor_monas_81": "We wandered around the Monas and experienced an awe for the sheer size of the piece. It sits centrally in the main park area where you can find places to eat and markets to shop. A great place to kill hours just people watching too. The Monas has areas to climb up and explore inside before climbing to the lookout...More  ",
  "tripadvisor_monas_82": "You can take the elevator cost Rp 17.500 until the peak to see Jakarta city from above in 2005. I used to be like it, but i end up dissapointed when i visited again a couple months ago with my mom. The elevator was broken, so many people sleeping inside the basement, the aircon didnt work properly so it was...More  ",
  "tripadvisor_monas_83": "Went on a Friday morning. It was very crowded with lots of tourist out for the day.Good view of the city, but we failed to go to the top of the monument, please plan more time for the long queue, We go to the bottom of the monument and see the history of Indonesia.",
  "tripadvisor_monas_84": "Great to understand a bit of the history of Indonesia, all explanation inside Monas is in Bahasa Indonesia and English, although you don't find a lot of tourists walking around.It is a nice park to sit down for some relaxing time, however come with confortable shoes as the parking lot is far from Monas entrance.They also have cheap...More  ",
  "tripadvisor_monas_85": "We go there during the lebaran holiday.. and of course the place was full with people..And its very hot here because of the open area...We manage to go to the bottom of the monumen.. and see the history of indonesia.. but we failed to go to the top of the monumen due to so many people..Maybe we...More  ",
  "tripadvisor_monas_86": "Went on a Sunday afternoon. It was very crowded with lots of families out for the day. The park is very big! It's a nice place to stroll and take in the crowds. You can go into the tower itself, but the line wraps around the building. If you take a cab make sure they take you to an entrance...More  ",
  "tripadvisor_monas_87": "Beautiful and spacious green area. With eateries segregrated, walking and queueing path defined, the place requires more time to explore. To have a good view of the city at the top of the monument, please plan more time for the long queue.",
  "tripadvisor_monas_88": "First thing first, dont visited in the afternoon because it could get very hot here. Best time is either morning or evening to night. The Monas is tall enough so it could be...read more ",
  "tripadvisor_monas_89": "First thing first, dont visited in the afternoon because it could get very hot here. Best time is either morning or evening to night. The Monas is tall enough so it could be spotted in many area in the city. You could buy ticket to enter to the top of the monument to enjoy Jakarta from above",
  "tripadvisor_monas_90": "Right In the middle of Jakarta. It's a historic Museum of Indonesia and sample of independence. you need to be patient to get to the Tower because it attracts a lot of people tourist and locals.",
  "tripadvisor_monas_91": "Monas has been my favourite place to visit whenever i go to Jakarta. It's been a huge changes.❣There is FREE shuttle from entrance Lenggang Jakarta to the Monas tower❣Ticket using JakCard❣The exhibition hall is very clean and well kept❣the elevator going up to the tower, also clean, and fast❣Sufficient rubbish can.",
  "tripadvisor_monas_92": "The National Monument or what Indonesians call as \"Monas\" is the monument built to remember the struggle of Indonesian heroes fighting the colonial domination.The top of Monas like a flame.symbolizing a never extinguished spirit of Indonesian people.You can reach the top yard by elevator & enjoy the view of Jakarta city .Monas area is usually used for outdoor sport &...More  ",
  "tripadvisor_monas_93": "a huge area to cover, make sure you put on your sunscreen and hat. to go up right under the gold, you need to prepare yourself for a long queue because the lift only fit for max 10 person and the viewing area on top is limited space. On holidays, the queue can take hours and hours. it is better...More  ",
  "tripadvisor_monas_94": "Actually, i live in Jakarta for 21 years and that was my first time visiting Monas, before I went there, I only saw Monas from the car when I was on the road. LOL Actually, I really like Monas, the place is really clean, green, and huge. You can see another beautiful side of Jakarta from Monas.",
  "tripadvisor_monas_95": "Even the main attraction is the monument, but on the field outside the monument there's always any festivals/events being hold, mostly on weekend. Visit here in the morning is good, you can stroll around outside the monument and enter the monument once the weather get hotter. But if you want to go to the top of the monument (the gold...More  ",
  "tripadvisor_monas_96": "This place has a unique entrance from the Food and Culture Park where there are several tents selling souvenirs and local food. Some interesting individuals dressed as military heroes sitting with no support was very interesting. A short walk along the path and one can see this huge monument towering everything else. It is beautiful and one can walk around...More  ",
  "tripadvisor_monas_97": "In the surrounding of Monas we can ride a vehicle powered by a horse called \"delman\". once after we enter the building we can see diorama, that are depicting each stage of history of Indonesia as a nation. This diorama is very useful if you need to give history lessons in an interesting way. after that we can go up...More  ",
  "tripadvisor_monas_98": "The area in and around monas is nice. After u park ur vehicle there is a small open bus to take u to monas. However it closes by 1500. The place is nice with small market for souvenirs and small eats. As far as monas is concerned there is a museum in the basement which is must if ur interested...More  ",
  "tripadvisor_monas_99": "A monument for remember independent of Indonesia. This place isi in a huge area. This place become very hot place in sunny day. I have to cross a long way from gate to reach the...read more ",
  "tripadvisor_monas_100": "A monument for remember independent of Indonesia. This place isi in a huge area. This place become very hot place in sunny day. I have to cross a long way from gate to reach the monument tower.Actualy it's a musium of Indonesia's history. I like this part. They have started telling history by 3D models from their early age's...More  ",
  "tripadvisor_monas_101": "We visited Cathedral before entering Monas park. There's a lot of gates but you can only enter at the very front gate. They will not allow you to enter from other gates but upon entering the front gate, there's no security check. So if you are going to walk from Cathedral, expect long distance of walking.",
  "tripadvisor_monas_102": "A nice place to visit and wander around. If you want to go to the top, get there reasonably early because the tickets sell out quickly. A great sight at night when it is illuminated.",
  "tripadvisor_monas_103": "So nice view up down to Jakarta skyline. You can see more from here then the most places in town. If you go to Jkt and dont have much time, you should come here.",
  "tripadvisor_monas_104": "Huge monument. Wide open area. We didn't get to go up the monument because it was packed on a Sunday. The nice thing is that we saw lots of people in the park and how active it was and a huge fitness class. The monument is great to see lit up at night and in the sunshine during the day....More  ",
  "tripadvisor_monas_105": "Visited this and the attention to detail was amazing in the educational Windows. The writing was clear and easy to read. Highly recommend this destination, was great to see so many students visiting. Super clean.",
  "tripadvisor_monas_106": "Monas is situated in a beautiful part of this amazing city surrounded by greenery. Average walking distance to the monument which includes a museum. Safe area for backpackers and tourist in general.",
  "tripadvisor_monas_107": "Visited here on Indonesian independence day. Lots of people hanging out all around the entire area. There is a huge open space surrounding the monument with lots of grass and trees.",
  "tripadvisor_monas_108": "Great atmosphere between large and big area, in the central area of the city of Indonesia and historical monument of the Indonesian independence",
  "tripadvisor_monas_109": "Worth seeing but not spending too much time over monas is a monument and you can climb it, I decided not to in the end as the next day was Independence day and it was busy.",
  "tripadvisor_monas_110": "Get there early to beat the crowds and heat of the day. White visiors should be prepared to be chatted to, photographed, interviewed by students and stared at during their visit...read more ",
  "tripadvisor_monas_111": "Get there early to beat the crowds and heat of the day. White visiors should be prepared to be chatted to, photographed, interviewed by students and stared at during their visit. Just smile and be friendly and watch your belongings. You can visit the top of the monument but you must visit early as the wait can be 2 hours...More  ",
  "tripadvisor_monas_112": "Getting into the Monas area can be a maze. Best to hire a cab and have the driver get you close to the entrance, which must be entered on foot near the Gambir train station. Bathrooms and food stalls are available on the walk in. Once inside the grounds, you can chose to wait for a tram to the entrance...More  ",
  "tripadvisor_monas_113": "Visited this placed after my business trip in Jakarta. Its located near the National Museum and the Istana.It is about a 5 to 10 minutes walk from the carpark to the centre of the National Monument. Along the way, it a long pathway there are some military tanks that you can take good pictures.Nearer to the carpark area,...More  ",
  "tripadvisor_monas_114": "The National Monument is a 132 m tower in the centre of Merdeka Square, Central Jakarta, symbolizing the fight for Indonesia. It is the national monument of the Republic of Indonesia, built to commemorate the struggle for Indonesian independence.With no shades it can be very warm hence be careful.Dont miss to spend time at the museum at the...More  ",
  "tripadvisor_monas_115": "There was only one e trance to the square, so we had to walk around for a while. If you look on google maps, the entrance is at the upper left corner. The big gate was closed, but the small doorwas open. Entrance fee 15.000 for the museum and to go to the top. Once inside, there is aircon and...More  ",
  "tripadvisor_monas_116": "My girlfriend and I arrived in the parking lot and started walking to what we thought was the entrance, then asked someone and had to turn around. Then about 15 minutes later we had to ask another person where to find the entrance and they pointed us in another direction. My girlfriend is Javanese and from the area, but neither...More  ",
  "tripadvisor_monas_117": "Impressive, and a well maintain area for locals and tourists to enjoy. The place however is dated and perhaps deserves a makeover to refresh the facilities. Exhibits (eg diorama) were very informative but very dated. Can do with better lightings.The wait to take the lift up to the top (puncak) was very long. It was only serviced by 1...More  ",
  "tripadvisor_monas_118": "Absolutely beautiful but if you get a chance to see it at night....do so. Also, if you would like to visit a \"taste\" of the pop-up-market vendors then walk around outside the gates of the monument. Although these vendors are not allowed inside the gates of the Monument grounds, they are approved to set up outside the gates. Interesting for...More  ",
  "tripadvisor_monas_119": "We went to the Monas and wanted to visit the museum. The line was 3 hours and it took forever to get into the \"garden\" that is fenced all around the Monas. Was nice to look at it once but would not wait 3 hours in the sun.",
  "tripadvisor_monas_120": "The monument itself is pretty impressive and is in the middle of a HUGE park. Unnecessarily huge, it seems, because there is loads of unused space. Given the hell that is the traffic congestion in Jakarta, it almost seems like a waste of space. I understand that any city needs its green spaces and it's a beautiful area. But it...More  ",
  "tripadvisor_monas_121": "Nice place and we liked the weather with the sunset it was amazing day in the park of national monument so u should be go to these please with family",
  "tripadvisor_monas_122": "Nice place and we liked the weather with the sunset it was amazing day in the park of national monument so u should be go to these please with family",
  "tripadvisor_monas_123": "Nice looking monument which is a good photo and not much else. It's located in a pretty much empty park like space with nothing else really to do. Unless your close by this is not worth fighting Jakarta traffic for a visit.",
  "tripadvisor_monas_124": "If in Jakarta a visa to the National Monument is a must ad it is seen from every where. It is interesting to see it at night as it is lit up and looks like a torch.",
  "tripadvisor_monas_125": "Visited Monas on a Saturday night which may have been our first mistake. It was very busy but the line to go to the very top didn't seem that long. However the lift to go to the top had a capacity of 11 people and there was only one lift. It took us 2 hours to get to the top....More  ",
  "tripadvisor_monas_126": "WHERE IS THE ENTRANCESome other people got in and had a look around and they seemed to be enjoying themselves but we watched from afar as we couldn't figure it all out",
  "tripadvisor_monas_127": "We found this monument nicer in the evening. It is nicely lighted. There is a park around, but it was full of people during day. Some gates to park are closed during special occasions so be aware when trying to cross park in your way to Gambir station.",
  "tripadvisor_monas_128": "Not much good in the area - best to go during the week to avoid the crowds - but not a monument you would expect in other large cities. Bit let down....",
  "tripadvisor_monas_129": "Good ambience for night visit, and near from Gambir station. For family is the one of must visit in Jakarta.",
  "tripadvisor_monas_130": "Monas is known as one of city landmarks in Jakarta.It is perfect for sightseeing.Monas is actually a museum, thus, you will be able to learn about Jakarta once you stepped inside.The top of Monas is a fire replica which is coated by gold.One level beneath is the level where you can see a panoramic view of...More  ",
  "tripadvisor_monas_131": "I haven't went to Monas for 2,5 years, it make me surprise when I back t there. The last time in Monas, many of junk, smell everywhere because some visitor pee on the garden, and many illegal street vendors offering drinks and toys in higher price...But thanks to Governor Basuki, make Monas clean, nice, and green. If you go at...More  ",
  "tripadvisor_monas_132": "monas as a symbol of jakarta. i stayed near Monas. even i have many time i go to there for gym like running, walking or with my bycicle around of Monas. a lot of trees and park in...read more ",
  "tripadvisor_monas_133": "My family and I visited the Monas tower on 31st July Sunday so when we got there it was not a surprise that it was crowdy. We had a long walk to get up to the barricade surrounding the tower. The gates were locked. We saw people inside the barricade and we wondered how on earth they got inside as...More  ",
  "tripadvisor_monas_134": "monas as a symbol of jakarta. i stayed near Monas. even i have many time i go to there for gym like running, walking or with my bycicle around of Monas. a lot of trees and park in here. Monas have the beautiful view from the top.",
  "tripadvisor_monas_135": "This place is awesome. Sits right in the middle of the city next to the presidential palace, the National Cathedral and the National Mosque. Entrance fees are very reasonable, we paid $3 for 2 adults and 2 kids. They warned us at the ticket office that the wait to go to the top was more than 2 hours. While getting...More  ",
  "tripadvisor_monas_136": "I stayed at Jakarta for 20Y but never going to the top of monas, yesterday my sister come to jakarta & she want to go to the top of monas.Came in the evening, so it was not too hot to wait queue.Very little information about location of the ticket purchase, some people queuing up to join to the...More  ",
  "tripadvisor_monas_137": "Just hanging around looking for pokemon in this area. I barely went to this place because nothing to do in here. If u go to here in the morning every weekend, i think u can go to jogging or something",
  "tripadvisor_monas_138": "The MONAS I would say is a must visit but do not spend too much time around here, take a stroll around the MONAS before heading to the mosque and cathedral nearby. I personally didn't take the trip up since I have visited certain towers such as Tokyo tower, Shanghai tower and even the KLtower for skyline views, but if...More  ",
  "tripadvisor_monas_139": "It is near Gambri station. Monas is nice and big park to have rest and walk.However Weather is both hot and humid after a while it become not possible to walk. If you go with taxi be careful that it should stop close to the entrance door otherwise you walk 1km more (like me) People want to take photo with...More  ",
  "tripadvisor_monas_140": "This place is amazing.. please spare your time to visit monas. One of attraction in jakarta area. U can reach by busway. Easy to go. There are lots of indonesian stories in monas. Please come and enjoy it. Come in the morning or noon okay 😉",
  "tripadvisor_monas_141": "not too many things that can be done around here, very boring standard looking park. won't waste my time to go here",
  "tripadvisor_monas_142": "Historical icon that represents the people of Indonesia. Good that during this trip, I was able to see it from Gambir Station. Only 1 gate (the other side) is still open beyond 4 pm.",
  "tripadvisor_monas_143": "Since Jakarta doesn't have many landmarks, Monas is pretty decent to visit if you happen to be in the area. It would be nice if you can get to the top, but the line can be too...read more ",
  "tripadvisor_monas_144": "Since Jakarta doesn't have many landmarks, Monas is pretty decent to visit if you happen to be in the area. It would be nice if you can get to the top, but the line can be too long that it might not be worth the wait. Overall it's not the best but an interesting place to visit.",
  "tripadvisor_monas_145": "Nice view at night from the outside . The inside is very need a renovation. Bring a wheelchair for an old people with a knee problem. And bring a baby stroller if u bring a kids",
  "tripadvisor_monas_146": "Monas is located in central of jakarta it is the icon of jakartaIf you visit this place i recon at night",
  "tripadvisor_monas_147": "It is worth a visit for the historical value as well as the view of the city from the tower. The visit includes a tram ride around the environs along with scenes re-creating historical events and the panoramic view from the top of the tour.",
  "tripadvisor_monas_148": "you must see, is prety big. But on top of the monument is going only one lift - this mean if you will go to visit late morning you will be in large queue. Every hour in the hall is reading indipendece declaration. On the lower level of the monument is nice historical preview of the Indonesia",
  "tripadvisor_monas_149": "This place is very good to visit during morning and evening. If in afternoon and hot day, this place really not suitable for fun with children. Good place to walk with family",
  "tripadvisor_monas_150": "Monas (National Monument) is the simbol of Indonesia multi ras, multi etnic and multi cultural. Its located in central Jakarta, facing the predential palace.This is a must seen location for foreigners.On Sunday morning, jakarta people visited this place for light sports/exercise.Sometimes there's firework events around 9PM on the weekends.",
  "tripadvisor_monas_151": "Went thereAnd haven't got chance to enter the park as Monday is closed recently liLittle bit disappointed. But the mosque is quite close so you can visit two attraction at once on foot",
  "tripadvisor_monas_152": "We didn't get to the Museum or the tower due to the huge line full of indonesian tourists, and the outdoor part is not special at all. There are just a few entries/exits so bear that in mind cause the heat can be pretty suffocating.",
  "tripadvisor_monas_153": "This is one of the top places you have to visit if you come to Jakarta! From the park until the main building (monas) you can enjoy it all the way! It's nice to walking around in the park. You can do sport such cycling or running too. In main building (monas), you can go to the top of it...More  ",
  "tripadvisor_monas_154": "Its is a monument with a large park. Good to relieve stress in crowded city. The park itself is well maintained, so green and beautiful. Beware of rain and sun, especially rain...read more ",
  "tripadvisor_monas_155": "Its is a monument with a large park. Good to relieve stress in crowded city. The park itself is well maintained, so green and beautiful. Beware of rain and sun, especially rain since roofed building is quite far to reach or just bring umbrella.Come early in the morning for the perfect air, or just before sun set to see...More  ",
  "tripadvisor_monas_156": "The park and the monument itself are very nice. The history exhibition in the basement below, however, is a study in self-glorification and the glossing over of inconvenient facts. As the exhibit seems to be rather dated, I would guess it was made during the dictatorship; it is absurd that it has not been updated to reflect history in a...More  ",
  "tripadvisor_monas_157": "Seeing from gambir train station, traveling can make a difference by seeing it from near. Usually from afar so its nice to be able to see it",
  "tripadvisor_monas_158": "National park area which usually has crowds of people enjoying the vast open spaces especially on weekends. Large figurine history museum in the bottom of the base that gives a nice outlay although violent detail of Indonesian's history. To get to the observation deck is a real hassle since there is only 1 lift, yes one for reaching the top....More  ",
  "tripadvisor_monas_159": "Very famous landmark of Jakarta :) it's low-cost tourist destination, but worth and useful for kids. To enter the monument till the top (above the gold statue), it costs IDR 15000. Inside the monument is a big hall for very nice dioramas of Indonesia history. The best time to visit Monas is in Ramadhan season.. hehe.. Not too long to...More  ",
  "tripadvisor_monas_160": "This is the monument that is intended to unify all the Indonesian people. It was build under the reign of the first Indonesian President Sukarno. In those days it was important to do state-building and to make sure that in a large country as Indonesia there was unity and so this monument was built with the massive golden flame on...More  ",
  "tripadvisor_monas_161": "'Little' sanctuary within the chaos of Jakarta and a must see when visiting Jakarta. Went alone and it is quite a walk around it but very nice.",
  "tripadvisor_monas_162": "Will be back Jakarta is an amazing city . Kota , cafe bratavia, hire tuck tuck , go an a Moterbike all a must",
  "tripadvisor_monas_163": "This monument is quite large and well maintained. There is trolley bus from one of the gates tithe enter acne. The ticket is 15000 rupiah to go to the top.the view from the top is majestic.... Lift takes you there. The musem in the basement is very informative on Indonesian history.",
  "tripadvisor_monas_164": "The large grassy area around the monument was completely brown and the long and slow moving line dissuaded me from waiting multiple hours in the sun to enter. Based on other reviews I have read, that was probably a good thing. I will say the size of monument is impressive.",
  "tripadvisor_monas_165": "We visited the museum underneath the Monas monument.The entrance is across the monument, so don't search for it under the monument.We were surprised by the lack of...read more ",
  "tripadvisor_monas_166": "Clean place, very wide and full of history value, for travellers who like heritage and museum then this place is a must visit one. Enjoy😂",
  "tripadvisor_monas_167": "We visited the museum underneath the Monas monument.The entrance is across the monument, so don't search for it under the monument.We were surprised by the lack of maintenance in such an important national monument. You can barely call it a museum. Underneath the tower there is this big hall where people sit on the floor. The lighting is...More  ",
  "tripadvisor_monas_168": "Went there on Friday at 10am and didn't get out til 12:30pm. We waited in line in the heat for almost two hours and the view wasn't even that great. Perhaps worth it if you've never seen a large city from above, but in terms of the view Jakarta doesn't quite compare to other big cities like Hong Kong, NYC,...More  ",
  "tripadvisor_monas_169": "Just a must see when you visit Jakarta.The Monas is in an traffic free area.Be early in the morning when you want to go up in the Monas. Queues can be long if you arrive late",
  "tripadvisor_monas_170": "Fun and cheap place to learn history and get nice view of Jakarta. It's open till night so if you can also get a view of Jakarta at night. The local government has done a good job preserving this site. Everything is now more organized, more fun, easier and cleaner.Some tips:1. Go there in week days to avoid...More  ",
  "tripadvisor_monas_171": "there is a free return shuttle from parking lot at irti to the monas. lots of food stall before entering the monas park. quite long queue to go to the highest floor at monas (took us more than an hour) so better go in the morning to prevent long queue.",
  "tripadvisor_monas_172": "This building consist of several rooms / halls,which are Diorama room (display the Indonesian history), independence room (independence gate / Proclamation text, national emblem/ Garuda Pancasila and indonesian flag), the observation deck (Jakarta landscape) and flame of independence (50 kg of gold foil). It open 8.00 am - 11 pm. The observation deck open twice a day at 8.00am- 15.00pm...More  ",
  "tripadvisor_monas_173": "Big park with nice view of Monas. The park is gettin nicer and nicer...Many people hang around the park just for relaxing & picnic. Playing kite is the most popular game in this park, cause its big park and far from building area, so its very windy in the afternoon. To bad the parking area is very limited, so its...More  ",
  "tripadvisor_monas_174": "Actually, this is the central of Jakarta, the capital of Indonesia, also one of the most famous landmark (if i'm not mistaken) in this country. On top of this monument has a statue made from bronze layered with pure gold, resembling a flame. (As u can see like the statue of Liberty) You can go climb up to the top...More  ",
  "tripadvisor_monas_175": "We visited MONAS during a public holiday and it was packed. We did not attempt to climb as friends had tried earlier in the day and been told that there was a 4-hour queue! However it was worth the visit to spend time in the green spaces around the monument; green spaces are very lacking in Jakarta. We ignored the...More  ",
  "tripadvisor_monas_176": "It's a nice place but poor in facility. There is only one lift to go up and down so you can imagine the queue especially in holidays.",
  "tripadvisor_monas_177": "It's a nice place but poor in facility. There is only one lift to go up and down so you can imagine the queue especially in holidays.",
  "tripadvisor_monas_178": "Jakarta National Monument is representing the Indonesian independence. Beautiful surrounding, If your visiting Jakarta don't forget to visit this national monument.",
  "tripadvisor_monas_179": "A place where you can do vacation and learning history of Jakarta.The garden and city forest is not as good as the ones in other country, but since green garden is rare in Jakarta, this place is good for relaxing.The cleanliness and maintenance need to be improve, especially the public toilets.Need more gazebo or place to hide...More  ",
  "tripadvisor_monas_180": "for visitor who visited Jakarta. this monument is the best you can get. Cheap and easy access. Not so crowded, even in the weekend. You can see a big part of Jakarta from the top of building and can use telescope also.",
  "tripadvisor_monas_181": "Monas aka Monumen Nasional actually kind of museum in a center of huge garden.As a symbol of Jakarta city this place offer u not muct excitment.In a garden less tree make u not really comfort if u walk there in a hot sunny day. Food n beverage there are expensive.If u want to go to the top...More  ",
  "tripadvisor_monas_182": "I visited this place together with my foreign friends. Honestly, there aren't many activities to do here aside from entering the monument itself. So you better plan your activities here. There are many people who sell different kind of things including toys and snacks. Perfect for a trip with friends or family.Bring hats and sunblock to protect your skin...More  ",
  "tripadvisor_monas_183": "Monas (National Monument) what we call it. The abbreviation of Monumen Nasional in Indonesian.It was built during Soekarno's era, Indonesia's first president as a memento of Indonesian fight and struggle to liberate its country.Basically, there are 3 parts of this place.The garden, very huge one, you just pay 5k IDR for car parking.The monument itself split...More  ",
  "tripadvisor_monas_184": "Monas is one of the historical monument in Indonesia and also the icon of jakarta, worth visit once in lifetime if you happen to go to jakarta,but, its not so spacious and the stair is very hard to access to go the the highest spotdown is okay and lots of history about indonesiathe weather quite hot also...More  ",
  "tripadvisor_monas_185": "This is a monument which can come across when traveling in Jakarta from one area to another specially central area from other area. People come here to spend some time with friends, have food and a look at the place both day time and night time. Some of the nice hotels are very close to this area.",
  "tripadvisor_monas_186": "Nice view from the top of monas.must see from Jakarta.Historical monumen.you will feel different on top of monumen.",
  "tripadvisor_monas_187": "It is a place everyone should go, just to appreciate the view of this huge city of Jakarta. There's also a museum inside which tells the story of Indonesia. It can interesting for...read more ",
  "tripadvisor_monas_188": "It is a place everyone should go, just to appreciate the view of this huge city of Jakarta. There's also a museum inside which tells the story of Indonesia. It can interesting for children. Outside of that it's just a tower. Depending on the day and time you visit you will probably have to wait for a while in the...More  ",
  "tripadvisor_monas_189": "Could not access MONAS from the MONAS bus stop. Gates locked all around. Some people inside, yet the place seems to have lost its atmosphere without the traders that once circulated around the grounds. So much potential- with green spaces that would be delightful to picnic in.",
  "tripadvisor_monas_190": "from monas, you can see the entire jakarta..... it's so highthe ticket is also reasonableplace has to be visitted if you come to jakarta",
  "tripadvisor_monas_191": "We visited while in town for a wedding. The grounds were nice but we were unable to go inside the building because it was closed. We were there on a Monday. I'm not sure if they are closed every Monday or if this was a holiday.",
  "tripadvisor_monas_192": "Monas is famous for the gold fire-like sculpture on top, and the dioramas inside it about Indonesia history.we can generally split it into 2 section, the park outside, and the monument itself (Monas stands for National Monument )The park is quite large, with a lot of trees and fountain which can dance :Dit will be a good...More  ",
  "tripadvisor_monas_193": "Visited on recommendation to take in view from top. Arrived at 2 pm to find a c 1 HR queue and, since it was due to close shortly they weren't making any more sales even if I wanted to wait.Took in the underground diarama anyway. Good for potted Indonesian history on an hour.Will probably try again but have...More  ",
  "tripadvisor_monas_194": "I visited Monas once when I was a kid and what inside it impresses me so much. There was a recording of Soekarno reading the proclamation of independence, the Bendera Pusaka sewn by Fatmawati and dioramas of Indonesia's historical events. I finally visited it for the second time when my cousins from NZ came here one or two years ago....More  ",
  "tripadvisor_monas_195": "Interesting to visit. Entrance in the park is only in the north an south side. There is a small market in the south entrance with typical Indonesian food and merchandising. When you are inside, the entrance of the monument is on the north, using an underpass that brings you under the bottom of the monument. In there you can find...More  ",
  "tripadvisor_monas_196": "Getting to the monument involved a walk through a nearby park taking a shuttle to the monument and then going underground to get to an elevator that took you to the top for an impressive view. The wait was long to board the elevator, and though the view was great it seemed anticlimactic. However standing inline to board the elevator...More  ",
  "tripadvisor_monas_197": "This is nice free public place for jogging in the morning or late afternoon. They have big space. I am prefere to jogging in the morning there.There is also a museum. But you must pay for the entry. It is cheap also. You can find the history of Indonesia. And other things, you can go up stair of the...More  ",
  "tripadvisor_monas_198": "Was nice to go see and the views were great. The only down side was the distance you had to walk from car par to the monument. There are lots of stairs which was terrible as we...read more ",
  "tripadvisor_monas_199": "Monas is the great location to see jakarta from the top and they have many cheap gift shop. There are some garden there so make you feel comfort.",
  "tripadvisor_monas_200": "Was nice to go see and the views were great. The only down side was the distance you had to walk from car par to the monument. There are lots of stairs which was terrible as we had our 2 year old who needed to be carried.",
  "tripadvisor_monas_201": "I had a great time walking in its Park.. And when I went inside the museum, the history that they show us was like we were there when it happened.. And the view from up was breathtaking.",
  "tripadvisor_monas_202": "The monument is telling the story of Jakarta's developments. Its a must visit for all. Decorated with clean and flowerish garden, foreigners are honorably welcome. Located at the heart of Jakarta, you will easily enjoy the local and international cuisine restaurants surround and comfort public transportations. Jakarta now has change her face, the incumbent governor has strongly lead to renovate...More  ",
  "tripadvisor_monas_203": "Monas, the national monument, would be a good point to see Jakarta from the top. That has to be your objective for coming to this place.One must go to the basement tunnel to purchase the entry ticket to MONAS, and principally to get to the plaza. There, you will be asked to stay in line (you might feel the...More  ",
  "tripadvisor_monas_204": "Monas or national monument is one of the spot to visit in Jakarta (central). The monument is tall and is surrounded by trees and lawns. If you wan to unwind or just killing some time in the city, you can drop by here. also, you can go inside the monument itself. not sure if you can go all the way...More  ",
  "tripadvisor_monas_205": "after 25 years, i came again to this monument area, and right now have a lot of very good restoration and maintenance to make tourist or visitor feel comfortable. very clean area included their food areas.",
  "tripadvisor_monas_206": "the view from the top is worth the wait. The whole place is a bit disorganized but the park is nice to just hang out and people watch. It is easy to get there using public bus and possibly the cheapest hassle free way rather than tangling with traffic",
  "tripadvisor_monas_207": "Filthy city, full of beggars & a corrupt government that gives absolutely nothing to its people. If you enjoy enjoying seeing poor creatures suffering from a corrupt and broken system and seeing abject poverty in its raw state,then go. Indonesia is a beautiful country but Jakarta is a rat-hole with Monas in the centre of the muck.",
  "tripadvisor_monas_208": "JUST BEAUTIFUL. I go for a walk/jog each time I am in Jakarta. Spacious, beautifully maintained, Lovely atmosphere, Colourful....just WOW.",
  "tripadvisor_monas_209": "Is a monument built to remember the struggle of Indonesian heroes fighting the colonial domination. A very nice place to snap pictures and also you can buy the Jakarta's souvenirs...read more ",
  "tripadvisor_monas_210": "Is a monument built to remember the struggle of Indonesian heroes fighting the colonial domination. A very nice place to snap pictures and also you can buy the Jakarta's souvenirs and gifts. You also can have a refreshing coconut drink!",
  "tripadvisor_monas_211": "Nice atmosphere. its a clean place. Big garden around the Monument. Small zoo where you can find beautiful Deer. From top of the Monument you can see whole Jakarta and feel fresh air. Small shopping area where you can find clothing nice Indonesian food and specially coconut water. I enjoyd my self here.",
  "tripadvisor_monas_212": "Good visit except for the queue for the lift was too long and time wasted in the hot sun. Maybe another lift added could reduce the long queue and reduce the time wasted waiting for just one lift up and down.",
  "tripadvisor_monas_213": "Much better now but still need to provide more restroomThr traffic also need morr patient i have spent timr almos 2 hours only for 10 km by taxi from stock exchange building in scbd",
  "tripadvisor_monas_214": "Situated in the heart of the city, its nice to visit this esp early in the morning when crowds are lesser. The walk through the park is fun and also there is a complimentary nus service from gate to the entrance of the monument. The entry point lies to the west side and ticket to the top as welll as...More  ",
  "tripadvisor_monas_215": "The monument was closed when we were there - it is surrounded by a rather large park, but there was nothing to do.",
  "tripadvisor_monas_216": "Monas is a legendary icon of Jakarta. Nowadays Monas and its park have been cleaned by local government from illegal hawkers, so the park now is very neat and tidy. There is Lenggang Jakarta near the park area, a place to have some local food.",
  "tripadvisor_monas_217": "Was in monas just before sunset. It's the perfect time, you can see city with sunlight then at night.",
  "tripadvisor_monas_218": "Car free Sunday in Jakarta is great to get outside and walk. 5 km round trip in a really nice atmosphere. Everyone seem relaxed and enjoying the opportunity to spend time with family and friends.",
  "tripadvisor_monas_219": "Beautifull tourist object in jakarta like in eiffel tower in paris...U should go there and enjoy some jakarta's foods, looking for new experience to visiting historical tourist object",
  "tripadvisor_monas_220": "One of the best attractions in Jakarta with excellent views in all directions. It is a good location to take a picture of the mosque.Some advice, get there before opening hours...read more ",
  "tripadvisor_monas_221": "You should go, or drive by there during the night. It is more pretty with all the lights. You should see it when your in Jakarta. Been there, done that.",
  "tripadvisor_monas_222": "The area around the Monas is dirty and really poorly maintained. It is a shame that one of the most famous Indonesian monuments is left in such a state. The city of Jakarta could use this huge area to make a nice park instead. I don't think it's really worth spending too much time there but you can stop for...More  ",
  "tripadvisor_monas_223": "One of the best attractions in Jakarta with excellent views in all directions. It is a good location to take a picture of the mosque.Some advice, get there before opening hours as the queue can get very long and you could wait for hours.",
  "tripadvisor_monas_224": "Historical monument...full of story about Indonesian independence. First monument in the heart of jakarta city. Big playground and dancing water fountain. We can see all round jakarta from the top of the building..",
  "tripadvisor_monas_225": "At the city center the Monument has a very big park for family week end picnic and around it has a eating outlets.",
  "tripadvisor_monas_226": "You can just admire it from a certain distance: no need to walk all the way up to it in the heat. Nice.",
  "tripadvisor_monas_227": "Monas is a historic site . Outside Monas is a good area to breathe the air , and a community gathering place for jogging location",
  "tripadvisor_monas_228": "Average. Surrounding water is dirty. Guides are a bit too aggressive. The mosque nearby and the Catholic church are both more interesting.",
  "tripadvisor_monas_229": "Built in 1961, The National Monument stands proudly in the center of the 1 square kilometer Merdeka Square, symbolizing the hard-fought struggle of the Indonesian people to gain their Independence.Obelisk-shaped and covered in white Italian marble with a golden fire on the top, the Monument is 132 meters tall and stands on a platform which houses a museum and...More  ",
  "tripadvisor_monas_230": "locals hv a strong feeling abt monas.. bt it is just another tower...lots of street hawkers gather on the road leading to monas during the evng..mkng it a gr8 plc to buy goods at a bargain...u cn sit on the grnd nd njoy the evng..thts abt it.",
  "tripadvisor_monas_231": "Just located in front of the President Palace. People are coming here for taking picture only since mostly people in Jakarta used this area likes a field sport. Coming around 5pm...read more ",
  "tripadvisor_monas_232": "Just located in front of the President Palace. People are coming here for taking picture only since mostly people in Jakarta used this area likes a field sport. Coming around 5pm looks nice. Be careful with all your belongings while visiting this place from the thief",
  "tripadvisor_monas_233": "The Monas monument is easy to acces and its pretty cheap to take the elevator to the top and enjoy the view of Jakarta",
  "tripadvisor_monas_234": "The MONAS or National monument is located at the center of the Merdeka square surrounded by some very important office buildings at its periphery. The Merdeka square itself is huge and has huge open spaces for people to sit and have a good time. There are food and souvenir shops around the entrance as well. The atmosphere during holidays and...More  ",
  "tripadvisor_monas_235": "One major pain is getting into the monument. Only one entrance for this huge area. We didnt buy the ticket to go in since we werent in a mood for another museum.",
  "tripadvisor_monas_236": "The views of this monument with a sunset sky as the back drop is magnificent. I would definitely recommend visiting at this time, however I am unsure how to go up it or how much it would cost, so if you plan to do that, you should go earlier in the day.It is one of the main attractions to...More  ",
  "tripadvisor_monas_237": "MONAS, as it is universally known, is in the centre of Jakarta. It was a brainchild of Sukarno, first President of Indonesia. I have never actually got to the top of the MONAS, as it is almost impossible to do so without paying off a tout, which I refuse to do.",
  "tripadvisor_monas_238": "Nice to visit durring evenig time .you can find local food . local sevinier and play a game if you are Lucky you will win a gift .nice food ayam penyet and pecal lele.",
  "tripadvisor_monas_239": "I guess you dont have to visit it per se, as you will pass ot several times when you are out and about in Jakarta...",
  "tripadvisor_monas_240": "I go there jogging from hayam wuruk to monas... One of the most fav place in jakarta..i got there 4.45am so there is no one there...only a few security..place is quite large..at last one of the most fave place..go there",
  "tripadvisor_monas_241": "Although hard to find the entrance it is a very nice monument. Cheap to enter and provides a lot of history about Indonesia. From the early beginning, Dutch colonialism to their independence.",
  "tripadvisor_monas_242": "The problem with MoNas is that it's a tourist trap. You go there, you try to get pictures but you get inundated by hawkers selling everything from postcards to the most...read more ",
  "tripadvisor_monas_243": "Come here for one day trip with family. Better to come at morning when the visitors haven't so many yet, or you have to queue for a long time.",
  "tripadvisor_monas_244": "The problem with MoNas is that it's a tourist trap. You go there, you try to get pictures but you get inundated by hawkers selling everything from postcards to the most unflattering photos of yourself from five minutes ago. Other than that (and maybe the humid tropical weather), it's quite enjoyable and can prove quite educational.",
  "tripadvisor_monas_245": "This monument is so huge!!! Its nice to walk around or see the view from the top of monument. :)But too bad still too many trashes everywhere",
  "tripadvisor_monas_246": "Yea, started at the train station and actually walked the entire perimeter before giving up. Only one gat was open and it was guarded by guys telling me to walk to the other side. I smiled and walked away knowing I was just on the other side.It's a beautiful monument with what seem to be deer in one corner?...More  ",
  "tripadvisor_monas_247": "another place that only has a single open entrance while other gate was closed. I entered the main entrance but thinking that the asr prayer is almost over, I decided to take pictures at the entrance only and rush to Gambir St for prayers. after I done with my prayers, i walked to another entrance that was on the north...More  ",
  "tripadvisor_monas_248": "it is the iconic of Jakarta and worth to visit. It was sad because the queue was so looong. My priority came to this place was seeing Jakarta city form the monument but the busy time made me to cancel initial planning. One other thing I like too is old transport called Dokar! Should try this fun ride by horse!",
  "tripadvisor_monas_249": "I was went there with my son to see our proklamator voice recorded, Mr. Soekarno and Mr. Hatta ( first pres and asst ) and all the history of it. We went up to the top of monument and see the gold that been made for it my son was happy since we were on the top of building could...More  ",
  "tripadvisor_monas_250": "Monumen Nasional (National Monument) is undoubtedly the icon of Jakarta. Thousands of people flock the site on Saturday and Sunday. I suggest going there on Sunday to see the many families enjoy their days off spending time with the beloved ones or jogging around the monument.",
  "tripadvisor_monas_251": "Went to Monas on 28April2016. It wasn't crowded at all so our Son had soo much space to run and explore without the need to be on top of him as its car-free and very clean. Just outside Monas you can take the free of charge City tour bus which brings you to various nice places and allows you a...More  ",
  "tripadvisor_monas_252": "This location is surely not for foringers. This is a locals hangout. I had a very bad experience here. My friend who is a local took me to see this soo called monument. All the we wer walking to and frm ppl on the side shops kept whistling, calling names. Finally it ended up on a physical fight with the...More  ",
  "tripadvisor_monas_253": "The monument is a very popular place to visit in Jakarta, came with a group of friends and it was very busy, the line to get into the monument to walk up was too long. Unfortunate...read more ",
  "tripadvisor_monas_254": "The monument is a very popular place to visit in Jakarta, came with a group of friends and it was very busy, the line to get into the monument to walk up was too long. Unfortunate cause i think the inside must be a different experience to viewing from outside. Also having an elevated 360 degree view of Jakarta would...More  ",
  "tripadvisor_monas_255": "The National Monument is a 132 m (433 ft) tower in the centre of Merdeka Square, Central Jakarta,This is a must visit place if you are in town, plan a 2 hours walk and sit relax at the park to enjoy the tower view.If you are there on early open hour, then u can get in the line...More  ",
  "tripadvisor_monas_256": "I went with with my friends here and it's quite big and far for us to walk into the building. the building itself have a dark light feeling, just like a museum full of historical of Jakarta, Indonesia. actually i want to go upstairs to see the gold statue, but it's too crowded at that time, so I cancelled it.",
  "tripadvisor_monas_257": "Stunning place to see Jakarta Panoramic from the height....You can reach this place day and night. One of must visited place in Central Jakarta",
  "tripadvisor_monas_258": "Make sure that you inform yourself well about whether the monument and park will be open when you plant visit. On 3 separate occasions in January and March, we were unable to gain access to either. MONAS looks impressive from a distance and I am sure there would be fine views on the rare blue-sky day.",
  "tripadvisor_monas_259": "We come here couple of times since last year and I feel proud now it's worth to visit.Cleaner and greener. Well still sometimes you see street vendor but not so much anymore and not chasing you anymore. However if come here, please bring hat or umbrella because of the heat.You can get here by taxi or public transport...More  ",
  "tripadvisor_monas_260": "In the Monas, you can enjoy the park, you can go upstairs and see Jakarta, you can go with friends or family",
  "tripadvisor_monas_261": "There is nothing much to see at this place. The Monument is in city and surrounded by well maintained park/garden. It is good place to go for picnic with family, specially in rainy days.",
  "tripadvisor_monas_262": "The que is really long to go up to the top. About two hrs when I was there on the weekend and so did not bother. Otherwise interesting storey of Indonesia's history.",
  "tripadvisor_monas_263": "This amazing place was the only thing I managed to visit during my brief stay in Jakarta. I did not have appropriate clothes so it was pretty unpleasant to stay outside. Therefore, apart from checking just temperature prior to your trip I advise also checking the humidity. Monas is an astonishing piece of architectural design and the local people are...More  ",
  "tripadvisor_monas_264": "I has been spend my holiday in jakarta for 4 days and the best park I ever seen is a Monas this park had a gold in the top of monument and have a lot choice of traditional street...read more ",
  "tripadvisor_monas_265": "I has been spend my holiday in jakarta for 4 days and the best park I ever seen is a Monas this park had a gold in the top of monument and have a lot choice of traditional street food",
  "tripadvisor_monas_266": "We went here at night and I guess it's just the perfect time to visit the monument since it's not too hot and the light's lit up. There are shops were you can buy some souvenirs. Overall, there's nothing much to do but take pictures.",
  "tripadvisor_monas_267": "I've recently lead a tour around jakarta and this place is definitely a must visit! It's Jakarta's icon. A lot of Indonesia's history in it and don't forget to go to the very top to get a good view of the city. It can get really hot and damp, but I think it's worth it",
  "tripadvisor_monas_268": "Like the Washington Monument is to Washington D.C., Monas National Monument is THE image of Jakarta. It's significant to Indonesia as well. It was beautiful during the day and even more beautiful at sunset. I didn't find this structure architecturally spectacular, but its significance and history made it a must see for me. The park's landscaping is kept very neat...More  ",
  "tripadvisor_monas_269": "There is museum in the bottom of it: very basic, but I guess it would be very good for those who do not now the history of Indonesia.",
  "tripadvisor_monas_270": "A must see if you visit Jakarata, the museum is great, gives good historical information on Indonesia. Also the view from top of the monas is spectacular",
  "tripadvisor_monas_271": "inside of the monument always crowded with people, specially during holiday season. The park feels average, the food average, around the park you can feed local deer. Many public transport available to reach this place. Street vendor always annoys you, be careful with them.",
  "tripadvisor_monas_272": "Somehow, my taxi driver left me far away from the entrance and had to walk 30 minutes to find out the entry point.Wide open place to have some fresh air and also to look into the national monument.",
  "tripadvisor_monas_273": "Full of historical story but unfortunately. Not very good in maintain. Traffic and time for waiting to see from the top is could be 2 hours. The view is good when on the afternoon or night. In the 12 pm. Omg it's very hot",
  "tripadvisor_monas_274": "Said National status is located in one of Jakarta's largest squares. It is national symbol, with no much activities surrounding. Anyone can see it clearly from car windows. it doesnt deserve allocating time for.",
  "tripadvisor_monas_275": "I have visited this museum with friends and to be honest i was quites surprised - the museum is well maintained, no rubbish etc. There is a part with sculptures, ceramics, a part...read more ",
  "tripadvisor_monas_276": "I have visited this museum with friends and to be honest i was quites surprised - the museum is well maintained, no rubbish etc. There is a part with sculptures, ceramics, a part showing the traditional craft by region of indonesia, etc",
  "tripadvisor_monas_277": "Our visit didn't start well because there are MANY entrances into the park but only ONE was open. The other entrances had plenty of guards just inside the gate to tell you to go to the next gate. Consequently we had a long hot walk BEFORE we even got into the park. Tip: don't let the taxi leave until you...More  ",
  "tripadvisor_monas_278": "Every nation has an image and a story that details how they like to see themselves and how they would like others to see them.MONAS provides this insight!Locals seemed happy that a foreigner was there and many, especially the school children wanted to practice their English and ask for my thoughts on the presentations.I was the only...More  ",
  "tripadvisor_monas_279": "Monas is very suitable for Jakarta first timers. It is the icon of Jakarta that it is said a visit to Jakarta is not complete without taking pictures in Monas. Inside this tower is a national museum of how Indonesia got its independence.",
  "tripadvisor_monas_280": "The National Monument is a 132 m tower in the centre of Merdeka Square, Central Jakarta, symbolizing the fight for Indonesia. It is the national monument of the Republic of Indonesia, built to commemorate the struggle for Indonesian independence",
  "tripadvisor_monas_281": "To summarize my review, the heat is terrible, the govt only planted tree on outer area of monas, so when I walked into monas, it was very hot. Although the govt provided a mini train car to get there, there are only 2 cars and of course the waiting in line is too long because the visitor is overcrowded.The...More  ",
  "tripadvisor_monas_282": "The monument, celebrating Indonesia's independence, is located within a huge and peaceful park. We were here on a weekend, so the lineup for the tower was about three hours. We walked around, enjoyed the landscape. Lots of families with young children. We used this location as a jump off for the National Museum. Lots of food stalls, souvenir shops and...More  ",
  "tripadvisor_monas_283": "Good place. Coming from India, I can compare this to India Gate of Delhi.Good gardens around this place for family picnics. Good lovely atmosphere.The exhibition inside the main tower is great and gives a lot of insights about the struggle of Indonesia and it's origins also. The sad part for me was that by the time I reached...More  ",
  "tripadvisor_monas_284": "Have come here many years ago with my groups of teenager which i was their guidance.This is Jakarta landmark. Inside you can see the history of Indonesia, especially Jakarta. To go upstairs you need to queue and pay some fee. Especially in high season when a lot of tourists come here and school children for study tour.Please be...More  ",
  "tripadvisor_monas_285": "This monument is right in the Centre of the park. Slightly confusing to get in since only one entrance to the park although there are many gates, all were closed. As you go through the one open gate there are lots of people selling literally everything from food, to fans, to sunglasses etc etc. you then get to the main...More  ",
  "tripadvisor_monas_286": "I visited this landmark of Jakarta through a local tour - Jakarta good guide. It's a must see for every visitor to Jakarta although I didn't go to the top of this Monument...read more ",
  "tripadvisor_monas_287": "I visited this landmark of Jakarta through a local tour - Jakarta good guide. It's a must see for every visitor to Jakarta although I didn't go to the top of this Monument. Recommended to all travellers.",
  "tripadvisor_monas_288": "Catch the free tram near the entrance. It will take you to the entrance of the monument (you go under the street to go in). The cost for adult was Rp15,000. Great views! (wasn't very smoggy on day I was there). A bit of a wait ~30 minutes (11am on a Tuesday) for the single elevator going up and down...More  ",
  "tripadvisor_monas_289": "The Monas is surrounded by well manicured lawns - lots of it. Great place for a walk around. Believe you could get to the top earlier, but probably closed to public now. Has a little flea market of its own with stalls selling everything from T shirts to local food.",
  "tripadvisor_monas_290": "Nice view of the city (or parts of it at least). We got there early, apparently the school field trips along with tourists flood this place after 10:30 am. A nice multilingual local 'guide' found us wandering around outside - he gave a nice tour and could tell us much of the history.",
  "tripadvisor_monas_291": "Everyone knew that Monas became hystorical Landmark of Jakarta. You should go there at least if you visit Jakarta. Big space around Monumen Nasional (MONAS) could give a comfortable walk with family members esoecially in the morning. Just need to clean the area outside of the fences due to found illegal vendor street spotting non designated places to trade.",
  "tripadvisor_monas_292": "The Monas is like most other huge pillars around the world , but centered in the middle of a large park which is nice, lots of concrete walking area's, probably suitable for exercise in the morning or evening around the park.. Footwear should be runners as lots of walking .. Heaps of hawkers selling goodies if you want .. Very...More  ",
  "tripadvisor_monas_293": "The place was big, suitable for joggers and do some other activities, the Monas monument was crowded with people, couldn't even go to the top at all, nothing other things to see. Ride a horse with carriages to make a big round outside the Monas, but nothing to see also except all the cars and traffic, with the price a...More  ",
  "tripadvisor_monas_294": "Nice view. Really Indonesian. So many people, not too clean but almost being a good place to see amazing monumen from Jakarta-Indonesia..",
  "tripadvisor_monas_295": "Monas greqt place .. when night.monas will be sparkling with different color . They also have attraction like debus and ondel ondel..",
  "tripadvisor_monas_296": "Jakarta capital city icon.. now clean,green, and comfort for tourist. But if any night market you must be carefully on your pocket,wallet, or bags.",
  "tripadvisor_monas_297": "This is my first time to be there I got a lot of fun. There is indonesian old transportation called dokar, you could go around and enjoy around monas.",
  "tripadvisor_monas_298": "This is my first time to be there I got a lot of fun. There is indonesian old transportation called dokar, you could go around and enjoy around monas.",
  "tripadvisor_monas_299": "At a price of Rp15,000, we can go to the top to see Jakarta and to visit their museum for all historical information for Indonesia",
  "tripadvisor_monas_300": "Nice to visit. One of the top sights in the city. Nice place to visit if the weather is good. Good view from the top.",
  "tripadvisor_monas_301": "This is a great place for tourism to see Jakarta city from the top of Monas or jogging. It was very crowded, so I recommend you to come early in the morning. If you want to eat something, please buy it from trusted seller to prevent you from disease. Enjoy :)",
  "tripadvisor_monas_302": "A great place to hang out here and enjoy the Monument. I went here on Sunday morning, many people come to exercise like jogging and aerobic.",
  "tripadvisor_monas_303": "I really enjoyed the dioramas depicting the history of Indonesia in the heart of monument. It is a great way to learn of the challenged past of the country. My 11 year old son liked the trip to the top of the 132 meter monument which provide great vistas of the area. If you only have time to do one...More  ",
  "tripadvisor_monas_304": "Next one, be prepared for too many people trying to sell you something or students asking questions. Nice place.",
  "tripadvisor_monas_305": "We really enjoyed a stroll around this historic monument. The party is very lovely and the monument itself is very impressive.",
  "tripadvisor_monas_306": "Impressive for a city that has nothing else impressive as for the area and ground a little disappointed.Lots of school groups but all in all a good experience",
  "tripadvisor_monas_307": "It may be the national monument, but it is not worth it! Very impersonal and does not reflect the rich culture of Indonesia, more a political statement! I would skip this....",
  "tripadvisor_monas_308": "If you are walking to Monas make sure you know the entrance. The area is massive that you can't even find the proper entrance. Don't come on the weekends, packed with people who...read more ",
  "tripadvisor_monas_309": "The park is a giant open area of a rectangular shape, from each corner there is the widest road I've ever seen (could be 10 lanes of it was marked) leading to the monument in the middle of the park. The problem is that the park is accessible only from 1 corner (SW) making it impossible to walk the sights...More  ",
  "tripadvisor_monas_310": "Thirty six kilograms of pure GOLD layered the top of the National Monument which was built after President Soekarno's visit to meet President John Kennedy in Washington DC 1960. The torch is lighted in such a way that when you look up from the Presidential Palace, the torch resembles a long haired woman sitting down on her heels...check it out!",
  "tripadvisor_monas_311": "Monas is located near to the President Palace and Train Station Gambir. It is symbol of Jakarta. It is very large area, we can enter to see many historical happened in Indonesia. By Elevator, we can go to upstairs to see sorrounding of Jakarta City that are beautiful.",
  "tripadvisor_monas_312": "If you are walking to Monas make sure you know the entrance. The area is massive that you can't even find the proper entrance. Don't come on the weekends, packed with people who want to go up to the top.",
  "tripadvisor_monas_313": "Just be on the watch out for opportunistic your guides. They may not be authentic. Police staff very friendly and willing to give guidance.",
  "tripadvisor_monas_314": "symbol of Indonesia, at Jakarta. its easy to find because it is near from Gambir Station. central Jakarta.",
  "tripadvisor_monas_315": "Largest park in the world. Indonesia main icon. Monas was Indonesia's first dedicated landmark. Soekarno built it for show off to the world how Indonesia, a newly independent nation, could develop rapidly without any aid from developed countries.",
  "tripadvisor_monas_316": "We tried to visit Monas twice during our short stay in Jakarta but failed. On the first occasion, the taxi left us at the wrong gate and we couldn't tell as there were no any signs indicating entrance! We had to walk a very long distance in the heat and pollution to discover that they had closed. On the following...More  ",
  "tripadvisor_monas_317": "The monument and garden are niceBut the so called museum is only a a kind of diaporama teaching official history to Indonesian people",
  "tripadvisor_monas_318": "very big monument indeed.. I recommend going there for the big surrounding park... very good if you want to escape the noisy unescapable traffic",
  "tripadvisor_monas_319": "Like every Monument, pretty much you go and take a picture. But this one is an important one for Indonesia, it is actually on their bill. Worth a visit.",
  "tripadvisor_monas_320": "This is monument of jakarta.Top of this monument like light fire from candle.If u go to the roof u can look landscape around of jakarta..Many people came there for take jogging every morning and afternoon",
  "tripadvisor_monas_321": "Like every Monument, pretty much you go and take a picture. But this one is an important one for Indonesia, it is actually on their bill. Worth a visit.",
  "tripadvisor_monas_322": "Nice trip and well maintained national monument. Istiqlal Mosque with it's contemporary design & is the largest in Southeast Asia can be seen at a distance from here.",
  "tripadvisor_monas_323": "Monas is stand for Monumen Nasional and it is mean National Monument. Monas is the land mark of Indonesia located in Jakarta. Monas is located in the heart of Jakarta just a cross the Istana Negara (state palace). As you can see there is some kind flame craft made of real 32 kilogram solid gold on the top of Monas....More  ",
  "tripadvisor_monas_324": "Yeah, the grounds of the monument are clean, well kept and great for a picnic if you want!Inside the monument is a lovely historic display of about 40 dioramas, very cool.",
  "tripadvisor_monas_325": "This place ok, much transport because strategic (busway or shuttle bus). Cheap and beauty, sp very recommended",
  "tripadvisor_monas_326": "This modern mark of the vibrant and varied country of Indonesia is a must see in Jakarta. The park is impressive and the nearby national museum is well worth a visit.",
  "tripadvisor_monas_327": "It's impressive to see... But you have to be there before 3.00 pm because it will be close at this time. So you can't go upstairs.",
  "tripadvisor_monas_328": "Stately view...awe-inspiring monumentKindly improve the cleanliness of the area where the food and souvenir stalls are...foul odor can b smelled... it dampens the beauty of MONAS",
  "tripadvisor_monas_329": "Worth while visiting but be ware of the heat in jakarta city.Go up if you can and if the rows are not too long.",
  "tripadvisor_monas_330": "Use thin shirts and shorts. Its very hot and you don't want to sweat all over yourself. Hat is a must. Sunglasses. And a camera of course. I love the dioramas, be there at morning...read more ",
  "tripadvisor_monas_331": "OK, there is not much to see in Jakarta and Monas does not help. Tall plain monument with a view surrounded by vast space of nothing (used for parades and other celebrations). The view itself might be nice, but it is very difficult to get there, the queues go on for hours and I tried to get there twice couple...More  ",
  "tripadvisor_monas_332": "Use thin shirts and shorts. Its very hot and you don't want to sweat all over yourself. Hat is a must. Sunglasses. And a camera of course. I love the dioramas, be there at morning so you can go up and leave the long queues. Don't go there at public holiday. Its dead end.",
  "tripadvisor_monas_333": "Stopped to visit Monas National Monument. It is pretty big. It is free to all. It also has a park trail too. It is worth seeing. Before leaving the park, go to the locals where they sells goods. There are food and drink stands. Go to the yellow color food stands. There you must find this lady who makes great...More  ",
  "tripadvisor_monas_334": "The area is now well managed and very clean. Friendly place for family, couple and group as the area offered a hugh space for everyone. It's very clean and free of street vendors now. If you knew Monas before...you'll be suprised to see it now. Well done!",
  "tripadvisor_monas_335": "As the icon of Jakarta, many people will agree that it deserves at least a visit if any newcomer or visitor want to document their journey to Jakarta.That is what I am doing when I first come here several years ago, and still the same until today.The park surrounding the Monas towar is good enough. Many people are...More  ",
  "tripadvisor_monas_336": "Don't go on a Monday, it will be a source of total disappointment. You can walk around the entire perimeter but you will have to navigate the traffic to do so.",
  "tripadvisor_monas_337": "It's the icon of Jakarta. There is a museum at the first storey with dioramas, displaying history of Indonesia, from prehistoric to current events. Don't forget to go to the top to the observation deck to view Jakarta skyline. You should go if you are a history buff who wants to learn Indonesian history in a simple and quick way...More  ",
  "tripadvisor_monas_338": "Nice History museum with details of all the important historical events related to Indonesia with 3D models, usually very crowded, tickets for going till the top of the tower get full very soon and are hard to get, very hot on Sunny days",
  "tripadvisor_monas_339": "It is a place to relax and meditate. Very broad and well mantained. Don't miss it while visiting Jakarta.",
  "tripadvisor_monas_340": "It's fun to visit, not a must. If you have extra time in Jakarta, you could check it out and take a picture, it's the main monument after all. The area is not very clean, rubbish bins available but some people just don't use it. It's more fun to visit in the evening, the night market. A lot of local...More  ",
  "tripadvisor_monas_341": "nice greenery with good view of Indonesian historic monuments.good place to chill out during the day",
  "tripadvisor_monas_342": "Was a part of the committee of ASEAN meeting, took the whole group there. Showing them the Icon of Jakarta. Still have to renew some items at the monuments. But overal is all good compare to few years ago.",
  "tripadvisor_monas_343": "Cool place to visit but very crowded on a Sunday. Go on a week day and you'll have a better chance to get to the top.",
  "tripadvisor_monas_344": "I like to sitting at monas every saturday night. The air are good still fresh. The view also good the condition of that place also very clean. The goverment take care monas very good . Love this place",
  "tripadvisor_monas_345": "In the centre of one of the biggest cities in the world there's a place where the locals meet and greet, enjoy some relaxed moments and fly kites.",
  "tripadvisor_monas_346": "nice greenery with good view of Indonesian historic monuments.good place to chill out during the day",
  "tripadvisor_monas_347": "Good for a picture or two from the outside, paying to go in gets you a little bit of a history tour by means of mock-ups, if you decide that you want a scenic view from the top ask first if the elevator even works before laying down the cash.",
  "tripadvisor_monas_348": "This national monument is an icon of Jakarta which should could be better managed. Many public facilities are inadequate. Less toilet and dirty. There are still many traders who sell in place that should be sterile from street sellers. There is no proper restaurant. Diorama inside the monument, out dated and uninteresting. Visitors just simply enjoy the view from the...More  ",
  "tripadvisor_monas_349": "I was taken to this excellent interactive educational monument by some very proud Indonesians who were excited to show me the history of modern Indonesia.I leant more from this visit that I thought I could.All surrounded by a beautiful park and rates as a must visit on your next trip to Jakarta. Parking is easier and there are...More  ",
  "tripadvisor_monas_350": "We are exciting to go there but pity we cannot go to the top floor. The lift is small and have maximum capacity per day. You should come earlier at 8am in the morning for queuing because only accept maximum 2000 people on weekend. Many people and students seating and lying on the floor at basement of museum. They should...More  ",
  "tripadvisor_monas_351": "This place is cool to spend with your kids to see the history of Indonesia in the basement or to see Jakarta from its highest place. The experience is different compare to our usual visit to shopping mall.",
  "tripadvisor_monas_352": "The Good:• cleaner environment• brighter environment• lots of food vendor• parking space is plentyThe Bad:• some areas are dark• security are not seen in some...read more ",
  "tripadvisor_monas_353": "The Good:• cleaner environment• brighter environment• lots of food vendor• parking space is plentyThe Bad:• some areas are dark• security are not seen in some areas• some parking area used for attractions",
  "tripadvisor_monas_354": "Went here during the day and had no interest to see Jakarta from the top. There are many hawkers at the bottom. I went towards the end of the day and found it wasn't very busy. I feel like this is like the Eiffel tower, you see it when you drive around the city so not a whole lot of...More  ",
  "tripadvisor_monas_355": "It's so beautiful place, a big park and in the center stand a building National Monumen. When I'm there I feel so excited, that place have a good vibe. Everybody going there, you can meet any kind of people in there. And it's so haritage.",
  "tripadvisor_monas_356": "At night the Monas is even more beautiful, but then you can't get up to see the view. In the morning you can get up for only 15000 idrVisit twice if you have the chance 😉",
  "tripadvisor_monas_357": "I went there on weekdays and it was great. However the peak are close at the moment due to elevator maintenance so I only manage to reach the cup (cawan) of the monument. There are free shuttles at the gate entrance to transport you to the monument entrance. Ask the guard at the gate and they will show you where.",
  "tripadvisor_monas_358": "Not much to do at monas in the day.. But if you go at the evening you can see what a lovely colors that monas has. The colors will changed as like a rainbow.. Dont miss it!!",
  "tripadvisor_monas_359": "Rich monument with golden fire on the top. The monument maintened well, but around south side of the monument (IRTI) just like a chaotic unplanned area, full with waste and lots of street vendors.",
  "tripadvisor_monas_360": "- place is vey nice for photographing.- the Elevator not working so we couldn't go up, and this big mistake from the authority as it is considered 50% of the visit.- musium attractive but a lot of students doing much noisy in the main hall,- toillet is very bad .- you cant get even water for...More  ",
  "tripadvisor_monas_361": "Ok place; ruined entirely by scammers claiming to be guides, and refusing to go. One of these was entirely inappropriate; with some x-rated suggestions. Go if you want; but be hard-hearted with anyone that approaches",
  "tripadvisor_monas_362": "A beautiful monument to watch from a distance but when you get close the mess, street vendors and muddy paths make it only a so so experience not worthy of what the monument should reflect.",
  "tripadvisor_monas_363": "Took my foreigner friends driving around Jakarta. Monas was the first stop. Walking around Monas park at 12pm is such a torture, damn hot! They enjoy diorama and going to the top...read more ",
  "tripadvisor_monas_364": "Took my foreigner friends driving around Jakarta. Monas was the first stop. Walking around Monas park at 12pm is such a torture, damn hot! They enjoy diorama and going to the top to see the whole Jakarta from above. Monas placed right on the center of Jakarta, there's gold on the top (we believed).",
  "tripadvisor_monas_365": "Not as tall as another cities in foreign countries' landmark, but Monumen National is our monumental structure, full of history and really suit with Jakarta. It is in central Jakarta and surrounded by important buildings.",
  "tripadvisor_monas_366": "We visited the National Monument shortly after our arrival to Jakarta. We waited about 15 minutes (weekday, summer, around 10am I believe) in line for the elevator ride up to the top. The view of the city was nice but the best part of the MONAS is inside the bottom. The panoramic (though a bit dark, and old) gives you...More  ",
  "tripadvisor_monas_367": "I do visit this place rather often in the weekend for Car Free Day on Sundays. At each time, Monas still takes my breath away. Elegant, strong looking structure that is the pride of the country!A must visit for all tourists! (domestic and international!)",
  "tripadvisor_monas_368": "I visited this monument while I was in elementary school (almost 30 years ago), and I did hope that things would change before my visit.A symbol of Jakarta, but unlike other city symbol, this monument is less fun. The ticket locket queue was not so simple, and the gate keeper was not so friendly (tired, lady? Then don't be...More  ",
  "tripadvisor_monas_369": "I was just in the garden to take Monas's views from different angles.. The Aerial viewsBeautiful, isn't it! Wanna go there sometimes for night shots one day!",
  "tripadvisor_monas_370": "Must take picture with this monument at the background whenever you come to Jakarta. You will learn about the history of Indonesia at the basement of this monument. Then you need to climb up to the top of the monument to have very good view of Jakarta city from above. You will also learn that the top of the monument...More  ",
  "tripadvisor_monas_371": "Its a beautiful and good mark of Jakarta. Not much to experience tho at the day time. Too large to walk around during the heat .",
  "tripadvisor_monas_372": "The place is huge but not much to see, the monument is big but not very impressive in architecture and style. Place is very clean and people where very friendly as most visitiors are from Indonesia.You can relax a bit from the busy streets of Jakarta. Inside you can have a fresh coconut (dont forget to bargain, first offer...More  ",
  "tripadvisor_monas_373": "There is nothing to show pride than to build something tall and erect, and the MONAS is no exception, albeit an ordinary one. The gold-plated bronze flame at the top is as gaudy as something you see in Las Vegas.The elevator to the top was broken when we visited, but there was no announcement or information whatsoever. We walked...More  ",
  "tripadvisor_monas_374": "its relatively a big park, lots of walking and a good climb to the top. view unmatched n a must for kids. you'll kill at least 2 hrs or less here. 4/10",
  "tripadvisor_monas_375": "its relatively a big park, lots of walking and a good climb to the top. view unmatched n a must for kids. you'll kill at least 2 hrs or less here. 4/10",
  "tripadvisor_monas_376": "It's a place all tourists go to. Quite nice to see Monas up close and see the Ramayana in scripted on the walls. But don't try going up, the queue is killing.",
  "tripadvisor_monas_377": "Monas is great place to spend a day with your family or friends. Its a huge place with lot of vendors, people from everywhere and sometimes there is stage performance.",
  "tripadvisor_monas_378": "Saw this many time since was young and finally there. Thought its small but huge area. well arrange tour when you are here. bird eye view to enjoy Central Jakarta from Monas. walking distance to few museum nearby and other tourist attractions. Need cap on day visit its hot here.",
  "tripadvisor_monas_379": "It is really interesting to see Indonesian people describe their national history. There are several scenes of wood on display which describe the major events in becoming an independent nation. There is a tour to the top of the tower, but waiting line was 4 hours so we skipped it.",
  "tripadvisor_monas_380": "If you come to Jakarta then visiting this monument is a must. You can see Jakarta's view from above. Btw they closed on Monday, and please come early in the morning as there was only one elevator so the ques was quite a home work :P",
  "tripadvisor_monas_381": "We arrived and got lost but we eventually made our way to the museum located underground, the museum had displays of lots of important events in Indonesia, and some of the displays were quite cool and interesting. However, the museum was a bit dark and we didn't get to go to the top since the elevator is in maintenance.We...More  ",
  "tripadvisor_monas_382": "Nice experience to see monument of jakarta and walking around, there are couple of interesting places around as well.",
  "tripadvisor_monas_383": "National Monument (MONAS) is nice and calm place in the mid of city. This is very good place for relax especially in the evening time. Nice to see in lights. A big relaxing park and local market nearby.",
  "tripadvisor_monas_384": "I was there on the day and the top tickets where sold out but everybody was nice and knew English . it was nice story",
  "tripadvisor_monas_385": "Monas or National Monument is a Land Mark of Jakarta the capital city of Indonesia. You have to go here if you spend your time to visit Jakarta, Indonesia. You can enjoy your time...read more ",
  "tripadvisor_monas_386": "Monas or National Monument is a Land Mark of Jakarta the capital city of Indonesia. You have to go here if you spend your time to visit Jakarta, Indonesia. You can enjoy your time in the morning just for walking, running or just spend the time to see what the people of Jakarta doing. You can also buy a souvenir...More  ",
  "tripadvisor_monas_387": "I saw Mona's from outside and the view was simply amazing. The area near Mona's was big, clean and nice. People can spend hours over der in evening. I liked the place and location.",
  "tripadvisor_monas_388": "Monas is icon of Jakarta. Normally, people came here for one reason, impression of the first time visiting Jakarta. The place is full of bikes, roller skaters and pedestrian. Some people sell snacks. Sometimes, trashes are everywhere in special occasion.You can reach this place easily by using mass transportation (Buss way)",
  "tripadvisor_monas_389": "Its a not so wonderful visit for me however i still grateful for make it live to see it infront of my eyes.U have to be clear on the timing if u wish to be at the top of the monument because the entry queue will be very long since morning and usually will be close at 3 pm....More  ",
  "tripadvisor_monas_390": "When first time visit Jakarta you need go here. This obelisk covered by gold on top of it. We can see Jakarta city at roof top this obelisk. Also provide a nice garden surrounding. Easy public transport pick us here can use TransJakarta Bus",
  "tripadvisor_monas_391": "Try and go after rains, when the sky clears. Firstly, this is so you can get a clear view through the city smog. Secondly, the rains deter the crowds, and MONAS often fills up quickly, and there's one elevator, and it can get quite stuffy.The view from the top of MONAS is wonderful. It's also very interesting to learn...More  ",
  "tripadvisor_monas_392": "Visit the basement and there are many diorama from Indonesia history. Quite interesting and educative. Dont have much time to go to the top.The surrounding parks also nice but unfortunately it is not too clean. People dont really care for the environment.",
  "tripadvisor_monas_393": "this is national monument you can see almost everywhere in central jakarta. Local people told the top is made up of pure gold. and it shinning also like same. a centre of attraction.we cannot go to the top due to long que but next tim surely go.",
  "tripadvisor_monas_394": "Impressive national monument celebrating the struggle for independence. Only one small lift going to the top, so, there WILL be a queue. It WILL be hot and stuffy, and there's no where to sit down. So, be prepared. There will be a queue at the top to come down again, so, English speaking Westerners, be prepared to get talking to...More  ",
  "tripadvisor_monas_395": "The monument is nice but theres nlt much to do around there. Felt a bit bored there but a good reference to explore othercareas",
  "tripadvisor_monas_396": "it is like looking at the Washington Monument. This big structure is surrounded by an impressive public park that is worth seeing in its own right.",
  "tripadvisor_monas_397": "it is like looking at the Washington Monument. This big structure is surrounded by an impressive public park that is worth seeing in its own right.",
  "tripadvisor_monas_398": "It's surprisingly clean. We entered from West entrance and there were a lot of stalls selling local food and souvenirs. Didn't get to go to the top as the queue was long.",
  "tripadvisor_monas_399": "The Monas called by local is a good place to visit. you have to pay 15000 ruppiah to go upstairs. The view upstairs is good you can view the jakarta with telescope.",
  "tripadvisor_monas_400": "Might you wonder to come in to Monas (National Monument) Field? The weather is too hot and very crowd with a hundred people. Otherwise, dirty and some corner such like \"private\" property for some people. Well, it is absolutely right. It's like public space in many country Eiffel Tower in Paris or Central Park in New York.However, Monas is...More  ",
  "tripadvisor_monas_401": "It is the place to visit in Jakarta as there is not much to do in Jakarta apart from visiting malls and have a great food Fiesta :) Dont come on Monday to Monas, it is closed.",
  "tripadvisor_monas_402": "Monas is the landmark of Jakarta. That's why it is always visited by many tourists, especially on the weekend and national holiday.There is a museum under the monas. There are many dioramas that tell about the history of Indonesis pre, during, and pasca independece proclamation.We can also go the top of the monas, seeing the view og Jakarta....More  ",
  "tripadvisor_monas_403": "Jakarta icon with the MoNas. Glad to be here at new year 2016. Thousands of people watching the fireworks and the typical ondel2x also there. Nearby bunderan HI and it's car free zone for special occasion \" the new year\" 🎉",
  "tripadvisor_monas_404": "A big national part for local people. This is probably the no.1 must visit place in Jakarta? Tourist can go to TOP to view the city in the day time. Night time the monument becomes more colorful. People normally walk the dog in the part, while here young people bring raccoon to play around. There is a night market beside....More  ",
  "tripadvisor_monas_405": "Only just worth going, long queues to get in because of the eleven person lift, then when you finally get to the top the view is really not that good,all you can see are buildings all around, it's also very very very hot and dusty, maybe go on a rainy day",
  "tripadvisor_monas_406": "There wasn't much to see or do around the monument and lots of tacky souvenirs and really bad knockoff handbags and sunglasses sold here. I wouldn't make a point to go to this monument... very mediocre.",
  "tripadvisor_monas_407": "Every visitors from overseas has not yet being a traveler if they didn't visit this Indonesian landmark.",
  "tripadvisor_monas_408": "In my opinion the place doesnt deserve to go . the place isnt clean and you will dislike the bad smell as you walk to the tower. you can only take pictures with the tower and thats it.",
  "tripadvisor_monas_409": "The place is clean, comfy with many trees, and they have many variety of Indonesia food at the Food court. You can take Shuttle bus to this place for free. Good view from the top of the monument. You can enter the monument, there are many historical pictures, sclupture inside. If you visit jakarta, dont forget to visit this monument,...More  ",
  "tripadvisor_monas_410": "Every visitors from overseas has not yet being a traveler if they didn't visit this Indonesian landmark.",
  "tripadvisor_monas_411": "MONAS is a spectacular national monument just North of Central Jakarta. You can access the site by Train, Bus, Car or Taxi. I have walked to MONAS from Central Jakarta several times during the \"No Car\" period on Sunday mornings. The view from the top is outstanding and well worth the need to queue to get tickets and to get...More  ",
  "tripadvisor_monas_412": "Nobody know it if you tell for the driver, you would like to go to National Monument. You should say Monas. When I went there, long line, more than one hour waiting. Every 4 min 11 guest can go in, on the top may be 10 minutes, after you should wait to go back as well. Funny. But the price...More  ",
  "tripadvisor_monas_413": "Quite big and mammoth structure in the middle of the city with many trees and parks, near to station Gambir. During car free day on Sun many people come for running, cycling and exercise. I have not gone up to Monas yet but will do one day.Can see many color full rickshaw pullers in and around Monas, good experience...More  ",
  "tripadvisor_monas_414": "This public park is getting better as the management now more controlled by the governor office.I remember about five years ago when I visited Monas, it was horrible with lots of garbage. Now Monas is cleaner and friendly.You can bring your family for picnic or just walking around. Some spots here also used for sport activities.I think...More  ",
  "tripadvisor_monas_415": "A monument to the new in Indonesia, free of colonial encumbrances. defines the spirit of Indonesia to a traveller and is truly magnificient",
  "tripadvisor_monas_416": "It is iconic place if you are interested in history and that kind of thing. Relatively clean place and very (very) wide area. Its better come at weekdays afternoon, because at holidays it will crowded and you will take several hours just to queuing for the elevator to the top of Monas",
  "tripadvisor_monas_417": "As Indonesian, I am proud to have Monumen Nasional (Monas) as icon of Jakarta.It is best place to know more about Indonesia history of IndependentYou may enjoy time to take picture indoor or outdoor. Monas is easy to be reached with public transportation. On Sunday or Saturday morning, you may enjoy time for exercise here, jogging or riding...More  ",
  "tripadvisor_monas_418": "It's one of the clean places in Jakarta. I don't want to be an ignorant, but the place didn't made any emotion in me. More interesting was walk along streets where live common...read more ",
  "tripadvisor_monas_419": "It's one of the clean places in Jakarta. I don't want to be an ignorant, but the place didn't made any emotion in me. More interesting was walk along streets where live common citizens.",
  "tripadvisor_monas_420": "The best time to come here is in the evening because u can seat at the grass and see the light of gold in the top of monument, so u can here from evening until morning, u can get here with transjakarta busthats museum near from here it's national Museum",
  "tripadvisor_monas_421": "The monument sits in the middle of a large park with plenty of space and shades - important for the climate there, and a shelter away from the maddening traffic outside. It should be worth going up to take a good view of the city though I did not do that.",
  "tripadvisor_monas_422": "You cant just walk up to see the monument...you go to an area where you can view it from behind bars. On the whole i did not understand if you could pay to get in closer but it seemed hokey to me. There is a market where u can buy tourist junk for cheap but its not nice stuff",
  "tripadvisor_monas_423": "The place is ok to watch. But the place was also very crowded when I was there. The surrounding park is dirty and not well maintained. It's ok to see Monas but it's also ok to skip it.",
  "tripadvisor_monas_424": "A nice monument on the Merdeka square.It looks beautiful with the gold on top.We walked around the park and the little market next to it.The monument also looks beautiful in the evening with all the lights.",
  "tripadvisor_monas_425": "We went there 2 times. In the afternoon and in the evening. Too bad we were just to late to enter. You can go to the top until 3pm. When the sun sets it will light up in different colours. Very beautifull.",
  "tripadvisor_monas_426": "Vast grounds for relaxing & contemplating the history of Indonesia & other parts of Asia. Monument popularity similar to US Statue of Liberty so long lines/wait times to go up.Most educational & colorful dioramas in ground floor atrium",
  "tripadvisor_monas_427": "The National Monument, universally known as MONAS, is in the centre of Jakarta. The view from the top of the tower is not bad, but not marvellous. MONAS has dioramas depicting the Indonesian struggle for freedom -- Merdeka! Oversweas visitors may or may not find the dioramas interesting. MONAS is always crowded. You have two choices: stand in line for...More  ",
  "tripadvisor_monas_428": "I didn't enter the actual monument itself but walked around the huge grounds itself. Statues are dotted around the park which gives it a grand feel but the lack of maintenance and trash around the area diminishes the beauty of the grounds. There is a modern food court at the main entrance past the parking lot - with many tourist...More  ",
  "tripadvisor_monas_429": "Nice grounds approaching the monument, but perhaps needs some signage to indicate how to actually access the monument (go towards the back and use an underground passage). Inside...read more ",
  "tripadvisor_monas_430": "Nice grounds approaching the monument, but perhaps needs some signage to indicate how to actually access the monument (go towards the back and use an underground passage). Inside I felt the dioramas at the bottom outlining Indonesian history were more interesting than the trip to the top — there was a line to take the elevator to the top, and...More  ",
  "tripadvisor_monas_431": "I visited Monas with my friend on Monday..what a pity,it's closed on every Monday..then we can't go to the top of Monas to see the view around Jakarta.",
  "tripadvisor_monas_432": "I was here with some friends from the city and other sites in Indonesia. We were interested to enter the place but the queue was overwhelming that we only make a walk around the area. It wasn't the most clean tourist site I've ever visited but compared with another place in Jakarta, the facility was in a good maintenance.",
  "tripadvisor_monas_433": "It is a nice monument to see and get a picture of. You can go to the top for a few dollars, but the line can be a couple hours. Aside from that, you have the big mosque and cathedral on the East side and the National Museum on the West side. A good place to spend a morning or...More  ",
  "tripadvisor_monas_434": "This is historical place in big open ground and having museum in its basement. I went to this place thrice in 2014 and wanted to go top of that tower, but because of lift technical issue entry was closed. So once i m back to Jakarta will definitely go there.I seen there were less Information maps/guides, confusing to get...More  ",
  "tripadvisor_monas_435": "It was just an ordinary monument. There were several trishaws. We took a ride, it was fun but the horse was smelly.",
  "tripadvisor_monas_436": "You can see this tall monument from afar and maybe all you'll want to do is snap a few photos of it. Alternatively, and making sure you don't go on a Monday when it is closed, you can explore the large park (Merdeka Square) around it, check out the souvenir stalls and museum, and maybe even take a trip to...More  ",
  "tripadvisor_monas_437": "Very good panoramic view of the city from the height of 400+ fts. Don't miss the Indonesian history display at the Lower Ground floor in the complex.",
  "tripadvisor_monas_438": "The outer loop runs just over a mile; whilst you get around 1 km on the inside track. The downsides - running in circles isn't best for your gait, nor mind; the surface can be pretty hard. Harder than tarmac in my view. Not a place you would bank in miles on your weekly long run.",
  "tripadvisor_monas_439": "An early start to our day was well rewarded by being able to go up the National Monument, with only one small lift you could find yourself in a long queue. Having arrived at the top we were able to view some of the finer building of Jakarta including the Presidential Palace & lots moreFrom there to the basement...More  ",
  "tripadvisor_monas_440": "A must see, the National Monument built during the Soekarno era can be found around one of if not the largest green area in the City.Fun tip?The golden 'flame' is apparently...read more ",
  "tripadvisor_monas_441": "This is national monument of Indonesia, located in world second biggest square, Merdeka Square. The national monument of Indonesia famous with this male-female symbol, lingga Yoni in traditional Indonesia folklore. people ussually come to remeber the building of the nation, root of the tradition and culture of bhinneka tunggal ika in Indonesia. in the peak, people can see many sight...More  ",
  "tripadvisor_monas_442": "A must see, the National Monument built during the Soekarno era can be found around one of if not the largest green area in the City.Fun tip?The golden 'flame' is apparently coated with gold and that actually from certain angles resembles the long vibrant hair of a woman - given Soekarnos playboy image and persona.",
  "tripadvisor_monas_443": "Really worth a visit. In a very large park with many small shops selling food and the usual localised t-shirts. You can buy many trinkets and mementos of this place. An open trailer will take you to the entrance which is some distance from the car parking area. No charge. 15000 rupiah to ride up to the viewing platform. Lift...More  ",
  "tripadvisor_monas_444": "National Monument is Located Across the Presidential Palace. The Top of the National Monument is Bronze with the 50 Kg Gold Plated. Mostly the material to build this Monument is Marble from Italy. We can Reach the Top of this monument By Lift and here we can see the scenery of Jakarta. Must Visit Tourist Destination while you are in...More  ",
  "tripadvisor_monas_445": "To learn about the history of Indonesia, one good place would be Monas. There's a lot of information that you can get by visiting the museum underneath the tall structure of Monas. Top off your visit by buying a ticket to the top of the tower and get a 360 degree view of Jakarta.",
  "tripadvisor_monas_446": "The monument complex consists of the garden grounds and the monument itself. It is possible to access to the top but you need to go early, specially during the weekends as the tickets for the top are limited and sell off very fast.Inside the monument, at the lower level there's an exhibition consisting of dioramas representing key events in...More  ",
  "tripadvisor_monas_447": "If you want to know what the truly icon of Jakarta, you have to visit monas at least once. You can use the lift to climb up the monument to see the ambience and scenery of Jakarta. Really beautiful when the weather are not too cloudy.",
  "tripadvisor_monas_448": "We visited only the museum in the underground. There are many displays with facts about the struggle for indepence.At the ticket booth, they can tell you how long is the waiting time to take the lift to the viewing platform.",
  "tripadvisor_monas_449": "unfortunately the toilet smells no good, I saw people lay down on floor, hmm poor with sign of direction and little bit not interesting inside of the monument, but on the top of the monument is quite good, the view is good but the telescope is broken",
  "tripadvisor_monas_450": "It is the countries national monument. It is a sight to see. Though we got there during the day and it was to hot and a lot of walking towards the tower. We were not able to get in and to the top because of the limit crowd so just took pictures then. Àlot of souvenirs to shop around. Not...More  ",
  "tripadvisor_monas_451": "Located at the central of Jakarta, it can be access by public transport or bajaj easily. Very clean place, quite huge if you go from one corner to another. MONAS has 4...read more ",
  "tripadvisor_monas_452": "Located at the central of Jakarta, it can be access by public transport or bajaj easily. Very clean place, quite huge if you go from one corner to another. MONAS has 4 corners/gate. go after 3 pm when the weather is pretty good, u can see many locals jogging around, u can have some brisk walk too. u can climb...More  ",
  "tripadvisor_monas_453": "Monas is located in the center of Jakarta. And you can go there by anything transportation vehicle. Monas is a so awesome place to see a beautiful Jakarta from the Top.",
  "tripadvisor_monas_454": "This is the history! From here, you can see city of Jakarta until the sea if the weather is clear. Especially on the weekend, a lot of people will enjoy this Jakarta landmark.",
  "tripadvisor_monas_455": "There's really not many things you can do here, except for taking pictures, really, pretty much like the \"Merlion\" in Singapore, or the \"Twin Tower\" in KL.",
  "tripadvisor_monas_456": "This is one of the Jakarta attractions that should be visited. You can see the city from the top of the monument.",
  "tripadvisor_monas_457": "Been here long time ago, now Monas has a lot of improvement. Cleaner, more neat and more beautiful unlike before trash was everywhere.Good job to the people who maintain this symbol of Jakarta, main tourist destination in Jakarta. Two thumbs up to the Govt and Central Jakarta city mayor.",
  "tripadvisor_monas_458": "Just walked around the square. It's a large open space with a huge monument, but to call it beautiful.... Didn't bother going inside the monument. The architecture of the buildings around the square was more interesting imho.",
  "tripadvisor_monas_459": "they have a museum downstairs with dioramas about Indo history...good for people watching and not too many foreigners here so they watch you back...i got asked to take selfies with a bunch of random people. View from the top is not too good. We waited an hour for the lift (only 10 go up at a time) and its not...More  ",
  "tripadvisor_monas_460": "Put it on your to visit list when you are in Jakarta. The complex houses a little market, a large park and of course the monument itself. You can go up to the top and get a nice view, the ground floor also has a little museum.",
  "tripadvisor_monas_461": "It is a giant tower with a burning flame on the top. This how President Soekarno honoured the Indonesian people. There is a Museum at the bottom of Monas showing how Indonesia got it`s indepence and also you have to go to the meseum in order to go up to the top of the tower. This is the national monument...More  ",
  "tripadvisor_monas_462": "Nice to look at with fun stalls around but how do you get in to walk up to the actual monument?I couldn't find an entrance! Maybe there isn't a way. Not sure.",
  "tripadvisor_monas_463": "Nice to look at with fun stalls around but how do you get in to walk up to the actual monument?I couldn't find an entrance! Maybe there isn't a way. Not sure.",
  "tripadvisor_monas_464": "A must see location. Great to visit on a weekend as a small market is set up around it. Just across from the National Museum so ensure you see that as well.",
  "tripadvisor_monas_465": "The first time I visited I could not find the entrance to the underground tunnel....so I walked around the park checking out the sculpture. The next time I went with a tour guide we got there early mid week and had the tower to ourselves! ..for a few minutes .... There is only one lift up that carries about 10...More  ",
  "tripadvisor_monas_466": "This park is open from early morning for joggers and people to exercise in. Its a much larger park than Taman Suropati or Taman Menteng. It gets really hot in the afternoon - so the best time to visit is early morning.",
  "tripadvisor_monas_467": "We went there in the evening to watch the fountain display which is well publicised but actually wasn't working. No information was available in advance.We parked up near the Monas but were totally ripped off by random parking Mafia who charged us a fortune (25k) and then put us in a corner against a brick wall then allowed other...More  ",
  "tripadvisor_monas_468": "The place is set out really well. From the dioramas to the top viewing area the place is well set out and highly informative.The view from the top viewing area is quite spectacular and provides a great show of the size of Jakarta.We were fortunate to pick up with a guide who showed us through the place and...More  ",
  "tripadvisor_monas_469": "A beautiful monument, with an amazing diorama that makes following Indonesian history easy for all ages to understand. It can be very busy to try to visit early on a week day,",
  "tripadvisor_monas_470": "This amazng structure is so neat and organised.It manifests Indoneisa freedom spirit. It has a renovated elevator and well managed queues. Gives a very good view from atop of the city",
  "tripadvisor_monas_471": "It's a stunning monument and once you get inside, they have very cool diarama's to illustrate a brief history of Indonesia. The English translation was a very nice touch.",
  "tripadvisor_monas_472": "It took us a while to actually get to the monument as our driver wasn't too sure where the entrance was, he left us on the wrong side so we walked around and had donkey rides offered to us every few hundred yards.When we finally got to the monument we were left slightly disappointed with it.",
  "tripadvisor_monas_473": "A fabulous monument but confusing both to get into the park and the museum itself.Once inside it has English labeling. We didn't make it to the top as on a weekday there was a...read more ",
  "tripadvisor_monas_474": "A fabulous monument but confusing both to get into the park and the museum itself.Once inside it has English labeling. We didn't make it to the top as on a weekday there was a queue of school children waiting to get in.If I'm being honest I'd probably say go in the park and view from afar.",
  "tripadvisor_monas_475": "If you have nothing in your checklist for the evening, this is the place to kill time... You wanna watch people??? You got it!!!",
  "tripadvisor_monas_476": "Went early on a Sunday when the street was free of traffic. Took us a bit to figure out the entry to the tower requires you to go under the road - not clearly signposted! Once underground we were shocked by the queues of people. Somewhat ignorantly we walked down the tunnel without a ticket and were pleasantly surprised to...More  ",
  "tripadvisor_monas_477": "When visit Jakarta Indonesia. MONAS is a attraction place must to be visited.Beautiful place and nice view for photograhic too.The top attraction places such as MONAS, National Museum, Jakarta Cathedral church, Istiqal Mosque..can be reach by City Tour Bus which is free.",
  "tripadvisor_monas_478": "A very, very big monument that is well worth watching, especially after dark when they light it up in all kinds of colors.",
  "tripadvisor_monas_479": "Hmmm, I don't understand the importance of this on the tourist trail honestly. It's a big tower in the middle of the city. If you queue up for what I was told is a long while, you get to climb to the top and see the views. That's about it. I was lucky to face swung by in the evening,...More  ",
  "tripadvisor_monas_480": "The place was meant to be a park for the citizen, so we were meant to walk a whole lot ... through the organized food drink and souvenir lot first, after putting our car in the car park, and diagonally to the underground tunnel. As Indonesians tap water is not drinkable, and they were trying to clean up the area...More  ",
  "tripadvisor_monas_481": "When we visited this monument, we had to line in a very long queue. It took like almost 1,5 hours just to get to front line. after we finally got to the top, we were kind of surprised that there was actually nothing great to see. The top is only a small round with some provided binoculars for us to...More  ",
  "tripadvisor_monas_482": "Thank you to our government, now Monas is more niecer and cleaner as arround Monas is free of the 'kaki lima' because they have given an area next to Monas. Take a free of charge sightseeing double dekker bus from Jl.Sudirman or Pasar Baru or Juanda then walk about 10 to 15 minutes to the Monument...then you can see the...More  ",
  "tripadvisor_monas_483": "Sightseeing in monas area is better either early morning jogging or late afternoon,with many trees surrounding , looking inside to the museum will be better on day time.",
  "tripadvisor_monas_484": "Curious monument in the middle of a big park, good to go walking during the day, but that's all, nothing special",
  "tripadvisor_monas_485": "Curious monument in the middle of a big park, good to go walking during the day, but that's all, nothing special",
  "tripadvisor_monas_486": "Jakarta is a very hot and wet city and only place where you can breath and see all the city in one view is this monument, you can also learn the history of the city and this monument with perfect illusions and demonstations",
  "tripadvisor_monas_487": "An ordinary place to visit, but give a good view of the city indicating various building around it. A good street shopping can be done just outside the boundary.",
  "tripadvisor_monas_488": "Built to celebrate Indonesian independence this monument stands over 130 meters high surrounded by a large park where on the weekends and public holidays you can find many locals having picnics.",
  "tripadvisor_monas_489": "The view from the top of the MONAS is really good, and a huge thumbs-up for the free telescopes. Entrance is really cheap too, so you're not wasting that much money going here.If you can find the entrance to the park you might be in for quite a decent walk, but as soon as you get through the maze...More  ",
  "tripadvisor_monas_490": "You can see Jakarta view from up here, must queue to go up because limited person available each day, inside the monument you can see diorama indonesian history.",
  "tripadvisor_monas_491": "I went there a long way back in 1987 and made a return. The place is cleaner now and have more input on the history of indonesia. A good place for family vacation or just to do picnic outing. Easy to access by transjakarta.",
  "tripadvisor_monas_492": "So beautiful and well designed monument. Just to hot around, few trees and too much concrete.Could have been done much nicer to commemorate this nation.",
  "tripadvisor_monas_493": "The only thing you would visit it is to be un an open and uncrowded place, something that is not easy to find in this city. It is quite rundown, grass is yellow, no signs (trying to find the entrance and exit can be challenging, specially if it us hot, as the place is huge)",
  "tripadvisor_monas_494": "The line for the elevator can be long, no stairs to climb. You need to check out the artwork below the complex. It paints an interesting picture of the history of the independence for Indonesia.",
  "tripadvisor_monas_495": "You can see Jakarta from the above, and you must be patient during queuing as a lot of people during weekend and holidays.",
  "tripadvisor_monas_496": "The icon of jakarta city. Im visit twice and this place are good for picnic and the entrace door quite far .",
  "tripadvisor_monas_497": "We did not visit the monument itself but the surrounding park. Very dry and dusty due to drought. Would be good to have at least 2 gates on opposite sides open. Plenty of police patrolling so safe. Take a walk around the perimeter of the gardens.",
  "tripadvisor_monas_498": "Monas has a very important role for Indonesian. It was built to show the world of our existence during our first president: Ir. Soekarno. The top of this statue are covered by gold.Inside it is a museum where our first flag laid.You can also learn many important historical moment during the independent struggles days.",
  "tripadvisor_monas_499": "You can see Jakarta from the above, and you must be patient during queuing as a lot of people during weekend and holidays.",
  "tripadvisor_monas_500": "Perhaps it holds importance for Indonesians, but I've never found it attractive. Just a big spike in the middle of a park. Big deal. It's not really so tall, so the view (usually obstructed by smog and pollution) is nothing impressive. Historical symbolism of the monument is not clear.",
  "tripadvisor_monas_501": "In my life i've been visited this place over and over and now its getting worse which such a let down for me. This place get crowded by seller whos force me to buy alot of stuff, for sure its easily i can ignore, but its still annoying. The line to the top of the monument its crazy loooong queu,...More  ",
  "tripadvisor_monas_502": "So not waste your time to go there specially as there is really nothing indeed excitingIt's just literally a basic not so tall stoneThere are better stuff to do instead of staring at this a piece of stone although there might be a history behind",
  "tripadvisor_monas_503": "Reference Point in Jakarta. A must see. Beautiful park, which must be visited. Look for a beautiful day. Not recommended in rainy days.",
  "tripadvisor_monas_504": "Monas tower is a must if you visit Jakarta as its the national monument symbolising Indonesias independence. Inside the base is an exhibition charting the emergence of Indonesia and is a good way of learning the history of the country. You can get a lift to the top of the tower but be prepared to queue. Its worth it though.",
  "tripadvisor_monas_505": "at a day in jakarta,it is very nice to go inside in the monas monument.you go with the elavator to the top,and have a nice vieuw at the city,and see nice things so close as well.if you go down again ,you can see a diarama ,of the archipel of indonesia,and the history.than you take a walk to...More  ",
  "tripadvisor_monas_506": "I barely visit this place since I live in Jakarta. The traffic is a little bit insane, especially on the rush hour. But if you gonna take Transjakarta, you may take the 1st...read more ",
  "tripadvisor_monas_507": "I don't get what the draw is. Every cab my friend and I got in offered to take us here, but the monument is entirely underwhelming.",
  "tripadvisor_monas_508": "Gold on the top..Tower and small view from roof top MONAS.History indonesian war with V.O.CAnd park that lot of traditional people sales.",
  "tripadvisor_monas_509": "Thinking of to experience the local activity on weekends?... This will be the place for you to hangout with family and friends... Buying survivors and watching local activity and performance... Should go here whenever you are visiting Jakarta...",
  "tripadvisor_monas_510": "I barely visit this place since I live in Jakarta. The traffic is a little bit insane, especially on the rush hour. But if you gonna take Transjakarta, you may take the 1st corridor (Koridor 1 Blok M - Kota) and take the stop at Halte Monumen Nasional.This place has a huge park. And you will find people hang...More  ",
  "tripadvisor_monas_511": "We've heard there is a Museum inside the monument but both days we arrived too late (it closes at 3pm) but the park surrounding it is nice.It's difficult to find the entrance to the park! We walked round the outside for a good while trying to get in - a sign might be a good investment!Everyone tried to...More  ",
  "tripadvisor_monas_512": "Very interesting to stroll the wide open space and examine various statutes throughout the area. Would have liked to go up the monument, but we were told due to the tiny elevator, one must get here very early to get a good spot in line.",
  "tripadvisor_monas_513": "This is located beside the road hence the access is easy. But it is closed on certain days. Need to check same prior.Nice location .",
  "tripadvisor_monas_514": "I saw the torch with gold on the top of Monas Tower. It is very unique and it has huge yard. I can see little bit area from top of tower. Its cool.",
  "tripadvisor_monas_515": "A interest site to start your tour of Jakarta City, you can have a 360 degrees view of Jakarta City from the observation floor at the top of the tower. The Flame symbolised the struggle for Independence by the Indonesian. There are a number of activities which you can try around the site. Many stall selling souvenirs, foods and drinks....More  ",
  "tripadvisor_monas_516": "I go there with my family. I enjoy the night view bcoz if you can see from the above the jakarta view can very nice.. we can rent bicycle to explore the area. Or just walk and can buy souvenirs from monas in affordable price...",
  "tripadvisor_monas_517": "Because of the lack of old buildings in Jakarta, Monas is worth a visit. Outside in the area you will find some interesting activities and facilities.In the basement you have...read more ",
  "tripadvisor_monas_518": "Because of the lack of old buildings in Jakarta, Monas is worth a visit. Outside in the area you will find some interesting activities and facilities.In the basement you have the opportunity to take a look at Indonesias history which is presented in a nice way with little miniature pictures.but for going on top you need to wait...More  ",
  "tripadvisor_monas_519": "It was a nice place. I liked it.Tip: Pay some extra cash to go past the line to lift.You can buy some good stuff and very low prices",
  "tripadvisor_monas_520": "Monumen Nasional, MONAS for short, is the symbol of the country’s independence. The government has spent years improving this park, among others cleaning the monument, tidying the parking lot, and organizing the vendors. The result is what we see today.I visited here on a Sunday. Many seemed to be out that morning, from jogging, flying kites, dancing competition, and...More  ",
  "tripadvisor_monas_521": "Spend your morning weekend here for jogging and going up to the roof. Just be sure that you go around 10 am to go up there, because the line can be long. And hot.",
  "tripadvisor_monas_522": "A huge park surrounded by trees... A place to spend time with your family or friends in the evening. There are mobile food stalls outside the gates. The great monument is something worth to see. If it is during their opening hours you can go to the top of the monument- you have to purchase tickets.",
  "tripadvisor_monas_523": "Some how we acquired a guide and we were told all the history of Jakarta and how the monument came into being and the independence of Indonesia from the Dutch ..Well worth a visit and finding a guide",
  "tripadvisor_monas_524": "Don't waste your time. It's dirty, uninteresting, host level always closed. The staff and their pushers will try to lure you into bribing them to see the second level without queuing... Not worth it and not fair. Just don't go.",
  "tripadvisor_monas_525": "There is not a lot to see or do in Jakarta. Spending some time here sitting in the grass is OK though.",
  "tripadvisor_monas_526": "Monas these-days is just the icon of Jakarta. nothing more special about it, unfortunately. but still, its the largest park in the hectic city. the gold above does not look (much) shining, not to me. this place really need to be restored properly. nonetheless, we never get bored to take awesome photos of Monas (Monumen Nasional)",
  "tripadvisor_monas_527": "Hard to rate Monash, on one side it offers an amazing insight into the propaganda machine of the suharto era and to the horror that is Indonesian mass nationalistic tourism, on the other it's one of the rare bits of green space in jkt and an icon of its own right. The panoramic displays in the basement showing a falsified...More  ",
  "tripadvisor_monas_528": "Beautifully located near a lovely park, the monument is a must-see. In the basement floor there are displays detailing recent Indonesian history from World War Two onwards. The...read more ",
  "tripadvisor_monas_529": "Beautifully located near a lovely park, the monument is a must-see. In the basement floor there are displays detailing recent Indonesian history from World War Two onwards. The lift takes you to the top of the monument. The views from the top are really nice, with telescopes you can use. Definitely recommend seeing this on a visit to Jakarta.",
  "tripadvisor_monas_530": "Hot, need prepare sunglass or any can cover body to prevent sunburn, even the grass near the monument also dry put, luckily their garden maintenance is ok, therefore u can walk around 3 mins to tree below at the garden.",
  "tripadvisor_monas_531": "I visited the national monument which definitely reflects indonesia independence history, but i think it would have been more interesting if they were some tourist activities around it.",
  "tripadvisor_monas_532": "We were there on a weekday and there was no crowd. It is advisable to take the free motor train from the entrance of the park to Monas itself as it is a huge area to walk. The motor train also had a running commentary on the history and construction of Monas. From the motor train stop , go to...More  ",
  "tripadvisor_monas_533": "Monas is a must visit if you are in Jakarta.I went along with my friend on a Sunday morning and it was really crowded. There is an underground museum which depicts the Indonesian history and freedom movement .To get to the top tower one have to stand in a long queue.There is also lot of street foods around the area...More  ",
  "tripadvisor_monas_534": "First...plan to walk...a LOT! It is a huge area. The sun is hard to escape. If you don't want to walk, ask about a motor \"train\" that can take you to the inner area. You will be confronted by many salespeople selling their \"handmade\" postcards, etc. But the view is nice and you may see school groups, etc enjoying the...More  ",
  "tripadvisor_monas_535": "we spent nearly two and half hours to reach the top national museum is the best place to visit ,we had met smiley and friendly indonesians on the que they are disciplined and friendly and polite in their conversationwe were able to see old and new jayakarta on top entrance fee is not costly,even i saw school children service...More  ",
  "tripadvisor_monas_536": "The atmosphere is simply amazing in the morning .. plenty of open spaces, well maintained gardens and groups of civil servants .. good stress buster in an otherwise congested city",
  "tripadvisor_monas_537": "If visit Jakarta must visit Monas because is one of main highlight of jakarta and IndonesiaI was so impressed",
  "tripadvisor_monas_538": "Interesting monument and actually in decent condition. Not very tourist friendly - as in well marked signs and where to enter complex. Make sure to take a private car as they allow them to drive into complex but they do not allow taxis to enter with tourists??? Overall worth the trip but do not expect a tourist friendly setup like...More  ",
  "tripadvisor_monas_539": "We went there on a Sunday. The place was so crowded that we could not visit the tower. There were a lot of street vendors all around the park.",
  "tripadvisor_monas_540": "We went there on a Sunday. The place was so crowded that we could not visit the tower. There were a lot of street vendors all around the park.",
  "tripadvisor_monas_541": "If you visiting Jakarta, don't forget to hangout in this park who became symbol of Jakarta City.If you stay at hotel located in Sudirman or Gatot Soebroto is better to take Trans Jakarta and than enjoying eat Kerak Telor here",
  "tripadvisor_monas_542": "Good to see the main meeting point for any and all celebrations as well as protests. The central hub of Jakarta",
  "tripadvisor_monas_543": "Monas is a must visit icon in Jakarta.. under the tower lays a museum of diorama on almost every milestone in Indonesia's history. But, to climb up, you must stand in a super long queue in weekends.The entry is rather confusing and definetely not for stroller or wheelchair. Stairs everywhere.Cleanliness must be improved.But if you just want...More  ",
  "tripadvisor_monas_544": "Despite a 10 minute walk from the parking area through a \"market\" to get to the Monument it was worthwhile from the point of view of the Jakarta history display underneath the monument itself. The lift to the top to take in the view holds 11 people, the queue was quite long when we were there so gave it a...More  ",
  "tripadvisor_monas_545": "Taxi and Walk in, Photo shoot only. Little bit of history around. Be careful of people offering additional services. The Horse carts interesting, negotiate they started with 200,000 IDR ended up 20,000 IDR",
  "tripadvisor_monas_546": "Classic monument in the heart of the city, their local people really proud when they talk about this MONASH",
  "tripadvisor_monas_547": "Monas has a lot of activities to offer, from reading a book, horse riding, eating, and even just to walk or jog around it.. This place is also a national symbol, must go if you visit Jakarta",
  "tripadvisor_monas_548": "The national museum is a must when you arrive in Jakarta, the collection is huge and beautiful, you could stay for hours lookng at the different rooms.However, not all elements were explained in English. I found myself sometimes looking at beautiful pieces without knowing exactly what it was or the purpose - there are some guides, but not always...More  ",
  "tripadvisor_monas_549": "Monas is located in the center of Jakarta. You can see the museum and also go to the top of this building. Once you get to the top you will see a magnificent view of the city. You can also go exercise in the Merdeka square.",
  "tripadvisor_monas_550": "It's a historical monument. Nothing great about it, nice to walk around at night with lights. You can miss it if you are just for the 1-2days.",
  "tripadvisor_monas_551": "a great monument at jakarta, you can see nasional museum at the ground floor. dan u can use the elevator to the top to see jakarta from this viee",
  "tripadvisor_monas_552": "A lot of people selling souvenirs. But not a lot of choices though. Beware of those monkey shows, if you took pictures, the owner will ask you for money.",
  "tripadvisor_monas_553": "It's a historical monument. Nothing great about it, nice to walk around at night with lights. You can miss it if you are just for the 1-2days.",
  "tripadvisor_monas_554": "Right in the city of Jakarta is a huge tall towering structure.Its the National Monument called MONAS.elevators took us to the top of the moument from where we could see the entire city around us.since it was bright and sunny,we had a clear view and there is a fee to visit this monument",
  "tripadvisor_monas_555": "The place must be visited while in Jakarta since its historical story behind this monument. In the lower ground there is a museum of Indonesian history. You should go up to the platform area to see the Jakarta's surrounding view. The lift capacity is very limited so in the weekend or holiday season there are a very long queues. I...More  ",
  "tripadvisor_monas_556": "Nice when walking in the night and pass by. Nothing to take a taxi or so to go there because it closes pretty early during the week.",
  "tripadvisor_monas_557": "The landmark needs people who are really looking after it. The toilets were all bad smell and no running water. Rubbish everywhere.",
  "tripadvisor_monas_558": "what a piece of architecture, lots of space around for hundreds of buses. it was quite on the day we went but it can get very busy during school and public holidays. you can see the original document signed on the day of Independence 17th Aug 1945. if you cannt walk too far get the horse and carriage from the...More  ",
  "tripadvisor_monas_559": "The National Monument of Indonesia in the center of a huge square is a must visit when in Jakarta, especially in the night when the lights have been turned on.Great place for a family outing and to enjoy the open air. As with places that attract a lot of people, there are many small vendors selling many different things....More  ",
  "tripadvisor_monas_560": "Nice park surrounding the monument. It was nice to get off the street to a quieter part. Lots of people were sitting on the lawn surrounding the monument. Although beware of the harmless students wanting to take a picture with a strange foreigner. My tall bearded boyfriend got stopped twice by star-struck groups of giggling girls.",
  "tripadvisor_monas_561": "Monas is a great place to hangout when on holiday. You dont have to come here by your own vehicle, you can go here by Transjakarta.",
  "tripadvisor_monas_562": "Monas is a great place to hangout when on holiday. You dont have to come here by your own vehicle, you can go here by Transjakarta.",
  "tripadvisor_monas_563": "A recent visit with guests that love culture really opened my eyes about our National Monument. It was not just about the gold on top, but the history inside the building itself told the story of courage and hardwork. The voices of the Indepence Declaration and the way the made the room underneath the monument was a masterpiece. We also...More  ",
  "tripadvisor_monas_564": "This is the national monument and symbol Jakarta so make sure you go check it out when in Jakarta. It a gaint tower with a burning flame on the top. This how President Soekarno honoured the Indonesian people. There is a Museum at the bottom of Monas showing how Indonesia got it`s indepence and also you have to go to...More  ",
  "tripadvisor_monas_565": "You don't need to make an effort to go inside.After the much effort to come early to get the limited ticket to go to the top, we finally gave up and settled just to go inside.The tickets to go up the top was sold out at 10:30 and the queue to get to the top is horrendous, even...More  ",
  "tripadvisor_monas_566": "Well worth a visit. The museum is excellent and a good way to learn the history of Indonesia.Can be very hot as the is a lot of open space. Take a hat and shades.",
  "tripadvisor_monas_567": "Monas area is bestbplace to do exercise and jog, starting from 05.00 a.m. we could join any group that doing exercise there or we could walk around and feel the fresh air early in the morning. We also could see Jakarta sorrounding area by hike to the top of the candle statue which open at 08.00 a.m.",
  "tripadvisor_monas_568": "Dont have much here, on top of monas you see jakarta view (even most of the time its covered by smoke). The surrounding field can be a nice joggin track. Weekends quite full, with lots of street food seller, careful with the hygiene level. Be careful with your belongings in crowded area too",
  "tripadvisor_monas_569": "I was not happy about Jakarta at all, but this one seemed to be one of few attractions the city could offer. I took a scary bike ride from a stranger to the square and had to walk all along the fence until I finally found smth like a loophole to get into. The monument itself was a mere disappointment....More  ",
  "tripadvisor_monas_570": "when you visit to jakarta, one of mandatory (things to do) for foreigner traveler, built by first president Soekarno, ground chamber (beyond monument) showing chronicle of indonesia heroes struggle to liberate jakarta to be independent from VOC",
  "tripadvisor_monas_571": "Unfortunately, it took a long time for us to find the entrance. In general, there's not much to do as tourist in Jakarta. Visiting MONAS is one these rare things but it is nothing spectacular.",
  "tripadvisor_monas_572": "Wanted to see Jakarta from a great height in all its smog-filled glory. Was not disappointed. Not much to do at the monument itself but got a 360view of the big smoke",
  "tripadvisor_monas_573": "Great Monument with historical value for people of republic Indonesia. Nice view in the night lately",
  "tripadvisor_monas_574": "Wanted to see Jakarta from a great height in all its smog-filled glory. Was not disappointed. Not much to do at the monument itself but got a 360view of the big smoke",
  "tripadvisor_monas_575": "Passing by the city center was the national monument (Monas). I understand that the highest of the monument was pure gold weighed about 500kg (correct me if I am wrong)",
  "tripadvisor_monas_576": "Nice to walk through the wide field of this huge monument of patriotism. There is not much to do here. But it's nice to cross this place if you want to go to the national mosque (masjid istiklal) and walk to the national museum afterwards.",
  "tripadvisor_monas_577": "Its the emblem of indonesia the monas monument situated in the middle of the city. Its just opposite the palace.",
  "tripadvisor_monas_578": "There is nothing here except a large empty space and a monument. It's filled with street vendors who will bother you to the end.",
  "tripadvisor_monas_579": "I was there with my drive who explain to us the history. Nice garden around and I was informed that I will need to pay for enternce. However, I had very busy schaudle during my stay in Jakarta.",
  "tripadvisor_monas_580": "Its a national monument or icon. Almost everyday people in and around metropolitan will filled their day here as an alternative place beside the many ahopping malls. I guess Jakarta have the most shopping compare to other cities in this region.Again nothing much to see except the tower. I will guess if you are staying around the city center...More  ",
  "tripadvisor_monas_581": "1. Have fun hunting for the entrance to the monument! haha2. Go before afternoon (even on a weekday) or be informed that the tickets to go to the top of the structure are sold out.",
  "tripadvisor_monas_582": "This is not for tourists. Its by the train station so if you will use the train to travel the country fine go visit but only worth maybe 5 minutes.",
  "tripadvisor_monas_583": "Had a chance to see this from the outside only. The compound is well maintained and well guarded. The line to get in on the weekend snaked around the monument and would have taken...read more ",
  "tripadvisor_monas_584": "Had a chance to see this from the outside only. The compound is well maintained and well guarded. The line to get in on the weekend snaked around the monument and would have taken 2 hours at least to get to the top so decided against it.Also have been told that the way up is the same as the...More  ",
  "tripadvisor_monas_585": "aside from the beautiful monument, I tried eating various food around the park and you can rent a small motor bike and ride it around the park's area. it was a good experience to visit this park.",
  "tripadvisor_monas_586": "Monas is one of Jakarta's landmarks and is definitely worth a visit at some time. However, in order to get in to the general area, especially on the weekends, is quite difficult as most of the gates are closed and you either have to go all the way around to the other side or do as most locals are doing...More  ",
  "tripadvisor_monas_587": "A good place for jogging in the morning and enjoy sunrise at Jakarta. Hawker is prohibited to enter Monas now. It makes monas clean and safe visitor.",
  "tripadvisor_monas_588": "As previous reviewers have said not as impressive as other countries key monuments. Ie Statue of Liberty or the Eiffel Tower but very important to Indonesia.Shame it closes so early 3pm. Would be good if it so open at night so you could see an aerial view of Jakarta by night.The area around is pleasant and great for...More  ",
  "tripadvisor_monas_589": "Went there, walked in the heat in that great park. I liked the walked but it was closed so never got to see inside and enjoy the view. It looks normal to me but the surrounding is nice.",
  "tripadvisor_monas_590": "It's basically an okay place to sit and relax. On the weekend usually it's crowded with family picnics or couples hiding behind a tree on a date.The monument itself is \"okay\". You can't compare it with the Eiffel Tower but it's close, in its own way. You can get to the top, there's an entrance fee of course, for...More  ",
  "tripadvisor_monas_591": "It is one of Jakarta landmark. The place is good but some people still throw waste everywhere and make area is not clear. National Monument tells how Indonesian people struggling to get independent from Dutch. I love to visit the place during working hour due not many people around the area.I think it is one place must be visited...More  ",
  "tripadvisor_monas_592": "My visit was on Sunday where there were many other visitors as well. I paid 10,000 IDR for the ticket because I chose not to take the elevator. I must pay 15,000 IDR if I want to take the elevator to the top of the tower that lets me see Jakarta larger. Well, as the landmark in Jakarta, at least...More  ",
  "tripadvisor_monas_593": "Jakarta is not one of the great tourist destinations of the world. It does have some wonderful hotels and great restaurants! No as has some very ordinary dioramas in the museum. The view from the top is over a pretty uninspiring city!",
  "tripadvisor_monas_594": "if you wanna see Jakarta from above, enjoy the ambience, taste the traditional food, just come here. However, this place is not supported by adequate facilities such as clean...read more ",
  "tripadvisor_monas_595": "if you wanna see Jakarta from above, enjoy the ambience, taste the traditional food, just come here. However, this place is not supported by adequate facilities such as clean toilet etc.",
  "tripadvisor_monas_596": "Monas is the symbol of the Jakarta such as eiffel tower in Paris so You must visit and take the picture in this place when you come to Jakarta. This place is very large. You can come in the morning for walking or running.",
  "tripadvisor_monas_597": "whats good is the park... in the city like Jakarta!the government need to really have a look on the street vendor around also the garbage in this park..the museum itself need more hand to make it attractive",
  "tripadvisor_monas_598": "To me it is the most important place to see if you are in Jakarta, a nice walk in it with afternoon drinks in the coffee places around or a nice juice will be refreshing.dont miss it if you are around",
  "tripadvisor_monas_599": "The history behind this building is quite interesting. You have a possibility to go up, but due to long lines (up to 2 hours waiting line) didn't went in. Costs only 8000 rp.",
  "tripadvisor_monas_600": "Bussy site where it nice to wander outside and leisure in its surroundings. Inside about the \"Proklamasi\" which is most interasting",
  "tripadvisor_monas_601": "This was a great place to visit on my adventures while living in Jakarta. Almost 3 times the height of nelsons column in Trafalgar Square London. It celebrates the long struggle for indonesian independence which is celebrated every 17th August since 1945. This year 2015 there will be big celebrations as it's the 70th anniversary of indonesian independence. The grounds...More  ",
  "tripadvisor_monas_602": "The Museum was very nice to visit. The displays with small dolls told the story about Indonesia. I think it was a bit glorified, but still a nice way to learn about the historie.",
  "tripadvisor_monas_603": "Going up \"the last emperors erection\" (Lonely planet) you overlook the biggest mosque and the city. As this is one of the few sites in Jakarta, you might wanna do it if you can't escape the city.",
  "tripadvisor_monas_604": "If you are one of those people who find large, open squares lined with ornamental palm trees exciting, National Monument is right up your alley.But if you don't, there's still more.Looking for a great view of Jakarta? This is the place to go. The tower at the center of the park offers a great view of the city....More  ",
  "tripadvisor_monas_605": "The Good place for your trip. You could move on Top of Monas with over view the Jakarta city. Specially for weekend, you will see almost people on the way to walk. That's great...read more ",
  "tripadvisor_monas_606": "The Good place for your trip. You could move on Top of Monas with over view the Jakarta city. Specially for weekend, you will see almost people on the way to walk. That's great for the experience to walk on the wise way with so many persons.Moreover, you could find the Music Night on the weekend in Monas Monument....More  ",
  "tripadvisor_monas_607": "As a must-see monument, it is really worth visiting. Especially, the museum located downstairs which perfectly depicts the Indonesian nation's evolution throughout history.",
  "tripadvisor_monas_608": "Great view if you have the time to Queue for min 2hrs ! Luck was with me I got up the \"express\" lift service and view was stunning right on top ..",
  "tripadvisor_monas_609": "The national monument (MONAS) of the Republic of Indonesia is just one of these places that you need to have seen in person with your own eyes when you visit Jakarta or even pass by it everyday when you live here on the wat to work. It used to be an adventure in terms of Security but Pak Ahok (Governor)...More  ",
  "tripadvisor_monas_610": "People called it Monas, it a must visit palace to do quick study of the Indonesia's historic independence struggle. The dioramas inside the Cawan are extensive and well maintained.However lack of signage on how to enter Monas is really confusing, even for Indonesian native.The 45 minutes queue to the top is quite annoying but its worth the view...More  ",
  "tripadvisor_monas_611": "The 132 meters tall monument was the highlight for me to choose to travel to Jakarta. From the top of MONAS I can see the whole city of Jakarta. It was really awesome experience for me. If you want to get to the top of MONAS, you need to pay about Rs15000 entrance fee. I consider it is cheap. Really...More  ",
  "tripadvisor_monas_612": "The National Monument (Indonesian: Monumen Nasional, abbreviated Monas) is a 132 m (433ft) tower in the centre of Merdeka Square, Central Jakarta, symbolizing the fight for Indonesia. It is the national monument of the Republic of Indonesia, built to commemorate the struggle for Indonesian independence.Construction began in 1961 under the direction of President Soekarno. Monas was opened to the...More  ",
  "tripadvisor_monas_613": "The MONAS is situated at the park where you can see local's activity and there's flee market nearby MONAS.",
  "tripadvisor_monas_614": "The day we decided to go to the top was hot and windless. We had to wait for 40 minuets before taking to small cramped lift to the top. Jakarta in the smog did not look appealing from on high and the viewing area is enclosed in a cage which makes the experience more claustrophobic instead of feeling on top...More  ",
  "tripadvisor_monas_615": "not much to say but I like to go there for a walk and see the people of Jakarta in activity there.Of course pictures is good there. I recommend to take a ride with the horse for something different go there early morning to avoid too many people.",
  "tripadvisor_monas_616": "Since Jakarta don't provide sooo many attractive sights this is one of those which are worth of a visit. The best way is to take a private guided tour, which is affordable and you...read more ",
  "tripadvisor_monas_617": "Since Jakarta don't provide sooo many attractive sights this is one of those which are worth of a visit. The best way is to take a private guided tour, which is affordable and you can see all the major attractions with an explanation.",
  "tripadvisor_monas_618": "The national monument looks quite impressive from the ground, but thats it. If you want to have a good view over Jakarta, you should go for one of the several rooftop bars. Be prepared to stay in queue for 1-3 hours, depending which day and time you come there. The lift only takes up to 10 people and there are...More  ",
  "tripadvisor_monas_619": "National Momument or \"Monas\", as they call in Indonesia, is located in Jakarta. I went there at night because you can see it with different changing lights. It is definitely a worthy trip. There are also flee market nearby (Lenggang Jakarta).",
  "tripadvisor_monas_620": "Worth seeing but beware of the heat in the huge open square. Didn’t go up the tower as queue was far too long at 8.30am (!) but enjoyed the view from the north of the square with the skyscrapers of the main CBD in the background. Free access to the park and you can get in at each corner of...More  ",
  "tripadvisor_monas_621": "It looks good from far but the cost for a taxi to take you there $10 ($100,000) roughly and then to return or go somewhere else its not worth the 2 minutes of enjoyment.",
  "tripadvisor_monas_622": "An interesting place of Indonesia's history but it has to be renewed. The Monas top tower is difficult to get and sometime requires hours of waiting. You can find in the basement here a presentation of the indonesian history and You can get a good feel of the Indonesian's Dutch times and also the Japanese occupation.The place is huge...More  ",
  "tripadvisor_monas_623": "I went there on a car-free Sunday morning. There was a lot of people around this place, picnicking, taking photographs, playing kites, and even roller-skating. It's definitely one of the best place and the best time (car-free Sunday morning) to interact with the locals. However, I think that the hygiene in this place should be improved, still could see a...More  ",
  "tripadvisor_monas_624": "Go before noon, otherwise the museum my be found shut. If you're lucky will be able to go to the top of the monument (but not many people get lucky). A gigantuc structure to remind you to remind you of the freedom struggle.",
  "tripadvisor_monas_625": "You can find inside here a diorama of the indonesian history and get a good grip about the Indonesian perception of the Dutch times but also the Japanese occupation.Well spent time and entrance fee.",
  "tripadvisor_monas_626": "The right place to end the \" car free day \" where we can enjoy breakfast in the spacious garden.It is rather difficult to get a parking spot when we take a car, transjakarta is the best choice for getting there.",
  "tripadvisor_monas_627": "Good place to visit if you go to Jakarta, may need to come early to avoid hot weather in the afternoon. There may be a long queue if you come during school vacation. Good museum...read more ",
  "tripadvisor_monas_628": "An interesting account of Indonesia's history but could be updated. Observation tower is either never open or hours of waiting.",
  "tripadvisor_monas_629": "This place is the icon of Jakarta, the Monas was build since 1st President but finished later by the 2nd.The place is huge and located in central of Jakarta. The entrance were so cheap which makes everyone can enter and the holiday spot for anyone. Unfortunately, many of the facility were in poor condition, especially the toilet.Many people...More  ",
  "tripadvisor_monas_630": "Good place to visit if you go to Jakarta, may need to come early to avoid hot weather in the afternoon. There may be a long queue if you come during school vacation. Good museum to visit to learn Indonesia in 30 minutes. Good view from the top but the elevator has limited capacity (11 people per trip), be patient...More  ",
  "tripadvisor_monas_631": "We took the horse and cart round to the entrance (make sure you get them to show you the notes of how much it would be before getting on, the price was doubled at the end of the journey because there were two of us....) because we got to the gates near gambir bus station which were locked. nice sightseeing...More  ",
  "tripadvisor_monas_632": "Towering above Merdeka Square, this marble monument is Jakarta's principal landmark. But what can one say? It's tall, and not too interesting. Our guide drove us by it, but even he didn't think it worthy of a stop. So we snapped a few photos from the car window. I also notice that Lonely Planet does not give it much ink...More  ",
  "tripadvisor_monas_633": "back home, in manila, most particularly in quezon city, we have something like this, we call it QC Circle or Quezon City Circle .. so it wasn't that appealing to me anymore .. i only had a brief stay in jakarta and got few place to visit",
  "tripadvisor_monas_634": "The best time to go would be on Sunday, when the major road leading to it is declared a car free road. A lot of walkers, jiggers and bikers would be plying the road starting early morning, and the mood is festive, specially in certain points where people rest and street vendors abound",
  "tripadvisor_monas_635": "MONAS ( abbreviation of Monumen Nasional, Indonesian language ).that means National Monument, a great creation of Indonesia's founding father, who also the first President of the republic of Indonesia, Mr. SOEKARNO, which become an icon of Jakarta, the capital city",
  "tripadvisor_monas_636": "Just Beside Gambir Train Station. Nice walk at evening. Cycling in the Park, and Parking area can see horse pushcart.",
  "tripadvisor_monas_637": "Cheap to visit, particularly if you take a student card.The museum inside it is semi decent, covers a brief overview of Java history.The view from the top isn't worth it-very smoggy and no signs informing you what the buildings are.Long wait for the elevator, even when not peak season.Drinks are available for purchase insude",
  "tripadvisor_monas_638": "This is an nice structure in the middle of Jakarta City in Indonesia. This is the National Monument of the country. Being a structural engineer, I had a different perspective of...read more ",
  "tripadvisor_monas_639": "This is an nice structure in the middle of Jakarta City in Indonesia. This is the National Monument of the country. Being a structural engineer, I had a different perspective of looking at it in addition to a traveller's outlook. We had spent about an hour at this location during our City tour of Jakarta and was able to take...More  ",
  "tripadvisor_monas_640": "It is one of Indonesian icon.If you are interested with the history of the country,then visiting this place is a must.Bring a long a hat,water and sunscreen given that it can be very hot for you.Should you wish to view Jakarta from the top of MONAS,avoid public holidays and weekends unless you don't mind to stand in the line for...More  ",
  "tripadvisor_monas_641": "This is one of those, just because it's sounds great doesn't mean it worth going to see things.I suggest that you appreciate it from afar as up close its not as impressive an experience",
  "tripadvisor_monas_642": "dont go on weekends, it can be super crowded.Go in the afternoon when it is a bit chillTake the lift to go up so you can see a panoramic view of the cityTheres nothing unique about it to be honest, and you can see it from afar",
  "tripadvisor_monas_643": "Just like any city landmark...tall, slim and wide based. We didn't stop as we make our turn. It's in the heart of Jakarta City.",
  "tripadvisor_monas_644": "Sorry for my title but I m going to be honest and share my ordeal. This place is super huge, just by looking at the picture you can't imagine how big it is but I didn't really find many tourist around this area rather more Indonesia people maybe from other parts of the country trying to enjoy their monument. To...More  ",
  "tripadvisor_monas_645": "I have been in so many towers all over the world and this is one of the worst. Not just because it's not really high but because the city is SO POLLUTED that u can't see anything. JUST SMOG EVERYWHERE. Even the closest buildings are not clearly visible. Same situation during the night.Go there just because it's really really...More  ",
  "tripadvisor_monas_646": "Place full of activities and crowded. Beware of Pickpockets.In lower house, it has a gallery of Indonesia First President periodfrom installation to hand of power",
  "tripadvisor_monas_647": "I visited MONAS with family, school friends, friends as well as foreign tourists. I'd say if you're visiting Indonesia and find yourself in Jakarta - the place you'd probably avoid but then you've to catch your flight from Cengkareng airport - well, you must not miss visiting MONAS!You will see some history and of course crowds, try not to...More  ",
  "tripadvisor_monas_648": "As an Indonesian I love seeing the Monas whenever I drive by it. While my boyfriend from the Philippines visited we decided to check it out. It was confusing trying to make our way into the Monas compound (entrances are not clear), and the actual monument is quite the long walk from the park entrance (with little to no shade)....More  ",
  "tripadvisor_monas_649": "when you come to monas, you can go to the top of monas by lift, i have 2 warning you guys not to go on holiday or there will be long queque 2 reach top monas, alternatively you...read more ",
  "tripadvisor_monas_650": "when you come to monas, you can go to the top of monas by lift, i have 2 warning you guys not to go on holiday or there will be long queque 2 reach top monas, alternatively you can go inside of bottom monas, where you will see the history of indonesian from 1600 until now, you will be charged...More  ",
  "tripadvisor_monas_651": "Did not stand in line to enter or go to the top bit did pass by at various times if the day - quite a site - lit up at night,",
  "tripadvisor_monas_652": "Huge monument in center Jakarta.Great space to bring your family and kids. You have trees, grass and shadows so ou can relax.There's little shops with all kind of gifts, drinks and food.The monument closes early so go in the morning.The last time there was a 3 hour cue to go to the top of the monument....More  ",
  "tripadvisor_monas_653": "Inside the museum there is a golden map showing Indonesia. Well, the whole of Borneo belongs suddenly to Indonesia (what about Brunei and Malaysia?). So does the whole island of Timor (what about Timor Leste?). People write here that this is a good place to learn something about the history of Indonesia...no, it is not. It is a distorted view...More  ",
  "tripadvisor_monas_654": "Went there on a hot day and as expected, had several vendors try to sell what they had. Didn't visit the museum or go up the monument so I can't say if it was worth it. Be prepared to walk a lot. Probably won't go back as there seems to be nothing special here.",
  "tripadvisor_monas_655": "I went there with my wife, fantastic experience and because I'm European people wanted a photo so was a bit like being a celeb. There is very interesting history in the base of the tower too, about Indonesia of course, the tour guide was very friendly and funny, I even made a film and put it on my YouTube channel,...More  ",
  "tripadvisor_monas_656": "the entrance fee to the top of the tower is cheap, so do not miss it. it's a great place to buy souvenirs, and be sure to haggle! it's the place where locals come in the morning/ night to enjoy their stroll and view of the night here. there's bicycle to rent, train shuttle inside the park, basketball courts and...More  ",
  "tripadvisor_monas_657": "This is another good sightseeing point to visit, but remember to drink more water and put the sun block if you don't want to get sunburn during daytime visit because the weather is very hot, or you can visit at night as well it also very nice view as well.",
  "tripadvisor_monas_658": "Went here to see more of Jakarta. You do need to visit the National Monument. We got there.. it was quite crowded in the area, streets vendors, art performance... kid in a mini motorcycle with out any safety speeding around the monument.Even at some point where we were taking selfies... local tourist come up to us, ans would like...More  ",
  "tripadvisor_monas_659": "If you happen to visit Jakarta or just transit....Take a day to visit MONAS among other Historic national structures. It's located at the Center of Menteng, area of Embassies (Vietnam, Japan, American, others) It's a big park that you can walk around, you might find a gentleman that comes on a daily basis from another town by train, Bandung to...More  ",
  "tripadvisor_monas_660": "The most excite me visiting Monumen Nasional is the people's activity. So many traditional culture in a modern city. You should wear big hat and lots of sunscreen. Don't forget to...read more ",
  "tripadvisor_monas_661": "The most excite me visiting Monumen Nasional is the people's activity. So many traditional culture in a modern city. You should wear big hat and lots of sunscreen. Don't forget to ride \"Dokar\" is an Indonesian traditional vehicle.",
  "tripadvisor_monas_662": "The first time I visited this place was way back in 1986 with my young niece. This time I came back with my family and a couple of foreign friends, to introduce them to one of the famous landmarks in Jakarta. It was a Sunday and we arrived just before noon so when we arrived, the booth for ticket to...More  ",
  "tripadvisor_monas_663": "You can't visit Jakarta without taking a trip to the National Monument and paying 5000 rupiah to get into the museum downstairs. First time visitors to Indonesia will learn so much history than they would in Bali",
  "tripadvisor_monas_664": "this is the very central point of Jakarta. it was built under the control by the very first President of the country, HE. Soekarno. One awesome achievement in the era.While in other countries, park like this would serve visitors freely without surrounding gates, Monas is different. The gates are there to comfort and protect visitors from unwanted situations. It...More  ",
  "tripadvisor_monas_665": "The tower is so strong when thunder rain was coming through and keep steady reach the sky that dark brought heavy rain.after rainy day run out the tower is still the same stand on the ground with proud almost seem nothing happen with the rain",
  "tripadvisor_monas_666": "There is a small gallery at the foot of the tower telling about part of Indonesia's History.I believe there is way to get to the top with a mediocre fee. I wasn't able to check it out because of the on-going local rally around the area.",
  "tripadvisor_monas_667": "I came very early in the morning, So the weather is still so good, there's a bike rental everywhere, so you can take the bike to see the view surrounding this place, buuttt, not so long after that, there will be alot of people from everywhere, So the situation is completely different, so crowded, if you come here with children,...More  ",
  "tripadvisor_monas_668": "If you visit Indonesia,do not forget visit capital of Indonesia, Jakarta. Jakarta have symbol MONAS means National Monument. Location Near from Gambir Station where if you will visit other town in Java by Train and if you have time better visit MONAS. There is schedule if you will go to on the top. At roof top you can see around...More  ",
  "tripadvisor_monas_669": "It's the tallest building in the area which of course gives the best view. The museum downstairs is a nice little addition, but is most likely biased. Didn't take long to queue and get to the top and wasn't crowded.",
  "tripadvisor_monas_670": "To commemorate and preserve the greatness of the Indonesian struggle known as the Revolutionary People's Liberation Indonesia August 17, 1945 and to inspire patriotism and spirit of the present generation and future generations, then built a memorial monument came to be known as the National Monument (Monas) in the year 1959 is located in the city center and is located...More  ",
  "tripadvisor_monas_671": "The first place that we have to visit if we go to jakarta is national monument (monas). I went to monas on sunday morning april 12 2015. The ticket that we must pay is. : Rp 5.000...read more ",
  "tripadvisor_monas_672": "The first place that we have to visit if we go to jakarta is national monument (monas). I went to monas on sunday morning april 12 2015. The ticket that we must pay is. : Rp 5.000 for adult, Rp 3.000 for college student and Rp. 2.000 for child. There were many people walk around there and most of them...More  ",
  "tripadvisor_monas_673": "You can get a nice view from atop, after visiting the miniature galleries explaining the history of Indonesia. There are also 3D historical frescoes on the outer walls in the park",
  "tripadvisor_monas_674": "this is one of Indonesia pride. You can try some food here such as \"kerak telor\" which is only food you can find here or you have to wait 'till July in Jakarta Fair Celebration but one thing need to be noted is ALWAYS ASK THE PRICE for everything you eat here :)",
  "tripadvisor_monas_675": "I visited National Monument when Indonesia' Independence month. At that time,the monument was so good with art touch. It covered by colorful light that changed time by time. But what i liked most was the moment when every family got together play or just talked each other. There were lots of pedagangs. I enjoyed the Kerak Telor at first time...More  ",
  "tripadvisor_monas_676": "It was a public holiday when I went, so the crowds were enromous. Another tall monument that you should probably have in your picture collection if you go to Jakarta, but really not a necessity",
  "tripadvisor_monas_677": "The area look big but was so quite with less visitors only. We saw a lot statue from every city that Indonesia had in the past. So amazing to know how they made it. In this museum we know languages, island, ethnic group which Indonesia has. Also some stories about how people live in the island. How they dress up....More  ",
  "tripadvisor_monas_678": "To enter the monument you have to come away from it a bit, toward all the market stalls etc and go down into a kind of underground complex (you don't just walk straight up to it).When you buy a ticket you walk under the concourse outside the monument and come up from below.Beneath the monument is a very...More  ",
  "tripadvisor_monas_679": "We visited the Monas on a lovely, fine, weekday. It was a pleasant walk through the park, which was well maintained.There was nothing spectacular about the monument itself. However, given its height and its location in an open field, one can see the Monas pretty much anywhere in Jakarta.When we reached the bottom of the monument, there weren't...More  ",
  "tripadvisor_monas_680": "We visited the MONAS on a public holiday and noted that there was a huge crowd in the locality.The que for the lift was miles long and sad to see that there is only one lift to climb the top.The place is very peaceful and kids can run around safely.you can by soft drinks and local snacke at a lesser...More  ",
  "tripadvisor_monas_681": "The museum down stairs is nice and informative. If you want to go upstairs to the top of the Monas you need to be early. Or pay the security a little bit extra to skip the cue. (Which is actually not quite good). If you are going to late and it is really busy, than you have the chance that...More  "
}