{"tripadvisor_monas_0":"just in front of catholic catedral, istiqlal mosque is a symbol of tolerance. don't go there in the friday because it is praying day for moslem. the architecture is nice. easy to...read more ","tripadvisor_monas_1":"just in front of catholic catedral, istiqlal mosque is a symbol of tolerance. don't go there in the friday because it is praying day for moslem. the architecture is nice. easy to access because there is transjakarta shelter in front of it","tripadvisor_monas_2":"We had a wonderful time on the tour of the Grand Mosque. Our tour guide was an impressive young man full of historical knowledge of the mosque. The views inside the mosque are awe-inspiring. This was one of the highlights of my stay in Jakarta.","tripadvisor_monas_3":"We were privileged to have visited this beautiful mosque on the day of Eid Al Adha in September 2016. The crowds from all over Indonesia gathered in this mosque on that day for the Eid prayers and it looked as if we were in Makkah.","tripadvisor_monas_4":"Must Visit in Jakarta.Very calm and peaceful.Very much in city & in drivable distance . should visit if you are in jakarta","tripadvisor_monas_5":"It is an old but nicely maintained mosque. It must be included in the must visit places in Jakarta. Most of the structures in Indonesia are well kept with beautiful surroundings.","tripadvisor_monas_6":"Magnificent mosque with a lot of space for worship, many events of worship for Muslims, ample parking spaces, the door is always open,They are in it always feels cool, even though none of the air conditioner in itStructure of grand buildings and luxury, not outdated","tripadvisor_monas_7":"I was interested in visiting this mosque after the one in Abu Dhabi. There are specific rules where non-Muslims are not allowed in some places of the mosque but it was worth the experience. Muslims who were on the floor below and came by buses were disrespectful of the place than non-Muslims even during prayer recitations. Maybe it's my lack...More  ","tripadvisor_monas_8":"This Mosque had a lot of story for famous Islamic Mufti Arrival, so many mufti came here to teach islam. This is the iconic a peace social life religion in Jakarta, because there is a Oldest Cathedral in front of Istiqlal.But, plenty of rubbish and beggar found here. Perhaps, MUI may guards this mosque to clean from beggar as...More  ","tripadvisor_monas_9":"Came w 2 kids 6+8 as visiting christian. Recieved 5 min nice lecture, but not as earlier reported a tour. Very interesting and sparked interesting discussions in the family on religion and lifestyle.","tripadvisor_monas_10":"if you are an architecture and culture enthusiast, this religious spot is the place you have to go. You should wear a proper cloth that covers your body properly. For women, you'd better bring along your scarf or pasmina if you have any. No short pants, no mini skirts, no sleeveless shirts/t-shirts. But if you think you wear unproperly when...More  ","tripadvisor_monas_11":"Dress appropriately and enter the mosque. It is one of the country's landmark and the biggest in ASEAN. A must see landmark.","tripadvisor_monas_12":"Dress appropriately and enter the mosque. It is one of the country's landmark and the biggest in ASEAN. A must see landmark.","tripadvisor_monas_13":"It was a nice trip to see one of the biggest mosque in the world ( biggest in south east Asia ), you can have a guide to explain the hystori and everything you see inside. I suggest this or it would just be a roaming inside a big building.","tripadvisor_monas_14":"Very big mosque in central Jakarta.This mosque can fit thousands of people.You will find a huge carpet all over the prayer place, Alcuran books and tv screens.This is a place where you can chill with your loved ones in peace.Very good vibes in this place.At the entrance you have a spot where you can drop...More  ","tripadvisor_monas_15":"Being an American I was a little unsure of visiting this place because of our foreign perception ... But I met a guide/worker there who had a official lanyard and he showed me the whole place and explained all the different areas and history. Was super mind blowing... Definitely recommend, of course the guide didn't want to talk cash until...More  ","tripadvisor_monas_16":"Popped in for a quick look round - if anything just going for a look at the dome inside is worth it. They supply you with robes should you need to cover your shoulders and knees and for a donation of your choice. Definitely make a stop here if you have time!","tripadvisor_monas_17":"The mosque was really huge , i pray maghrib therefor me this is the third largest mosque after makkah and madina may be","tripadvisor_monas_18":"Really impressive architecture! This is the largest mosque in South East Asia. Make sure you wear proper clothes if you want to visit this mosque.","tripadvisor_monas_19":"this is a unique mosque designed by the catholic architect, it is and old built mosque by the late 70, the greatness of the size making this mosque grande","tripadvisor_monas_20":"If you visit Jakarta, you have to come to this mosque. It's very monumental. It's symbol of majority's tolerance. Parking area is large. You can access by many kind of public transportation. There is commuter line station near the mosque. There is busway shelter in the front of mosque. The carpet of mosque was very smooth and you can lay...More  ","tripadvisor_monas_21":"Closed after 10.00 pm but on Friday open 24 hours. There were several food stall nearby. You can also take free tour bus city in front of Masjid.","tripadvisor_monas_22":"One of Frederich Silaban's masterpiece in Jakarta, which also being one of iconic building in Jakarta. A stiff structures which letting the public to mingle around this building...read more ","tripadvisor_monas_23":"The guide said that this is the third biggest mosque in a world, after Meka and Medina. Did some research, it's forth biggest. He was full of information, I guess they were correct. Then he came up with story about Obama and even took a picture of me at the same spot where Obama was. Irrelevant for me. I came...More  ","tripadvisor_monas_24":"The mosque emerges in its full grandeur as you enter it..look up at the magnificently ornamented dome and wonder at the majestic inscriptions circling it. It gets more glamorous at night with the lights on... The prayer hall is immense, with separate spaces for men and women. You'd need to be dressed properly to enter and if needed, you can...More  ","tripadvisor_monas_25":"One of Frederich Silaban's masterpiece in Jakarta, which also being one of iconic building in Jakarta. A stiff structures which letting the public to mingle around this building, whether they're praying or just taking some rest.I like the feel of history created by the ambiance (some old wall features and interior materials), but surrounded by modern-yet-rushed atmosphere of the...More  ","tripadvisor_monas_26":"We visited as part of a tour with Adventure Indonesia. It was an honour to be allowed to see inside the mosque, especially during prayers. They supply appropriate clothing to wear and our guide explained a lot to us about the customers and how the Muslims in Indonesia marry their beliefs with practising Islam. It is directly opposite the Catholic...More  ","tripadvisor_monas_27":"I've never been there, but many people said that this mosque must be visited for all religions, but if you're not muslim then you only can enter in the limits that have been written.","tripadvisor_monas_28":"So my fiancé & I went to visit the cathedral across the road and it was beautiful, nice people inside and very peaceful. Now just to clarify we're not biased, we're both Atheist. But we're traveling so it's nice to see the local religious buildings ok. So anyway, onto the mosque we go. Take shoes off which isn't a problem,...More  ","tripadvisor_monas_29":"Interesting and pretty. Too much walking. Bigger than the blue mosque in Istanbul. Employees are friendly and helpful but expect to be tipped.","tripadvisor_monas_30":"This place is awesomely huge in sense of Spatial quality and physical quality. Designed to have natural ventilation is a great approach by the Principal Architect. The religious atmosphere is well built in this space enhanced with the high ceiling. And surprisingly the architect for this Mosque Design was not a Moslem.","tripadvisor_monas_31":"We visited Jakarta a couple of months ago and had a chance to see this magnificent large mosque in Jakarta.","tripadvisor_monas_32":"Like to see history of the counties I visit and this was a good option...different than the one in Abu Dhabi though.","tripadvisor_monas_33":"This is a really impressive building and definitely worth a visit. We dressed appropriately but saw some other visitors who had borrowed robes to wear over their own clothes, to...read more ","tripadvisor_monas_34":"Went for Jum'at praying with friends and cannot stop being amazed. Feeling so grateful to experience this best historically venue.","tripadvisor_monas_35":"The mosque, which is the largest in South East Asia stands alongside a Church and is open to people to all faiths provided they dress modestly when entering the mosque . The mosque is less than 1.8 km by foot from Monas and is even accessible by Transjakarta Bus or Taxi","tripadvisor_monas_36":"We had really short visit to the mosque but it was worth a visit for sure. The mosque is walkable distance from MONAS tower(< 1 km).","tripadvisor_monas_37":"Astonishing place. I loved it and was amazed that there was no mandatory separation of men and women! Conveniently located right across the street from Gereja Cathedral build by the Dutch and close to Mona--the main square and monument to independence--both worth visiting. I went twice to Istiqlal Mosque, first alone and am so glad I went back with my...More  ","tripadvisor_monas_38":"This mosque always gets lots of visitors, either to pray or just to admire the architecture. It was visited by President Obama in his visit in 2010.","tripadvisor_monas_39":"very comfortable to pray here..close to shopping market and easy by public transportation and also nearby China town","tripadvisor_monas_40":"This is a really impressive building and definitely worth a visit. We dressed appropriately but saw some other visitors who had borrowed robes to wear over their own clothes, to cover their legs and arms. As soon as we entered we were greeted by a guide and taken on a tour of the building. Our guide was very knowledgeable giving...More  ","tripadvisor_monas_41":"Istiqlal Mosque, or Masjid Istiqlal, (Independence Mosque) in Jakarta, Indonesia is the largest mosque in Southeast Asia.This national mosque of Indonesia was built to commemorate Indonesian independence and named \"Istiqlal\", an Arabic word for \"independence\". The mosque was opened to the public 22 February 1978. Within Jakarta, the mosque is positioned next to Merdeka Square and the Jakarta Cathedral....More  ","tripadvisor_monas_42":"Was a pretty sight at night with the lights on. Not much information readily available for tourists.","tripadvisor_monas_43":"Istiqlal is known to be the biggest masjid in South East Asia.Getting from the wash room to the main prayer room could take a while. So, better you arrive early if your planning to do prayer there.The scale of its main prayer room is huge, it could fit thousands of worshippers. Large pillars supports itu dome structure.A...More  ","tripadvisor_monas_44":"A beautifull mosque displaying the beauty of indonesia culture along with its sting faith I religion","tripadvisor_monas_45":"A beautifull mosque displaying the beauty of indonesia culture along with its sting faith I religion","tripadvisor_monas_46":"The exterior view not as attractive as the interior view. There are really a huge space for pray. I like the the Ibterior of the mosque.","tripadvisor_monas_47":"The biggest mosque in the world after Mekka and Medina can only be an amazing architecture. You have a free tour if you ask for it and you'll love it ;)","tripadvisor_monas_48":"They tell you that the mosque is free to visit. Once you are inside, all tourists are sent to a guest room to take off their shoes. In this room, you are told by the representative of the mosque that you need to make a donation in order to see the mosque. I offered 5000 in Indonesia currency and was...More  ","tripadvisor_monas_49":"I went there for itikaf in the month of Ramadhan with friends and we like the historical place for praying. It is so city central hundreds of people came till morning for the itikaf.","tripadvisor_monas_50":"It is worth a visit but very plain with lots of marble and steel. Kids running around so it can be quite lively. It was designed by a Protestant who won the competition and it is worth an hour visit but a little stark. We had a guided tour and it was a little over the top in info. Nice...More  ","tripadvisor_monas_51":"One of the most grand Mosque in Indonesia, Istiqlal will surely mesmerized anyone who prays in this Mosque. The Official Mosque for Moslem's big day Eid ul-Fitr and a must visit for Moslem travelers to Jakarta. Erected right across from the grand Chatedral in Jakarta, showed us how diverse Indonesia is in terms of religion tolerance.","tripadvisor_monas_52":"it is an amazing place , it such a great experience to visit and pray in the greatest mosque in South East Asia.it is a one of the symbol of the largest Muslim population in the world !","tripadvisor_monas_53":"We visited the mosque with a small group and were amazed by how large it was. The symmetry was inspiring and very different to any mosque I had seen before. You felt a strong sense of relaxation within. The people there were helpful and kindly lent items of clothing if you were unprepared for the clothing rules. The design of...More  ","tripadvisor_monas_54":"One of the iconic mosques of Southeast Asia is the Istiqlal mosque of Jakarta. It was built to commemorate Indonesia’s independence & started functioning from February,1978.It is one of the largest mosques of the world with a capacity of around 200,000 people. It is one of the most impressive place to visit in Jakarta. The river Ciliwung flows across the...More  ","tripadvisor_monas_55":"Been here for pray with family. Huge mosque and nice architecture. Don't forget to bring own plastic bag to keep your shoes :) if not, can buy from the seller there.","tripadvisor_monas_56":"I have never been inside a mosque before so this visit is quite special. From the National Museum, you can take one of the free city tour bus which will take u straight to Masjid Istiqlal.Entrance is free. It might be a bit confusing at first which entry to take as tourist should enter by the side entrance facing...More  ","tripadvisor_monas_57":"No matter your religion, this is definitely the place to search for tranquility and serenity.Went here a couple times and always mesmerized by the archictecture.","tripadvisor_monas_58":"This mosque is for people of all faith to come and see how beautiful it is. Its the largest in South East Asia.There is a separate place to keep shoes and wear the overcoat to cover legs. The inside of the mosque is grand with carpets from overseas. Each minaret, pillar and decoration has a significant meaning which makes the...More  ","tripadvisor_monas_59":"Been here for pray with family. Huge mosque and nice architecture. Don't forget to bring own plastic bag to keep your shoes :) if not, can buy from the seller there.","tripadvisor_monas_60":"Istiqlal mosque is undoubtedly one of the best mosques in the world. With a capacity of close to 200,000 people at peak times, Istiqlal mosque is often very busy especially during Jummah prayers and you should come earlier if you want to space in the main hall. Also, rather differently to other mosques, say in the Middle East, the during...More  ","tripadvisor_monas_61":"This is the perfect place to visit. All westerners should see this if for nothing else, to have a better understanding of Islam. The mere size of the place is impressive! It is big! Guests are given a tour by a guide who does a great job of describing the religion, it's history, and ritual. Lots of people there! It...More  ","tripadvisor_monas_62":"This is great indonesia's Mosque that a biggest 4 in worldwide. even if you are not muslim, better to visit it because this place is not only talking about religion but talking about history, architecture, and culture. better to visit it, even just 10 minutes.","tripadvisor_monas_63":"The mosque itself is spacious, so you better see the directions better of you don't want to enter the wrong area (if you're woman then avoid to enter gents' area wrongly hahaha). On my visit there, the directions is quiet less and not so clear. But you can ask to the people there since there are a lot of people...More  ","tripadvisor_monas_64":"People said this mosque is big. But I couldn't understand how big is big. Then I decided to find out by myself. I found it as HUGE. The place is so serene and peaceful","tripadvisor_monas_65":"The mosque is open to everyone, regardless the age, gender or religion.If you are not moslem or if you are a foreigner, try to find the \"guest room\".You will be asked to write your name in the guest book.Please get the local official guide from there.I got one for my French friends there.The guide was...More  ","tripadvisor_monas_66":"The mosque is the largest in SE Asia and is worth a visit when in Jakarta. Avoid Fridays due to the number of people attending prayer. Take a plastic bag to place your shoes in...read more ","tripadvisor_monas_67":"It is worth a visit and everyone was very welcoming and friendly. Go to the \"Guest Room\" - come through the main entrance, remove your shoes, go up the first flight of stairs and turn right. Your shoes can be left in this secure room which is attended by a very friendly and helpful man.","tripadvisor_monas_68":"We enjoyed our tour immensely here. We were allowed to take pictures and ask lots of questions. Our private tour guide allowed the representative from the Mosque to give the tour and he translated. The Mosque is lovely and a must-see if you are in Jakarta for the day!Seeing the Catholic church across the street is a beautiful intersection...More  ","tripadvisor_monas_69":"We were thinking this would be closed on Sunday but we cautiously walked to the entrance. The men were very welcoming to us. They directed us to the guest room. They got us properly covered and a guy took us on a thorough tour. The place is beautiful and one of the largest in the world. I'm just so glad...More  ","tripadvisor_monas_70":"Great Architecture design in the large area and big mosque in the central area and very popular mosque","tripadvisor_monas_71":"Very interesting view inside and outside. Makes a beautiful contrast with the Cathedral on the other side of the street. Both worth visiting. Good experience for Ocidentals.","tripadvisor_monas_72":"The mosque is the largest in SE Asia and is worth a visit when in Jakarta. Avoid Fridays due to the number of people attending prayer. Take a plastic bag to place your shoes in before entering. Visitors will be issued a robe to wear during their tour and are asked for a 'donation' at the end of the tour....More  ","tripadvisor_monas_73":"Definitely worth a visit, this mosque is enormous and fits in 200,000 people so it's massive compared to other mosques I have seen. The visit only took me around 30 mins and I had one of the mosque attendants walk me through and explain the different areas. Recommend covering up if you are a woman (arms and legs), and men...More  ","tripadvisor_monas_74":"Situated across from Monas and the Cathedral, this is the national mosque, but there's not much to see or marvel at. Built in 1978, there's no real history to speak of inside, and no interesting history behind the building itself. The layout and architecture look like Soviet-era design, meaning no character or detail. Has the feeling of a large, hollow,...More  ","tripadvisor_monas_75":"Visited this place after visiting the Jakarta Cathedral which is just opposite.It does not look too impressive from the outside. It was my 1st time visiting a mosque. I didn't know what to do as I do not want to offend others visiting the mosque for prayers. So I followed the others.Before you enter, you need to be...More  ","tripadvisor_monas_76":"I went here right at the time for praying time.. this mosque is very huge and large, it has 5 floor, and also a guest room.. I feel so peaceful when I came inside this Mosque :)","tripadvisor_monas_77":"Never having been to mosque before I thought it would be an interesting addition to the cathedral across the road. A guide will offer his services but haggle the price beforehand...read more ","tripadvisor_monas_78":"Never having been to mosque before I thought it would be an interesting addition to the cathedral across the road. A guide will offer his services but haggle the price beforehand. Third largest in the world designed by a christian (12 pillars vs disciples?) so I was told. Apparently totally filled during Eid.","tripadvisor_monas_79":"It's iconic and refer as the national mosque of Indonesia where Presidential and cabinet hold many Important Islamic ceremonial here.","tripadvisor_monas_80":"Other than it's the largest mosque in Asia, I really don't understand why this is the #1 thing to do in Jakarta. Given that the highest percentage of Muslims live in Indonesia, it's no surprise that the largest mosque would be here, but it is certainly not the most beautiful. It looks plain and utilitarian from the outside and not...More  ","tripadvisor_monas_81":"A beautiful place with a rich history...3rd bigger mosque in the world in the middle of Jakarta... Such a nice experience","tripadvisor_monas_82":"It's huge mosque with gorgeous architecture. Guys don't wear shorts. Ladies need to cover up. It is across from an old cathedral. Both religious monuments situated across eachother sitting in harmony.","tripadvisor_monas_83":"A beautiful place with a rich history...3rd bigger mosque in the world in the middle of Jakarta... Such a nice experience","tripadvisor_monas_84":"Built by the soviets in the 60's, Istiqlal mosque is enormous. Able to house 200,000 people for prayers, the mosque is unique because of it's soviet architectural design.","tripadvisor_monas_85":"One of the highlights of Jakarta. Easy to reach; for a small contribution (<20.000IDR; 2 pax) the mosque guard can guide you through or let you stay in to observe the magnificient and beautiful architecture.A good place forget for some time the heat of Jakarta.","tripadvisor_monas_86":"Being in Jakarta, I had heard so much about its biggest and most beautifully architecture mosque Istiqlal Mosque. Many Indonesians perhaps do not know that the architect of the mosque was a devout Christian. Friedrich Silaban won a competition to design the mosque in 1955. The contest’s jury included then president Sukarno. Its construction started in 1961. Sukarno’s successor, Soeharto,...More  ","tripadvisor_monas_87":"Very easy to self walk and tour. You can also go to the cathedral across the street. You can pay an English speaking guide for 100,000 rph","tripadvisor_monas_88":"i love the athmosphere inside of the mosque, it is very quite place, i great place to pray, retreat, or just relax from crowded and heat of city.. if you not a moslem you can see...read more ","tripadvisor_monas_89":"i love the athmosphere inside of the mosque, it is very quite place, i great place to pray, retreat, or just relax from crowded and heat of city.. if you not a moslem you can see the ritual religion from the second balcony floor. after enough around the mosque you can go to the catedral church, just across the street...More  ","tripadvisor_monas_90":"Largest mosque in South-East Asia but not attractive from the outside (concrete cube building) nor from the inside.Guests are guided to the guest room to sign the guest book and donate \"voluntarily\". Non- muslims are allowed to visit the 2nd Floor only from where you can see the praying area. Nothing special, only very large.I've seen far more...More  ","tripadvisor_monas_91":"A very huge mosque. Should ask a good direction to the womans toilet. Cos its far. If u bring an old woman just let her wudhu at the nearest toilet. Even if its for man. Just keep company. Cos the womans toilet is a bit far from our entrance the other day. But its a nice n a big mosque...More  ","tripadvisor_monas_92":"Very modern and huge. Funny architect of this musque is christian :-) but why not. Inside is implement some Indonesian symbols ex. radius of the copule is 45 meters - why ? Declaration of indonesian was in 1945 ....","tripadvisor_monas_93":"This mosque is one of the largest in the world and certainly the largest in Asia. Designed to hold up to 200,000 people, this certainly is a gigantic and impressive building complex. The name \"Istiqlal\" means independence in Arabic language, as this mosque was built to commemorate Indonesia's independence.It is advised that you should wear pants or skirt that...More  ","tripadvisor_monas_94":"This is an iconic mosque in Jakarta. Really an arthistic architecture building. It's great to see the mosque's architecture.","tripadvisor_monas_95":"We visited out of curiosity about architecture and history. It was great! They have a separate room for tourists to leave their shoes, and you will be shown around by a guide to take in the most important sights of the world's third largest mosque. Even though prayer was in progress while we visited, there was still every opportunity for...More  ","tripadvisor_monas_96":"Good masjid for pray and for learning all ISLAM knowledge and Sunnah, you must try to pary here due to the place very good and also many Quran for reading available inside this Masjid....","tripadvisor_monas_97":"My boyfriend and I visited this Mosque during Ramadhan, just 1 day before the Eid al Fitr. So there were many people preparing for the big day. The guide who escorted us was very informative. If you are a visitor, they will let you go to the information office to meet the guide and he will gladly show you around...More  ","tripadvisor_monas_98":"The mosque is a huge complex worth visiting. The decoration under the dome is stunning in combination with the metal/gold architecture.","tripadvisor_monas_99":"We came here for break fasting in ramadhan, so the mosque is quite busy and a lot of people come to pray..They provide free takjil during ramadhan (as all the mosque...read more ","tripadvisor_monas_100":"We came here for break fasting in ramadhan, so the mosque is quite busy and a lot of people come to pray..They provide free takjil during ramadhan (as all the mosque does..)Even with so many people yet it's very good mosque with very good facilities also..","tripadvisor_monas_101":"It feels bigger inside than by the look of it outside, amazing. Good location and easy to reach by public transportation, best to take Trans Jakarta bus and step off at Juanda bus station. So peaceful yet warm atmosphere. Non Muslims (locals or foreigners) are welcome to visit. Just find the visitor center for more details. Just next to it,...More  ","tripadvisor_monas_102":"Istiqlal mean Independence, this Masjid was opened in 1978. The interior design is minimalist, simple and clean-cut, with a minimum of stainless steel geometric ornaments. and it placed across The Jakarta Cathedral. Inside the Masjid is cold enough without air condition, the air flow is perfect. The mosque has seven entrances, and all seven gates are named after Al-Asmaul-Husna, the...More  ","tripadvisor_monas_103":"Its a pretty big mosque with a very nice dome inside, non muslims are allowed to view from the gallery upstairs, its a very basic and plain structure, just very large in size with multiple levels.You have to take off your shoes and can ether carry a bag so its not left anywhere or you can leave it with...More  ","tripadvisor_monas_104":"If you want to visit here, don't forget to take out your shoes and wash your footh. The inner design of ths mosque is wonderful. Don't forget to see the bedug. To stay there and take a pray is peacefull","tripadvisor_monas_105":"Close to the Gambir train station, you better take a taxi because hard to find the right entrance by foot. Mosque not that special at all to be honest. Gives a cold feeling. So, if you don't have that much time, juist skip it.","tripadvisor_monas_106":"majestic and elegant mosque. We visited this while planning to Borobudur Temple. Though the traffic jam was crazy.","tripadvisor_monas_107":"We were in town for a wedding and stopped to visit. This was our first time to enter a mosque and we were unsure of what to expect. We removed our shoes and were given a long robe to wear. It was a beautiful building. Many were there praying. Our guide was very kind and informative.","tripadvisor_monas_108":"The mosque was close to monas monument and the catholic cathedral.When we arrived we were made very welcome and provided with a robe so that we were able to go around the mosque with a guide and to take photos. It was interesting and informative.","tripadvisor_monas_109":"This is the Great Mosque in Jakarta and IndonesiaHuge Mosque and the favorite place to prayNear to Gambir station","tripadvisor_monas_110":"Yeah this mosque it's so big ! this is my first time to seen the big mosque in Jakarta, and i got information it cover more than 200.000 people ! Spectacular !","tripadvisor_monas_111":"Yeah this mosque it's so big ! this is my first time to seen the big mosque in Jakarta, and i got information it cover more than 200.000 people ! Spectacular !","tripadvisor_monas_112":"The biggest mosque in South East Asia. Foreigners and non muslims are welcome to visit. They have a guided tour in English in the visitor centre. Lovely, peaceful and a touch of paradise in the bustlling city","tripadvisor_monas_113":"The sheer size is impressive, make sure you see all the parts. There is a small room where you can leave your shoes and get clothes/robes to cover up if necessary. You can see the Christian church from the courtyard of the mosque. :-)","tripadvisor_monas_114":"very big and very beautiful from insidei went this year in mayits very well organized mosqueand thousands of people can pray salah togetherand this is a biggest mosque in indonesia","tripadvisor_monas_115":"This is the icon of Indonesian mosque. One of the greatest architecture among the rest. Very neat and clean, have a very good audio system for athan and shalah.","tripadvisor_monas_116":"It serves both western and asian cuisine and becerages. Nice interior and provides a shelter from the heat of the old city square.","tripadvisor_monas_117":"this mosque is at the heart of indonesian life. a visit to this city would not be complete without it. after all of the western shopping centers, it was nice to visit a cultural monument. also, this was my first visit to a mosque and as a result, it was a interesting experience.","tripadvisor_monas_118":"I'm not Muslim, and I've never been in a mosque until now... I wasn't sure what to expect, other than expecting not to be welcomed.I was so wrong.This is a beautiful structure inside and out. The visitors area helps you learn more, grab a friendly guide that might even speak your language, and put on visitors robes if...More  ","tripadvisor_monas_119":"Been here with my family, we are love this mosque. The great one at Jakarta city. I know this mosque when was kid. And I introduce Isriqlal for my kids also.","tripadvisor_monas_120":"A peacfull place to visit. Love the architech. Very neat , In the Heart of Jakarta. A place of worship, Imam of the Masjid was a true Muslim and very help full. I must go again if i visited to Jakarta again.","tripadvisor_monas_121":"the biggest mosque in south east asia, what else I can say? wonderful structure & architecture, yet for this great infrastructure the maintenance should be much better.","tripadvisor_monas_122":"Masjid Istiqlal is the largest mosque in Southeast Asia and was built to commemorate Indonesian Independence. Hence, it was named as Istiqlal (Arabic) meaning Independence.You can enter the mosque for free. Muslims can go to the central prayer area. Non muslims are taken through a different route. You can ask for info with the guyz where you store your...More  ","tripadvisor_monas_123":"For Indonesian, if you wanna feel do Pray in a Mosque like in Saudi Arabia just go to Istiqlal Mosque then you will get the same ambience. For foreign, come to see the beautiful and comfortable this mosque, i am sure you won't disappointed.","tripadvisor_monas_124":"This place is not only for holy spirit ritual but a place that you can leave your pray, memory, sightseeing and traveling picture memory (photoshot)","tripadvisor_monas_125":"Istiqlal is one of the must visited place in Jakarta. Despite of its religional function, Istiqlal attracts many foreign tourists with its construction, design, and activity. The president of Republic Indonesia frequent to pray here.","tripadvisor_monas_126":"the biggest mosque in south east asia, what else I can say? wonderful structure & architecture, yet for this great infrastructure the maintenance should be much better.","tripadvisor_monas_127":"Good to see !! very big mosque !! Tourists are treated much friendly :D !! You have to wear robe provided by them to enter the mosque!!","tripadvisor_monas_128":"For Muslim visitors, you need to try and have a pray here. It is Huge and Comfortable. Try to not pray at lunch time or Friday. It will be really packed with people","tripadvisor_monas_129":"Open minded greeters assist you in removing your shoes and touring this incredible mosque with absolutely beautiful accoutrements and the world's largest hand drum.","tripadvisor_monas_130":"this is the first time i visit istiqlal. I was blown away while i enter the mosque, its huge and its beautiful. it also so peaceful in there","tripadvisor_monas_131":"The mosque us impressive and the inside is epic and beautiful... Try to get there for evening prayer as the singing us enchanting...IMPORTANT NOTE: There are people posing as guides that may force themselves on you. No mention will be made of money until you are about to leave then they will demand a large \"tip\". They can become...More  ","tripadvisor_monas_132":"with most of foreigners, the mosque receptionist wouldn't even ask, but forcefully & volunteerly to guide & to gown you, but later after short tour, he started to rip off the...read more ","tripadvisor_monas_133":"Big, impressive mosque but not too beautiful. The guide who forced himself upon us was angry in the end because he tought the tip was too small, whereas he had said before he just had to accompany us for \"statistics purposes\"","tripadvisor_monas_134":"Istiqlal Mosque is the biggest mosque in IndonesiaThe location is side by side with Catholic Cathedral and near Borobudur Hotel.The main purpose of mosque is for Moslem to prayThere will be a lot of them come to the mosque every Friday noon, Ramadhan (fasting month) and Great Moslem days (Hari Raya Idul Fitri and Hari Raya Idul...More  ","tripadvisor_monas_135":"Just opposite Istiqlal Mosque stands a fine Gothic Revival style Jakarta Cathedral,the Gereja Katedral Jakarta. The historic Roman Catholic Cathedral is the seat of the Roman Catholic Archbishop of Jakarta.","tripadvisor_monas_136":"gave us a first hand view of the largest mosque in sea..very well maintained nd lovely architecture.","tripadvisor_monas_137":"This great mosque is so convenience, there are no air conditioner inside, but, it was so comfortable. The biggest problem is parking area during Jumat praying.","tripadvisor_monas_138":"with most of foreigners, the mosque receptionist wouldn't even ask, but forcefully & volunteerly to guide & to gown you, but later after short tour, he started to rip off the tourist by privately asking big tips (he insisted & seeked for bigger tip). Overall, the building is spectacular, worth to visit.","tripadvisor_monas_139":"Firstly the mosque is free to visit (unless you give a donation), and in my opinion is one of the main things to do whilst in Jakarta. I went twice during my stay, once during pray time.It is stunning and can hold up to 200,000 people, the dome is 45m in diametre and resembles their independence in 1945 and...More  ","tripadvisor_monas_140":"The Istiqlal Mosque is a very large mosque in Jakarta. The dimensions of the edifice are huge and can accommodate a huge number of believers for prayers. Very peaceful atmosphere inside.","tripadvisor_monas_141":"It's a great place for u to visit in Jakarta! When u get there just tell the guards that you want to wish to visit the mosque, they'll direct you to this \"visitors's room\" where this very friendly tour guide will greet you. He will lend you scarves to cover yourself, and you do have to walk barefoot. The guide...More  ","tripadvisor_monas_142":"The mosque was really huge but nothing very artistic to see in the building. Getting in was easy and there werent any restrictions on visitors.","tripadvisor_monas_143":"it has great history, nice environment and clean. We came here with one of my local friend in Indonesia so she explained about the mosque which is very interesting.","tripadvisor_monas_144":"For Muslim and non Muslim travellers, ot would be great to see the expanse of this mosque... Beautiful on the inside, outside doesnt give a huge impression, though...","tripadvisor_monas_145":"it has great history, nice environment and clean. We came here with one of my local friend in Indonesia so she explained about the mosque which is very interesting.","tripadvisor_monas_146":"This really show the harmonious relationship between the Christian and Islam in Indonesia. Frederich Silaban, a Christian architect from North Sumatra won the design to build this mosque. The simple and vastly open space makes this an interesting place to visit.","tripadvisor_monas_147":"This is the best place to be close to ourselves, it can make You understand of what is Your purposes of living and death. It can define, who you really are.","tripadvisor_monas_148":"Exploring Jakarta? Make sure that you visit the biggest mosque in this capital city. We can go to the visitor desk and there will be some friendly gentlemen who will accompany you to learn more about the history of this mosque. The meaning of Istiqlal is -- independence. The architect designed each corner of the mosque with meaningful symbols. Some...More  ","tripadvisor_monas_149":"I walked to Istiqlal Mosque from Gambir Station. it's already 6 o clock and almost raining with thunders in the sky. I had to walk faster to the mosque and to my surprise, the door was closed. i asked a street food seller nearby, then he told me that the entrance is still up ahead. i decided to run since...More  ","tripadvisor_monas_150":"Each Sunday in Jakarta one of the main roads that leads to the national monument (Monas) is closed to car traffic between 6am until about 11am. We decided to cover Monas, the Mosque and the Cathedral on one morning. After a long walk we finally made it to the Mosque and were milling around outside not knowing where to go...More  ","tripadvisor_monas_151":"The mosque prayer hall is so spacious with a very beautiful large dome in the middle. The mosque area was open and warm inside due to opening all around. Unfortunately washrooms were not clean and maintained according to the sanctity of a mosque.","tripadvisor_monas_152":"This masjid very big and when coming here my soul automatically full, but from the parking area to the masjid area some distance.","tripadvisor_monas_153":"Amazing Muslim Architecture and a piece of art, must visit thing.one of biggest Masjid in Asia. peaceful place","tripadvisor_monas_154":"The size itself of Istiqlal Mosque is impressive, and it is one of the largest mosques in Southeast Asia. The architecture itself is very minimal, with a lot of open spaces to let...read more ","tripadvisor_monas_155":"The size itself of Istiqlal Mosque is impressive, and it is one of the largest mosques in Southeast Asia. The architecture itself is very minimal, with a lot of open spaces to let in the light. As this is a functioning mosque, there are tour guides that will navigate visitors as to not interfere with prayer and meditation. However, one...More  ","tripadvisor_monas_156":"I like this mosque because it is so big, spacious, and so peaceful, if it's not too crowded by tourists.On weekend, many people come here and make it as an attraction, a place where they can play around, make some noise, taking pictures, and it doesn't feel like a place to pray anymore.","tripadvisor_monas_157":"Awesome building of mosque and usualy do shalat and special moslem celebration idul adha and lebaran. Big misque a lot of jamaah to shalat in a special day also attend by president and minister","tripadvisor_monas_158":"Istiqlal mosque is the biggest mosque in Jakarta, Indonesia. The architect of this mosque is F. Silaban, a non Muslim. He combined Islamic styles with local Indonesian as well as the Western styles. The result is a minimalist design that is welcoming everybody, Muslims and non Muslims.","tripadvisor_monas_159":"Istiklal Mosque combines simplicity with grandness. You may not find many elobarate decorations to please your eyes but its colossal stand affects you. It is a must-see place in Jakarta.","tripadvisor_monas_160":"This is beautiful Mosque at Jakarta, with beautiful architecture building. You can pray and visit Istiqlal Mosque","tripadvisor_monas_161":"by this location, its very strategic,, in the middle of a bustling and crowded city where people have a lot of activity,, therefore, this mosque by its architecture is making peace for whom come inside,","tripadvisor_monas_162":"It was a big mosque.We went there for prayer with a friendThank you Mr. Anwar .Hope to pray Jomaa pray in the future in my next visit to Jakarta.It was great experience.","tripadvisor_monas_163":"If you're a moslem, you just have to come visit to pray at least. Or if you're a photographer, you're gonna love it's grand interior.","tripadvisor_monas_164":"This is the largest mosque in this region, which is a big deal considering the largest concentration of Muslim people in the world, live in Indonesia. The scale of this building is amazing - it's huge. The interior is beautiful with the traditional Islamic inlay details on the ceilings and walls. The odd thing though, is how cold the exterior...More  ","tripadvisor_monas_165":"The mosque is a very interesting place and well worth the visit to see the sheer scale of the place & the people there.We had a guy chase us to insist we \"register\" when we...read more ","tripadvisor_monas_166":"The mosque is a very interesting place and well worth the visit to see the sheer scale of the place & the people there.We had a guy chase us to insist we \"register\" when we entered the building. Thankfully we had read other people's reviews on Trip Advisor so we ignored him. There is no registration or fee required...More  ","tripadvisor_monas_167":"Really a breathtaking place, beautiful designed and a peaceful place to be. Easy to take a cab to and from.","tripadvisor_monas_168":"I'd heard that it was the biggest mosque in this region but Wow! I didn't quite comprehend exactly how large it was.The staff on site are really helpful and ensure you have a good experience. The archtiecture within the mosque is just beautiful and with birds flying around the dome it is so peaceful.","tripadvisor_monas_169":"Besides the history of istiqlal, the ambience is very good to pray. The environment is also safe and clean.","tripadvisor_monas_170":"This mosque is in front of the Jakarta Cathedral. Many people there, local tourists from other parts of Indonesia. Must remember to remove your shoes and even socks. Non-moslems can enter the vast carpeted prayer room. It's nice to observe the muslims praying and reading their holy book. There is a place in second level of the building where you...More  ","tripadvisor_monas_171":"Istiqlal Mosque, or Masjid Istiqlal, in Jakarta, Indonesia is the largest mosque in Southeast Asia. This national mosque of Indonesia was built to commemorate Indonesian independence and named \"Istiqlal\", an Arabic word for \"independence.Around 200,000 people can pray together at any time.","tripadvisor_monas_172":"Before entering the mosque premises, I want even sure if non Muslims are allowed to go inside or not. I found the people very helpful. The personally explained me where I can go and what I can see.The mosque is supposedly the biggest in SE Asia and 3rd biggest in the world. They have a dedicated floor for non...More  ","tripadvisor_monas_173":"Having lived in the Middle East, I wasn't particularly impressed with the Istiqlal Mosque architecture. We were followed by a person from the mosque during the whole visit and he asked us for money after that. He said: 'Collaboration' but wanted the money in his pocket.","tripadvisor_monas_174":"The biggest mosque in Jakarta, elegant, amazing and majestique ambience.must visit place in jakarta and kunjungi juga wisata kota tua.","tripadvisor_monas_175":"Nothing else but dimensions were impressive. I've seen more beautiful architecture and to say nothing about interiors! We were forced to pay and found out later that it was just another scam.Pretty much sad being a holy place.Anyway, I liked the location - so near Christian church. I strongly believe that religions must not divide people and this...More  ","tripadvisor_monas_176":"This is a must see in Jakarta, its the biggest mosque in south east Asia. We got an excellent guide that took us for an half an hour tour inside and outside. Respect the dress...read more ","tripadvisor_monas_177":"I took a Holland America cruise (Volendam) and it stopped at Tanjung Priok for the day. If to arrive on a cruise ship and want to see Jakarta book a tour, don't try it on your own. The road to Jakarta from Tanjung Priok (early in the morning) was one big parking lot. It too us almost 2 hours to...More  ","tripadvisor_monas_178":"This is a must see in Jakarta, its the biggest mosque in south east Asia. We got an excellent guide that took us for an half an hour tour inside and outside. Respect the dress codes, no shoes and they have free robes that women can borrow inside. Cameras/pictures are allowed.","tripadvisor_monas_179":"We were apprehensive to start with going in, not sure what we were supposed to do or where we were allowed to go. However, everyone was really friendly and helpful and directed us to the guest entrance. We were shown around for free and given lots of information about the mosque and about Islam. The mosque itself is pretty impressive...More  ","tripadvisor_monas_180":"A mosque staff approached me to see if I needed guide service. As a non-muslim, I could not get into the center part of the mosque, that's the area for prayer. However he took me to the 1st floor of the mosque and I had a panoramic view. He spoke English quite well and introduced me about the architecture. With...More  ","tripadvisor_monas_181":"A five level Mosque that can accommodate 200,000 worshipers is not something many people get to see every day. I am told is the largest Mosque in southeast Asia. It is worth signing in and for a small donation have someone take you around and explain the Muslim worship traditions. A special room is set up for foreigners to leave...More  ","tripadvisor_monas_182":"There is not much to see in Jakarta but this is the top. Do not get fooled by the guy who tricks you to his chambers to make contribution. Just take your shoes and go. Dont forget first floor, there you can see people praying and the stunning ceiling, because other than that you cannot get to the praying area....More  ","tripadvisor_monas_183":"The architect of this mosque is F.Silaban, christian architect, it is show us the harmony of many religion in Indonesia, The building is so big and have expose structural building that covered with marble....simple but grand.","tripadvisor_monas_184":"If you have time in Jakarta visit the main mosque. Tour guides are free and they give you interesting insights into the mosque and Islam. This mosque is the largest in SE Asia and quite beautiful. Allow an hour.","tripadvisor_monas_185":"I actually visit this mosque regularly. It's very near from National Monument, Lapangan Banteng, and the Cathedral church is across the street of it. This mosque can accommodate up to 200.000 people inside the building. And also, for you whom just want to visit, it's open for the non-moslem as long as you dress conservatively.This place is proofing that...More  ","tripadvisor_monas_186":"a few times i visit this place, and im theft my phone and handbags while im praying. so be careful bout ur stuff when u pray in there.but actualy, this is a beautiful mosque that i ever seen at Jakarta...","tripadvisor_monas_187":"I was amazed when I saw the size of the inside of the mosque! It was beautiful, especially the dome and the long hallways. There is not much to do when you are there, other than...read more ","tripadvisor_monas_188":"This is one of the most beautiful mosques one has ever visited! It's very clean, cool, and the people were very friendly! The architectural construction is one of a kind and the inner space is breathtakingly beautiful! Very peaceful experience.","tripadvisor_monas_189":"I was amazed when I saw the size of the inside of the mosque! It was beautiful, especially the dome and the long hallways. There is not much to do when you are there, other than walk around and look. I was glad that I had a guide with me since I was a white woman, but everyone was kind...More  ","tripadvisor_monas_190":"There should be some improvement in the bath room. Especially on Friday, you have to come early for Jumat pray because the parking space is not big enough","tripadvisor_monas_191":"There isn't much to see in Jakarta, this is a good one to see as it is the largest Mosque in Asia and third largest in the world. But there isn't a good audioguide or tour, so you basically walk around yourself. If you have questions, there is an English speaker that can answer your question.","tripadvisor_monas_192":"What a beautiful building inside and out the guide was excellent and gave us a very informative tour around. Took pictures us of both at good vantage points.","tripadvisor_monas_193":"On every soul there is a place of solitude reflection. Here is a place where you will feel a breezing heart in the heated city of Jakarta.","tripadvisor_monas_194":"I'd recommend this if your curious to take a look into a mosque. It's interesting from a cultural perspective and from an architectural perspective. The design is what got me, and the interior of the dome is brilliant.","tripadvisor_monas_195":"When you come for the first time, you might be a little confused to the place of ablution. But once you enter the main building where prayers, you will feel calm. Especially if you pray in this mosque.","tripadvisor_monas_196":"This is a beautiful space and the 3rd largest Mosque in the world. I'm sure if you are muslim you will get more out of a visit to this space. However, we were asked to sign in, donate money and then turned loose without any information on the Mosque. This was particularly disappointing since we had had other family members...More  ","tripadvisor_monas_197":"Istiqlal is the biggest masjid in South East Asia. Design by christian architect and become the grand masjid of Indonesia","tripadvisor_monas_198":"I came here not because of religion reason, but I guided some people from another country who interested to see the main religion site in Jakarta, that is the Cathedral and the...read more ","tripadvisor_monas_199":"I came here not because of religion reason, but I guided some people from another country who interested to see the main religion site in Jakarta, that is the Cathedral and the Istglal Mosque. Because our visit was on Sunday, so we couldn't visit it due to Sunday mass service. So we changed our plan, we visited Istiqlal Mosque instead....More  ","tripadvisor_monas_200":"Opening itself to public regardless of their religion, the Istiqlal Mosque is an interesting place to see. If you wear sleeveless tops or shorts or short skirts, you will have to borrow one of their robes to cover up. Shoes or sandals are not allowed inside the mosque so make sure you don't come with expensive ones. Visitors (read: tourists)...More  ","tripadvisor_monas_201":"It's interesting to see this area. I have no religion - so it's really impressive to see people who they live their religion.","tripadvisor_monas_202":"This is miracle after certain years I came back to this iconic Indonesian mosque. The room at main floor is very cool and secure. Please come earlier to reach first row and closely to mimbar. Recommended to traveler with backpack or other bags, because there is special box to keep secure.","tripadvisor_monas_203":"Hundred times to visit this mosque, very exciting to see the biggest mosque in Jakarta or maybe greater area. Praying inside there, made peaceful in heart. It has many floors upstairs, and wide space for approximately 1000 people. Heard the history, the first president of Indonesia pioneered to establish this huge building.","tripadvisor_monas_204":"Everyone was courteous and polite. We were able to leave our belongings in a secure area and walk around the mosque. Our guide,from walkindies was able to answer our questions.","tripadvisor_monas_205":"Very cool experience being here. Felt a little taken advantage of by the guy that greeted us and offered up a personal guiding and place to store our packs for a generous donation.","tripadvisor_monas_206":"The Masjid Istiqlal is a huge mosque in central Jakarta. It is reportedly the largest in South East Asia. At peak capacity the Istiqlal can hold 200,000 people praying. The prayer areas include inside and out. Access to the mosque is completely open even during prayer times. Shoes off of course. No fee.Externally the Istiqlal is big rather than...More  ","tripadvisor_monas_207":"My wife and I were taken to this landmark mosque in Central Jakarta by our Free Walking Tour guide late in the afternoon. The mosque authorities were not concerned about our relious faith (we are not of Muslim faith) and treated us with great dignity. I was wearing shorts (since it was humid like it always is in Jakarta) and...More  ","tripadvisor_monas_208":"be ready for a new experience.nice to have Muslim friends who can explain and coach!people are very friendly and open to visitors joining them in prayer and sharing Salam!","tripadvisor_monas_209":"This Mosque we can call it a Grand Mosque at Jakarta because of it's Size and also location locate at the central Jakarta, near the Presidential Palace. The Mosque very big and...read more ","tripadvisor_monas_210":"What a great experience to visit a temple of pray for my brothers the Muslims. Quit. Peaceful. Inviting for meditation. I recommend you get some 30,000 rupiah for tipping the very neat welcome officer at the guest room where you have to start as a Christian.","tripadvisor_monas_211":"This Mosque we can call it a Grand Mosque at Jakarta because of it's Size and also location locate at the central Jakarta, near the Presidential Palace. The Mosque very big and spacious and have few floor at the main area. If you want to come here better bring Socks because here we must walk without our shoes and our...More  ","tripadvisor_monas_212":"This mosque is in front of the Catholic Cathedral. It's nice to know that there is unity in religion.","tripadvisor_monas_213":"After reaching the entrance and taking my shoes off, followed several other foreigners whom were led to the 'Guest Room' where we were given a short introduction of the mosque and told that we were only allowed up to the 2nd floor.A donation is requested and you can donate as much as you wish. Those not in appropriate clothing...More  ","tripadvisor_monas_214":"Islamic mosque wonderful decoration as well as the place and calm needs some attention that place make you relaxed","tripadvisor_monas_215":"Istiqlal is the largest mosque in South East Asia ,Lot of people attend prayers in this mosque which also makes it pretty crowded .I found it as a sign of religious harmony since it faces the Jakarta cathedral, which is like 20 meters away","tripadvisor_monas_216":"A beautiful mosque and the nation's most widely known, it's the biggest mosque in SEA. Mainly used for praying but also had social activities centered around it such as a madrasah, cooperative, library, sports facilities, etc. It is well kept and open to visitors all year long. Dress accordingly as you would to other religious site.","tripadvisor_monas_217":"This mosque is really amazing because it place front of the church. It really lovely. Its show how people in Jakarta since long time ago caring each other","tripadvisor_monas_218":"the biggest mosque in southeast asia they say, you have to visit this place if you love architectural design.","tripadvisor_monas_219":"The grand mosque is more of a socializing square than just a worship site. In the weekend there is a noon sermon that attract moslem from Jakarta and around. They come with family members or friends. The courtyard then turn into a lively market place where people meet, trade or have a picnic.Go there around 5:30 pm to catch...More  ","tripadvisor_monas_220":"Tourist should visit this one of the largest mosque in Asia for its historical value and architecture heritage. It was commissioned by Indonesia's first president and was...read more ","tripadvisor_monas_221":"My and husband stopped by for a prayer after a trip to Kota Lama Jakarta. The inside of the mosque is beautiful. Contemporary+traditional islamic architecture and design on the mosque dome and internal. With several level of prayer halls. They also have shoes storing and mukena(prayer uniform for ladies) rental services for free. Just tip the worker out of courtesy....More  ","tripadvisor_monas_222":"Went to visit this mosque according to the previous trip advisor comments, but honestly I won't really advise it to others travelers, unless you are Muslim and religious, the mosque itself is a big building kind of soviet style of construction, concrete and grey !!!! Once you arrived at the gate, the parking is over crowded by street vendors of...More  ","tripadvisor_monas_223":"Its 17 years construction was personally supervised by the first President of Indonesian Republic, Soekarno. The largest mosque in Southeast Asia both in structure and capacity, as it can accommodate congregation of up to 120,000 people, has 4 levels of balcony.Located at Jalan Taman Wijaya Kusuma in central Jakarta, on the northeastern corner of the Merdeka Square, the Istiqlal...More  ","tripadvisor_monas_224":"bigs mosque in jakarta nice plase for tavel religion the mosque ourist should visit this one of the largest mosque in Asia for its historical value and architecture heritage. It","tripadvisor_monas_225":"The big mosque in South East Asia design by non muslim and the location opposite with cathedral Jakarta.","tripadvisor_monas_226":"I visited during Ramadan while traveling through SE Asia and I had never been in a mosque this big. What struck me is that unlike in most mosques in the west, the women take exactly half of the prayer space. Like I mean the partition is right down the middle. That to me was almost revolutionary. Also, the partition wall...More  ","tripadvisor_monas_227":"Tourist should visit this one of the largest mosque in Asia for its historical value and architecture heritage. It was commissioned by Indonesia's first president and was surprisingly designed by non-Muslim architect. Its position opposite to Cathedral further emphasise Indonesia's plurality and tolerance. Please wear modest clothes on your visit.","tripadvisor_monas_228":"This place used to be beautiful, now it's only like an ordinary mosque surrounding by street vendors and beggars.Trash everywhere, a tourist which is not a muslim can go inside the mosque without a proper Islamic clothing (short pants, tank top only covered by scarf, etc)The people who used to keep visitor's shoes ocassionally accept money, while there...More  ","tripadvisor_monas_229":"My friend and I, who are both non-Muslim, visited the mosque after hearing positive stories. There was a man working as a tour guide who stored our shoes for us and told us a little bit about the mosque and explained to us where we could go. His English was quite well and he could answer most of our questions....More  ","tripadvisor_monas_230":"Must Visit to see the scale and modern architecture of the Mosque. very well maintained in cleanliness.","tripadvisor_monas_231":"Use to prays here specially on ramadhan...large parking area n big mosque... Nice & clean Wudhu place... and beautiful interior design....it's a must to visit","tripadvisor_monas_232":"I went for Ramadhan tarawih prayers to this mosque. The recitation was excellent. To my surprise, it accommodated 11 rakaats as well as 23. This is unlike other mosques where you have no choice but follow. The way it did was the first round completed 8 rakaats with one Imam followed by 3 witirs, the one wanted to continue for...More  ","tripadvisor_monas_233":"This mosque is one of the biggest mosque in Southeast Asia.a home for all devoted muslims especially Indonesian.Istiqlal is an arabic word for Independence.This mosque is situated across the famous Jakarta Cathedral.Both places of worship located face-to-face as a representation of religious harmony in Indonesia.","tripadvisor_monas_234":"Use to prays here specially on ramadhan...large parking area n big mosque... Nice & clean Wudhu place... and beautiful interior design....it's a must to visit","tripadvisor_monas_235":"It was a very nice visit to Jakarta and we wanted to pray Jumaa in there , Its a very big mousque and there was a large number of people , the hkutba was in there language so I did not understand but the quran and the arabic part but it was very relaxing and the mosque was very cean...More  ","tripadvisor_monas_236":"I have visited this Mosque twice in the last months and both visits have been very warm, welcoming and interesting to a non-Muslim. Thank you so much for your hospitality. This experience really was worthwhile and offered a better understanding of Indonesian culture.","tripadvisor_monas_237":"This is the largest mosque in South East Asia, capable of holding thousands of worshippers. What really surprised me was that our mosque guide's name was Vishnu, a very Hindu name. Indonesia seems to blend religions very comfortably!","tripadvisor_monas_238":"The biggest Masjid I have ever prayed in is Masjid Istiqlal. The place is mind blowing. They have qualified Imams with golden voices. I've prayed here several times and anytime I pray here I feel something good I can't explain.","tripadvisor_monas_239":"Reach this Mosque by free tourist bus. Not allowed to go in with short but the people here very kind by giving me pelikat to wear. show me where and what and how. Nice largest mosque in Jakarta to visit. Kind people.","tripadvisor_monas_240":"Cool big mosque lot of people nearby other attractions,cathedral and national museum. Staff know English","tripadvisor_monas_241":"The mosque is very big. You can pray quietly because the size is superb...One thing, always store your personal belongings to the store keeper. You dobt have to pay but it is advisable to give him tips for keeping you stuffs (2k IDR) include your shoes. It is frequent to loose shoes due to careless placement and or stealing.","tripadvisor_monas_242":"Like everyone did, the purposes for you to go and visit the mosque is because of the design and architecture besides go for your prayer of course. Its all great to watch it, dont...read more ","tripadvisor_monas_243":"Like everyone did, the purposes for you to go and visit the mosque is because of the design and architecture besides go for your prayer of course. Its all great to watch it, dont miss the chance everytime u go there. Have a look inside!","tripadvisor_monas_244":"Another must visit spot while you're in Jakarta, but not sure as far as \"regulation\" for non Moslem to enter certain area. But architecture is worth visit.","tripadvisor_monas_245":"Said to be the largest in SEA, opposite the beautiful neo-Gothic Jakarta Cathedral. We wandered about the gardens but couldn't see how to go inside.","tripadvisor_monas_246":"I have been to immense mosques in Istanbul and Casablanca and this one is in the same league. The modern architecture is striking and the enormity of the building is breathtaking. It is well worth a visit.","tripadvisor_monas_247":"The biggest mosque in southeast asia just near gambir station just 5mins by walk. Nice and beautiful architecture.","tripadvisor_monas_248":"A place where we feel so small in the eyes of God….. place where we can feel the greatness of God…...","tripadvisor_monas_249":"This is the largest mosque in Indonesia, and was the largest too in region.I lost my slipper wheb i prayed herr kast november. In fact i already put the right side and left side separately. But thief is smarter. :DSo if you want to pray here, you better put your slipper or shoes in the locker, or simply...More  ","tripadvisor_monas_250":"One of the my favorite mosque in the world (Yes, because I haven't to much aboard then ;p hehehe)One of the landscape in Jakarta you guys (traveler) should come.. As a national (Indonesia) Mosque and referred to the biggest Mosque in South East Asia.Located in the central of Jakarta, near from Gambir Rail station and TransJakarta station.If...More  ","tripadvisor_monas_251":"I made a poetry that figure this building and its situation. When you entry the building, it seems to be a bridge that connected two different world.Jakarta as well as we know is very crowded and hot temperature. And if you compare the situation after you entry into the mosque, you will feel like a park, very cool and...More  ","tripadvisor_monas_252":"A huge interior and exterior (for overflow) makes this the world's third largest mosque, I was told. As a non-Muslim, I was free to enter (when prayers were not on). Very impressive interior, ironically designed by a Christian architect, it seems. Certainly worth a visit, adjacent to the MONAS area.","tripadvisor_monas_253":"the Mosque is very huge and yiu can find some guides if you need to know more about the history of mosque and how the prayers are done here. many indonesians go there to pray and...read more ","tripadvisor_monas_254":"Huge and impressive mosque, full of historical story, where the main hall for pray located at the second floor.","tripadvisor_monas_255":"the Mosque is very huge and yiu can find some guides if you need to know more about the history of mosque and how the prayers are done here. many indonesians go there to pray and know more about hajj and umrah .","tripadvisor_monas_256":"This is also the landmark of Indonesia, especially the Muslim of Indonesia. The architecture was very simple and I thought the influence of the architecture was impressed from the mausoleum of Mustafa Kemal Attaturk in Ankata, very similar if the dome doesn't exist. While the name of Istiqlal not only represent the name of Indonesian independence but also influenced by...More  ","tripadvisor_monas_257":"The mosque is very large. You can see the top from quiet far.Nice to see even if it's not very elaborated","tripadvisor_monas_258":"This Masjid Istiqlal is one of the place that makes me feel comfortable when I visit. The location in the center of Jakarta and really close to the historical places make this Masjid always full with people who came for any purpose.","tripadvisor_monas_259":"One of the most beautiful most that I have been to. It is a quite a distance to travel to the place especially if you wanting to be there for Fridays.Please do advice that this is a Mosque and not just a tourist attraction. Please do respect it and the religious rules that follow on how to approach a...More  ","tripadvisor_monas_260":"The mosque is undoubted a special place to visit in order to have an image about the city of Jakarta. I was impressed by the well organized service provided for foreigners visiting the place, but would have been much better if our guide would have liked to tell us more. The mosque it's huge and has some attractive architectural features....More  ","tripadvisor_monas_261":"We visited this main mosque almost by chance, but it proved to be a highlight of our stay in Jakarta. Outside the building is rather bulky and brutal, but the interior with its cavernous hall and colonnaded courtyards are breathtaking ..... MODERN spaces which through their architectural integrity and shear spatial gutsiness, inspire contemplation and even awe (sorry I am...More  ","tripadvisor_monas_262":"This building is remarkable because of its size, it allows 120,000 people inside! There is somebody near the entrance waiting for visitors who explains what to see un the Mosque. It was the first time I could walk around freely in a Mosque even though I am not muslim. You only can get access to the main hall but you...More  ","tripadvisor_monas_263":"The architecture and size are amazing. When you are praying in side the mosque, you will feel that you are not in the Indonesia.","tripadvisor_monas_264":"I loved the spirituality of the Mosque. We attended during Ramadan and it was quite busy as one would expect, but surprisingly hushed and still. Attending on Idul Fitra would be...read more ","tripadvisor_monas_265":"We went during a very busy period...national holiday and of course there plenty of people. Easy to walk, if you like walking if not local transport, like rickshaws available along with taxi's from the National Monument and markets","tripadvisor_monas_266":"Masjid Istiqlal is the pride of the Muslim community in Indonesia. Its large size is be able to accommodate more than hundreds thousands of people. The mosque is located in the heart of Jakarta City and easily accessible by various public transport.Visit the mosque gives peace of mind and spiritual comfort.","tripadvisor_monas_267":"You can enter the Mosque for a visit, eevn though you are not a Muslim. As you enter, you will see a sign for the visitor centre for non muslims. Walk there, where a man will instruct you as to protocols. he will take you to the main stairs and explain you can go to the second floor balcony to...More  ","tripadvisor_monas_268":"I loved the spirituality of the Mosque. We attended during Ramadan and it was quite busy as one would expect, but surprisingly hushed and still. Attending on Idul Fitra would be amazing.","tripadvisor_monas_269":"Istiqlal Mosque is one of the biggest mosque in Indonesia and consider as Indonesia state mosque and could be consider as the biggest mosque in south east asia.Build with modern concept in the era of Soekarno, first Indonesia president, and the architect was a Christian.Located in the center of Jakarta near the Cathedral...","tripadvisor_monas_270":"The largest Mosque in southeast Asia has become a title this Mosque and the people of Indonesia has been proud of. However, one should know that there are a lot areas need to be improved.Parking ticket is electronic, but the parking attendants are not official. Not well managed parking signs and design, one might find it difficult to know...More  ","tripadvisor_monas_271":"The Mosque is huge and very impressive from the outside. once you enter it becomes even more beautiful to see it from the inside.","tripadvisor_monas_272":"Istiqlal is the biggest mosque in South East Asia (notes from some old documents). What is impressive was the architect is a non-Moslem person.Even President Barack Obama visited this mosque during his tour to Indonesia few years ago.Huge, beautiful, amazing and nice architecture.","tripadvisor_monas_273":"We have visited the mosque and had a tour throughout the whole building. It was huge and very impressive. Nice to have seen it.","tripadvisor_monas_274":"probably the biggest mosque i have been to in asia. it has 5 levels of praying area. Lotsa ppl praying but lotsa ppl just hanging around. the ablution place is clean but is slippery and old. the toilet is huge, and some are allowed to shower inside.","tripadvisor_monas_275":"Had a great tour by one of the guards at the gate. He took a small group of us around and up to the second floor balcony. On high holidays, a quarter of a million people come for...read more ","tripadvisor_monas_276":"Had a great tour by one of the guards at the gate. He took a small group of us around and up to the second floor balcony. On high holidays, a quarter of a million people come for prayer in one day. I enjoyed seeing the giant drum which was over 2 meters high, which is used when the power...More  ","tripadvisor_monas_277":"I had a wonderful, peaceful time at the mosque. It has lovely architecture and one can spend hours in its courtyard in the evening. However, it would be advisable to visit the mosque on a day and at a time when it isn't too crowded. The crowd can possibly spoil the spiritual experience for you.","tripadvisor_monas_278":"The mosque is huge, but other than that there is not much to see here. Not worth going to see by itself, unless for religious reasons. But it is close to the National Monument, Cathedral, so worth seeing while you wander around that area.","tripadvisor_monas_279":"Not a moslem, yet I found that Istiglal Mosque is a place worth a visit.Situated in an enough large area, built with park which is well-put beyond the river bridge, completed with shady trees, this mosque is both a shrine and an oase in the crowdy Jakarta.","tripadvisor_monas_280":"Went inside together with my mom. A few people came to us puling us from left to right. One older man told us he was the \"pr\" from the building. He told us to follow him to his office, there we needed to donate a gift and put on a long dress.The building is Nice to see from the...More  ","tripadvisor_monas_281":"MY GODDD!! It's a beautiful place, serene and peaceful.. You feel like in heaven because the place is so peaceful, not only for Moslem but for all religions... Although is an old place (it built in 1951 and opened for public in 1971), but they trated and very well cared by the Mosque's administrator. If you plan to go to...More  ","tripadvisor_monas_282":"the Muslim place of worship, with a building that was designed by a non-Muslim. a phenomenon that makes this mosque a symbol of diversity in Indonesia","tripadvisor_monas_283":"Istiqlal, The National Mosque of Indonesia are mean Independence Mosque, build in 1963 and finish in 1967 are located in northeast of merdeka Square. Many people usually take in pray and its very crowded on every Eid, Eid-Alfitr and Eid Adha. In there you can see contemporaray art in Indonesia. European Architecture seemed mingle in Indonesia Tradision. If you can...More  ","tripadvisor_monas_284":"An unique biggest mosque in ASEAN countries that was built my a christian architect, that shown a big tolerance between moslem and another religion in indonesia. Beside this mosque also there a beautiful gothic catholic cathedral church. We can entering this mosque while we wear a polite clothes and free of charge, the local guide will glad to show us...More  ","tripadvisor_monas_285":"This was my first trip to the mosque, located in front of Cathedral of Jakarta. When we arrived there, a Mosque administrator took us around to observe all the facilities and function rooms, and they were very complete and big, but one thing should better be considered was maintenance.","tripadvisor_monas_286":"This is the largest mosque in South East Asia, located just opposite of the Jakarta Catholic cathedral,both buildings are Jakarta's heritage buildings. It was designed by a local...read more ","tripadvisor_monas_287":"This is the largest mosque in South East Asia, located just opposite of the Jakarta Catholic cathedral,both buildings are Jakarta's heritage buildings. It was designed by a local Christian architect, with a modern style, build with local marble from Tulungagung, East Java. It can accommodate up to 200,000 worshippers . It also has a mihrab made of marble inlay made...More  ","tripadvisor_monas_288":"Ramadhan is the moment when you can feel happy even you haven't got a proper meal after breakfasting. Here you can find various foods and drinks in outdoor food court before Isya' prayer and after long hours Tarawih prayer. Inside the masjid is a tottaly different hype. You can pray solitudely while you can also hear others recite Al Qur'an...More  ","tripadvisor_monas_289":"This is a very nice mosque. It's historic, not so much in the sense that it's old, but because it symbolizes Indonesian independence. It is a very large mosque that can accommodate tens of thousands of worshipers. Friday prayers are also open to women, which is not the case in some mosques. All in all, well worth visiting, whether for...More  ","tripadvisor_monas_290":"If you want to see the biggest mosque in Indonesia, this is the place. Beautiful, clean and huge mosque just opposite the Cathedral. Really quiet, peaceful and soul searching place for everyone. It's a big mosque with 6 floors and around 250.000 people can pray together in here. It has a separate section for women for praying. Some of the...More  ","tripadvisor_monas_291":"Beautiful and huge mosque opposite the Cathedral. The authorities should seriously consider a foot overbridge to connect the two considering the large number of tourists visiting both places. Crossing the road can be a challenge.","tripadvisor_monas_292":"First of all, I'm not a muslim, but I love the diversity of Indonesian culture. Where every religion respected another religion. So, I went here to see the architecture of the mosque, also the history of it buildings. This mosque is very huge and has a great architecture. Interesting place to learn something new.","tripadvisor_monas_293":"Went to this mosque during the fasting month of Ramadhan. Learned that this mosque offers 2 separate sessions of tarawih prayers. So you can do the 8-rakaat session that starts at 7pm, or the 20-rakaat session that starts at 9pm.","tripadvisor_monas_294":"An excellence place to recuperate soul. The place is very clean and gives serene shades to visitors.","tripadvisor_monas_295":"If you want to know about Biggest Mosque in South East Asia, here it is the place. I'm very excited when I visiting this place to pray. It's a big mosque with 6 Floor and 250.000 people can pray in here together. And you can feel the peace when you visiting here. Also, they have shoe locker for free.","tripadvisor_monas_296":"The mosque is very big, not the most beautiful. Visitors are welcome in the guest room. A man welcomed us and gived us a light cloth to wear. We could walk everywhere, except on the prayer mats.","tripadvisor_monas_297":"This Mosque is a biggest mosque in Indonesia and located adjacent with A Catholic Cathedral. this a symbolized of harmony.worth to visit this mosque.","tripadvisor_monas_298":"If you want to see the grandest mosque in Indonesia, this is the correct place.The architecture is excellent and also some area is equipped with AC.","tripadvisor_monas_299":"The largest mosque in Southeast Asia is one lighthouse at Soekarno era . Built with materials chosen and now the Islamic center in Jakarta . Never be devoid of pilgrims from within the city or outside the city , even from abroadOne of my own happiness when children of the village can explore the beauty of this building ....More  ","tripadvisor_monas_300":"An amazing experience when I prayed at this mosque, a good and clean toiletries, a nice place, and for sure the great and wide mosque.","tripadvisor_monas_301":"This Mosque is a biggest mosque in Indonesia and located adjacent with A Catholic Cathedral. this a symbolized of harmony.worth to visit this mosque.","tripadvisor_monas_302":"we took bus nr 2 and went first around the City of this sideand then we went off on Istiqual stopA priest showed us the Place totallywe paid hin 40000 R","tripadvisor_monas_303":"Beautiful mosque and a blessed gathering in the presence of one of the jewels amongst the scholars of IslamCan be difficult exiting due to crowds but worth attending Sufi events","tripadvisor_monas_304":"The sheer size will definitely overwhelm you and it's definitely something to check out. Be sure to bring wet wipes to wipe your feet after you're done.","tripadvisor_monas_305":"A wonderful building with architectural features echoing the symbolism of its function. Read up before you go or find a guide to explain the nuances of the building - facinating.","tripadvisor_monas_306":"Istiqlal Mosque/Masjid, a National Mosque, the largest mosque in the Southeast Asia region, next to Merdeka square and the Cathedral in Jakarta, Indonesia, designed by a Christian Architect from North Sumatra was built with a capacity of 1,20,000. While Sukarno laid the foundation stone in 1961, inauguration of this marvel was done by President Suharto in 1978.The mosque with...More  ","tripadvisor_monas_307":"A very grand mosque with huge Centrum and beautiful place for the cleric. A must visit for the first time going to Jakarta it is a center piece and there's a church overlookingshowing the tolerance of Muslims","tripadvisor_monas_308":"This is the biggest mosque in Indonesia. Located at Lapangan Banteng, not far from President palace and Pasar Baru. It is multi storey, and very beautiful decoration inside. There...read more ","tripadvisor_monas_309":"Actually outside if this building was so dirty, there were a lot of garbages, cans, plastic bags on the ground..... that is most biggest one and dirtiest one at the same time in Asia. outside veiw is so bad","tripadvisor_monas_310":"Went here with a few colleagues during a business trip. When we arrived the people in front of the gate was not so friendly to us. We were directed to the information center by one of them. There was no real sense of hospitality during our visit. The mosque is gigantic but we felt there was no spirituality in the...More  ","tripadvisor_monas_311":"This is the biggest mosque in Indonesia. Located at Lapangan Banteng, not far from President palace and Pasar Baru. It is multi storey, and very beautiful decoration inside. There is spacious space for parking, and souvenir shops outside it.","tripadvisor_monas_312":"Visited the mosque on a study tour to learn about intercultural understanding. As a western woman, was a little concerned about whether we would be welcome? No problem but we were only allowed to view the mosque from the visitor balcony. Still amazing, peaceful and a cool sanctuary on a hot day. Be mindful of modest dress and appropriate behaviour.","tripadvisor_monas_313":"The mosque is big but has a very industrial look to it unlike the smaller more beautiful mosques in the city. With the limited number of tourist attractions in the city it becomes a quick check off more than anything else.As a non Muslim tourist, you're taken aside and explained a bit about the history of the mosque in...More  ","tripadvisor_monas_314":"My first time here and hadnt had the chance to have shalat there because I'm having my period (TMI, I know). The mosque is big consist of 5 story building. Husband said decoration inside is very beautiful.So I only managed to eat in front of the mosque near the carpark. Lots of food stalls and also souvenirs seller such...More  ","tripadvisor_monas_315":"This is one Giant Mosque.We went there in last July. It was a sunny day. You had to take off your shoes to enter this Mosque. Lucky for us we had got friend who didn't enter, so he could guard our shoes for us. Some says one can't enter without full pant. However, me and two of my friend could...More  ","tripadvisor_monas_316":"we entered a mosque to be immediately greeted by a clerk or imam saying we cannot go alone because we are muslims - we need to be in a company of a muslim. this is such a big nonsense - i lived 4 years in turkey and imams are warm and welcoming and of course you can enter the mosque...More  ","tripadvisor_monas_317":"My family visited there during the Ied Mubarak holiday, so it was quite packed.Yes, it has got a historical and architectural values, still, it is a mosque, the place for Muslims to pray; it should be clean. When I visited there, I found it was not clean. This was because of the irresponsible visitors who consumed snacks and drinks...More  ","tripadvisor_monas_318":"Istiqlal is a beautiful and biggest Mosque in Asia. I liked to pray in here, but to be honest i don't like with the local staff because they ask for money for the facilities that they provide.","tripadvisor_monas_319":"When you are in the largest Muslim country in the world, you have to go to the Mosque. Istiqlal is amazing. You can actually go at Friday prayer time too which is an amazing...read more ","tripadvisor_monas_320":"When you are in the largest Muslim country in the world, you have to go to the Mosque. Istiqlal is amazing. You can actually go at Friday prayer time too which is an amazing experience. Parking as Alan's an issue but nothing a good driver can't handle. Dress with respect, no shoulders, no shorts etc","tripadvisor_monas_321":"So cool and beautiful. You will be guided by one man who explains about the building in english and takes pictures for you when you enter then charged a little amount of money when finished the visit. Women and men pray in seperate and garmet requirement is different... anyways tourist visitors won't be guided to prayers area...Just the building...More  ","tripadvisor_monas_322":"İt is the biggest mosque in asia, in front of the oldest cathedral of asia, you can visit and pray there and also it is designed by a french architecture without walls for a natural air condition","tripadvisor_monas_323":"A really amazing mosque with great architecture and surprisingly modern despite its age. There are 5 floors, 12 pillars and many other cool things in this mosque","tripadvisor_monas_324":"One of the biggest mosque in Indonesia, the design is simple but awesome. It is a nice place to do your praying for Islamic people.","tripadvisor_monas_325":"a very quick tour where the guides appeared more interested in their tips than the guests.however it is a beautiful mosque although modern not old and extremely large.","tripadvisor_monas_326":"Our friends brought us here, although simple in style and architecture, it was gorgeous. We had a wonderful time walking around and trying to imagine it at capacity with 200,000 people. There are no gardens on grounds, however, the green dome draws you in.","tripadvisor_monas_327":"This is a must see sight and its 4 hectare site is most impressive. Foreigners have to register and be guided for which a donation of 40 or 50 rupiah is expected. The only difficulty I had was that my so called guide was unintelligible despite his insistence that he was speaking English. The tour takes around 30 minutes and...More  ","tripadvisor_monas_328":"It's the biggest mosque in the south east Asia but as we are tourists we have to pay to enter. They request a donation (?) not an entrance fee but the minimum is 10.000 rupiah. As long as you are properly dressed to can walk around. Not well dressed and you get a \"bathrobe\" on. Tourists can walk on the...More  ","tripadvisor_monas_329":"Istiqlal is one of the must visit venue if you are in jakarta.But if you were non moslem, i'm affraid that you could not get aglimpse of its grandness. Since to trully appreciate the buildinag, you need to venture inside to the prayer room.You could see the grand design and breathtaking architecture from the 60's where even in...More  ","tripadvisor_monas_330":"Went there with my girlfriend. Its close to the Jakarta Cathedral and would recommend combining these two attractions. You can just go there and join the tour, because there a...read more ","tripadvisor_monas_331":"Despite that it's a great place, but out of context of the mosque it self... it's very annoying to be there. With the poor people outside the building, and not mention with the local staff, so rude. Because I'm local too but the way he spoke, it just keep in mind all the time. If u want to introduce how...More  ","tripadvisor_monas_332":"Big, very big! You must visit the chatolic church that is in front of the mosque to feel the contrast and remind that religions can co-exist","tripadvisor_monas_333":"Went there with my girlfriend. Its close to the Jakarta Cathedral and would recommend combining these two attractions. You can just go there and join the tour, because there a several per day and they just start when there are enough people. We only had to wait 5 mins. Clothing isnt a problem, you will get appropriate clothes when entering.","tripadvisor_monas_334":"This is a more modern mosque than those visited on European trips. Simple but striking construction. We're able to take photos inside.","tripadvisor_monas_335":"This is a mosque that can hold more than a hundred thousand of worshippers. Huge mosque! Airy and spacious. Great history behind, that's interesting to learn, showing the symbol of religious harmony in Indonesia.There's always room for improvement though, especially on cleanliness & organization, parking, etc. Traffic in front can be very bad on Friday.","tripadvisor_monas_336":"It was nice to walk around and see how they fit their religion in their daily life. Someone who worked over there spoiled our experience over there by asking more money than the big enough tip he already got. A shame!","tripadvisor_monas_337":"Im not a Moslem but to visit Istiqlal was good experience, I was accompany my friends whom tourist, great building. But NOT GOOD things was when the staff asked for donation and we want to put on the box donation the staff said better just give to him so he can share with staff there... so not good to hear...More  ","tripadvisor_monas_338":"The first time I have ever visited a mosque was an interesting experience. I was shown around by a helpful guide and it was a great way to spend half an hour, seeing one of Jakarta's must see sights","tripadvisor_monas_339":"I always visit this mosque when muslim have islamic celebrate.Like ied fitri, ied adha, and jum'ah praying.","tripadvisor_monas_340":"We visited the missie but were not too happy with the authoritative approaching by some of the staff members. We were brought to a special room where w had to give a donation before we could lend an unfresh smelling gown and tegen we were unfriendly told where we could go. So different was the experience when we also visited...More  ","tripadvisor_monas_341":"Large mosque built in the 1960s with several levels from which to view the large dome (inside) and city skyline (outside). It is cool and airy, with lots of windows and spaces...read more ","tripadvisor_monas_342":"I was in Jakarta for a business trip and hence checked out tripadvisor for the top attractions. This mosque came second after grand Indonesia mall. Since I had no interest in checking out a mall in Jakarta I went to the mosque. The first thing that strikes you is that it is huge. Very simple and elegant design. The housekeeping...More  ","tripadvisor_monas_343":"Large mosque built in the 1960s with several levels from which to view the large dome (inside) and city skyline (outside). It is cool and airy, with lots of windows and spaces allowed the breeze to filter through. Entry is free but a donation was requested. As a foreigner and non-muslim, I was escorted to a visitor's area and asked...More  ","tripadvisor_monas_344":"I was very excited to visit Istiqlal Mosque because of the rich history and the status surrounding this mosque. It is the 3rd largest mosque in terms of capacity in the world after Mecca and Medina, and the architecture is unique in the sense that it was designed by a Christian.A majestic structure, the inside was airy and a...More  ","tripadvisor_monas_345":"Must visit Mosque in Jakarta. Beautiful and huge mosque came across in South east Asia. One can feel the grandeur once you are in the main prayer hall.","tripadvisor_monas_346":"Worth to visit when you are around National Monument (Monas), it is walking distant from Monas and you can also visit Cathedral just in front of this mosque","tripadvisor_monas_347":"This mosque is one of the places to visit if you are in Jakarta. The mosque do not require you to cover up if you are non muslim however decent cloths is required. Eg, long pants and no sleeveless shirt. You can get a plastic bag outside with donations payment amount (up to you) for your shoes if you wish...More  ","tripadvisor_monas_348":"you will immediately feel the grandeur of the mosque, while you're at it, make your prayers more kusyu worship. Located just opposite the Church Khatedral as a symbol of togetherness and Religious Harmony, because what often happens is: when Muslims carry out the Friday prayer, and when the parking of vehicles in the area of the mosque is not sufficient,...More  ","tripadvisor_monas_349":"This is one of the biggest mosques in the world, it is one of Jakarta's land marks, visiting is a must if you were ever in Jakarta.","tripadvisor_monas_350":"Very big mosque can fullfill much people prays. It has a very nice architecture. You can ask for taking a picture on The Mimbar, where the speakers usually stand while Jum'ah pray, to the guard who guides and tells you about the detail of Istiqlal","tripadvisor_monas_351":"Beautiful grand mosque. Do not forget to see the gift from Sultan of Brunei in the courtyard. Apparently the mosque has 5 levels (one for each Level of Islam) and 12 pillars (for 12 Rabbi-ul-Awal. Prophet's birthday). There is also a \"conspiracy\" theory about having \"crosses\" in the mosque's design.Overall an interesting visit. Ask one of the mosque's guards...More  ","tripadvisor_monas_352":"Visited the mosque as part of a Jakarta day trip and it's amazing! Highly recommended. The place is very grand and you can freely wander around inside to enjoy the architecture...read more ","tripadvisor_monas_353":"I was astonished by its size, it is really big and well maintained. The wudu area is spacious as well and quite comfortable to get around. I had a great experience visiting and praying there.You can also get a picture of the Monument from the open areas of the mosque, especially nice at night since the monument lights up....More  ","tripadvisor_monas_354":"You would think that the 3rd biggest mosque in the world would be special, a sight to behold with plenty to see.You would think wrong.Upon arrival you are shuffled into an office where a man attempts to get donations out of you with the subtlety of a giant red flag with words that say \"whatever you want to...More  ","tripadvisor_monas_355":"Istiqlal Mosque is the 3rd biggest mosque after Jeddah & Medina. It is a grand, airy and peaceful building. It was designed by a christian architect who won the design competition and took 17 years to complete. The prayer hall can accommodate 50,000 people and has a very beautiful dome overhead. We had a local mosque guide take us around...More  ","tripadvisor_monas_356":"I attended the mosque for evening prayer. It is a very big mosque and the dome (from the inside and outside) is breathtaking. The prayer area is beautiful. One of the most beautiful mosques I have visited. It is very clean. A must-see in Jakarta.","tripadvisor_monas_357":"Visited the mosque as part of a Jakarta day trip and it's amazing! Highly recommended. The place is very grand and you can freely wander around inside to enjoy the architecture. They provide a very nice batik kimono which you can wear if your arms and legs are not covered.","tripadvisor_monas_358":"An iconic structure. It is close to MONAS and cathedral. Cathedral and the mosque side by side is good sign of religious harmony","tripadvisor_monas_359":"This mosque is a big building and very open. An impressive structure which was designed by a Christian man in a competition. The building does not have much too it so you are told to whizz around it in 20 mins. At the end you are taken into a room and asked to make a dontation....not in the donation boxes...More  ","tripadvisor_monas_360":"We were amazed by the grandeur of the mosque. The mosque is the third largest one after the holy place of Mecca and Madina.","tripadvisor_monas_361":"The main purpose on our visiting to Masjid Istiqlal is doing prayer there or 'heart travel'. As a mosque, it has several kinds of room such toilets near wudhu (ritual ablution before prayers) area on the ground floor and huge main hall for doing prayers that has levels like mezzanin as prayer spaces on sides . Visitors should ask the...More  ","tripadvisor_monas_362":"Definitely a must visit for everybody in Jakarta. It is a very spacious mosque, with open air. Very breezy during the day and night. The dome design is amazing, with bronze finish and callighraphy all around. Please wear a proper attire as you visit this mosque or else you will be ask to wear a cloak (doesnt look good if...More  ","tripadvisor_monas_363":"This is a really big mosque and its a universal mosque of Jakarta. The mosque is huge, spacious and clean. It is definitely a worthwhile visit. You get to see the beautiful...read more ","tripadvisor_monas_364":"One of icon of Jakarta City. This mosque is very big and nice. The condition of air is very refreshing. The water, too. The room is very wide. When Friday come, it will become crowded enough because of prayer. Not only for muslim, other believer can enter this place for site seeing.","tripadvisor_monas_365":"Feel peace, big place and i enjoy listening reading al quran from this mosque. structure and good architecture","tripadvisor_monas_366":"marvelous, amazing , clean , near pasar baru very big mosque , and Indonesian people very friendly, many tourist too like us come and see marvelous mosque","tripadvisor_monas_367":"This is a really big mosque and its a universal mosque of Jakarta. The mosque is huge, spacious and clean. It is definitely a worthwhile visit. You get to see the beautiful architecture and experience the peaceful feeling inside. Try to dress modestly so they can allow you to go inside without having to wear robes. There is a storage...More  ","tripadvisor_monas_368":"This mosque is one of the biggest mosque in Indonesia. The place is huge enough and place for wudhu is spacious and clean. The bad thing is there are many people sell a plastic bag infront of the mosque and they tend to insist the prayer to buy. And also the mosque is near eith river but the river condition...More  ","tripadvisor_monas_369":"biggest mosque in the Sout East Asia, little run down but considering the amount of people that pass the doors no wonder. it is amazing to think that 200000 people can fit into it. the structure is something to be seen.","tripadvisor_monas_370":"Wow this is the biggest Masjid in Indonesia. I can pray at it almost the time I want to. Because it is near form hotel.","tripadvisor_monas_371":"Suggestive place. The foreign have to enter with a tunic that they give to you. After that you can go on the terrace inside to seethe people who are praying. It's possible to take pictures.","tripadvisor_monas_372":"this mosque is big, it was the biggest mosque in southeast asia back then. It's magnificent and enormous, you'll feel that when you enter the main praying room. The lightning on the ceiling under the dome feel magical. But those feeling will shattered when you go into men bathroom, it stinks. And if you look closely, there are many trash...More  ","tripadvisor_monas_373":"This is the biggest and monumental mosque in Indonesia. with a beautiful architecture in down town at DKI Jakarta. always have many activity like premantary school, religi and many else...come and see the activity here...enjoy the religi spirit :)","tripadvisor_monas_374":"Despite the hustle and bustle outside in Central Jakarta, once you set food inside this mosque you are greeted with a glorious wall of silence. Architecturally stunning it is...read more ","tripadvisor_monas_375":"Mosque is huge and beautifully built, situated very close to the hotel we stayed in. Dome is beautiful","tripadvisor_monas_376":"It is a big imposing structure but not much architectural impact. It is an important part of Muslim worship.","tripadvisor_monas_377":"Situated a quick taxi ride away from the CBD, this is a behemoth of a mosque, done in 60s architenctural brutality. It’s interesting to see the flagship mosque of this moderate Islamic country and it’s conveniently set just near the Independence Monument and the main cathedral in the city. If you have an hour to kill, check this place out,...More  ","tripadvisor_monas_378":"Despite the hustle and bustle outside in Central Jakarta, once you set food inside this mosque you are greeted with a glorious wall of silence. Architecturally stunning it is definitely worth a visit","tripadvisor_monas_379":"Passing by the city center was the Istiqlal Mosque. I understand that this mosque have fans only but according to my driver, whoever go inside this mosque will not feel any heat though using fans.","tripadvisor_monas_380":"Visited here during the main prayer time of noon on a Saturday. It was mobbed, which was kind of neat. The dome is beautiful, but compared to some other mosques I have been to, the building itself is quite utilitarian.Remove your shoes when entering. I paid 1000 IDR (about 8 cents) to a woman outside for a plastic bag...More  ","tripadvisor_monas_381":"Doesnt matter which religion you belong to. This massive building is worth to see, and hear it. It is the biggest mosque in whole south east asia. I must admit that from outside it's not very spectacular, rather architecturally straightforward. But inside it is with his metallic elements very impressiv. At the mainentrance you have to put your shoes in...More  ","tripadvisor_monas_382":"Great masjid in the middle of busy and crowded city. It reflect the government faith and Islam is one of the poplar religion in Indonesia.","tripadvisor_monas_383":"nice the istiqlal .....i am come back again for laterand than i will always remember usee u ... thank you","tripadvisor_monas_384":"Built in 1978, this is the biggest Mosque in South East Asia with an impressive capacity of 120,000 worshipers and measuring 1,020,000 sq ft in size. The interior is impressive with spectacular architecture and wide open spaces under the dome. Visitors are welcome and are provided with a guide and appropriate robes to cover common street clothes out of respect...More  ","tripadvisor_monas_385":"The architecture is awesome. The location is good. And Obama also Michelle Obama went this on 2013 while in Jakarta.","tripadvisor_monas_386":"The architecture is awesome. The location is good. And Obama also Michelle Obama went this on 2013 while in Jakarta.","tripadvisor_monas_387":"Visited this mosque as part of a walking tour. I'm told it's one of the few (if not only) mosques in Jakarta to welcome tourists. If you're wearing shorts , they provide you a gown to cover up. A donation of IDR 10,000 is expected to allow you to keep your belongings in the VIP room.You get to see...More  ","tripadvisor_monas_388":"It is one of jakarta city landmark, located in the center of the town make it easy to come here. It is become main mosque to celebrate Idul Fitri and idul Adha, two major islamic holiday in Indonesia, the president of Indonesia and his/her staff usually come to celebrate also here to do idul Fitri and Idul Adha praying.","tripadvisor_monas_389":"The building is something to behold. Its size is impressive. The 60's vintage architectural design is very nice: clean, open and breezy. The twelve metal (aluminum?) columns are especially noteworthy. Our guide was cordial, and took great pride in the fact that the mosque had been visited by quite a number of luminaries, including Bill Clinton, Barack Obama (naturally) and...More  ","tripadvisor_monas_390":"For us this is the one visit you have to do if you have limited time in Jakarta. And almost free (you choose whatever donation you give).","tripadvisor_monas_391":"I am not the one to go see mosque or churches unless there is soethng special about them. This place is huge. If you want to see only one mosque in your trip, this worth it. It is very plane but very important in the heat of the locals and all muslims. Obama goes there on his visits and many...More  ","tripadvisor_monas_392":"the biggest mosque at Jakarta, its offering free breakfasting food to the huge number of moslems at ramadhan month. We can also found that this mosque is next to the catholic church which is a symbol of unity in diversity. This place is not a recreation place, just for pray then you can continue your journey.","tripadvisor_monas_393":"Very nice place and a must visit if you are in Jakartathe staff is very helpful and kind. I liked it and i definitely recommend it","tripadvisor_monas_394":"was there for a few hours because we had to wait for a train and the site was nice. friendly people and yes an amazing building","tripadvisor_monas_395":"The Mosque is really beautiful, especially from the inside. The guide's English could be better and it would be nice if you could walk in the prayer room itself.","tripadvisor_monas_396":"If you're a muslim, you ought to come here. It is the most famous mosque in the country. If you're not a muslim, you can enter if u wear a decent/modest attire and pls have a wash...read more ","tripadvisor_monas_397":"We went there to see the mosque based on Internet searches. The tourists have to be accompanied with a guide/security personnel if not Muslim. Our guide Imron was very helpful with showing the mosque and telling about the Islamic life of the Indonesian people. Shorts below the knees is required for both genders but was the only requirement for entering...More  ","tripadvisor_monas_398":"This is a modern mosque a symbol on Independent Indonesia. Its large and well maintained. Its open minded and true representation of Indonesian Islam.2 churches in the neighbourhood, no restrictions on non Muslims., A place of peace harmony and learning","tripadvisor_monas_399":"The Istiqlal Mosque is the third largest Mosque in the world. This mosque, including the outside courtyard, can accommodate 200,000 worshippers! (The first and second largest mosques are both in Mecca.)It was difficult to capture the massiveness both of the interior and of the exterior. The mosque, completed in 1978, is quite modern looking in comparison to every other...More  ","tripadvisor_monas_400":"This review is from the perspective of a Western, non-muslim tourist. If you are visiting the mosque as a believer, your experience will be different.This mosque is absolutely worth a visit, but you don't need more than 30 minutes.Entering the mosque, staff pointed me in the direction of the information desk. By the desk, an enthusiastic and smiling...More  ","tripadvisor_monas_401":"If you're moslem, this mosque is a must visit place for your prayer times. If you're not, it's still okay to get in here, just make sure if your a girl, cover your body parts, hair still okay, but cleavage and or short pants are not allowed.The mosque is so huge, it'll blow your mind. And it's located just...More  ","tripadvisor_monas_402":"Every year muslims have a prayer after finishing a month of fasting , as a muslim i went there to pray this prayer , its about the sunriseMy friend from ukraine and mexico joined me .The place was perfectly securedA lot of people sharing happinessThe uniqueness of the building and you can see the cathedral from...More  ","tripadvisor_monas_403":"I'm from Malaysia and this is the biggest mosque I've ever seen. According to the guide, it can accumulate roughly 120,000 people in one prayer session. Amazing right. All religion are welcomed by them. I'm a christian guy btw. So, if you want to have some different experience, do visit this place.","tripadvisor_monas_404":"Went here with my family for afternoon prayer. Arrived 1 hour before so we can sightsee the mosque. The architecture was quite old and dusty. The cleansing area (wudlu) was dirty and smelled awful. The main praying area was too crowded. A lot of the people was just sitting around and some of them even was sleeping and eating. Tried...More  ","tripadvisor_monas_405":"The most huge and beautiful mosque in Asia. There is no partition between Muslim and Muslimah in it can see how they perform prayer. They will give robe to wear.","tripadvisor_monas_406":"If you're a muslim, you ought to come here. It is the most famous mosque in the country. If you're not a muslim, you can enter if u wear a decent/modest attire and pls have a wash /wudhu before entering the pray room. Taking pictures using phone & pocket camera is allowed. Downside: there are many homeless/ sellers right outside...More  ","tripadvisor_monas_407":"We visited this impressive mosque in Ramadan. It had such a spiritual atmosphere than you can't imagine. I'm sure that it is one of the biggest mosques I have ever visited.","tripadvisor_monas_408":"Definitely worth seeing. Entrance to the east of the mosque, where visitors receive a long komono-like dress and you can dump your shoes. The central mosque is huge and the tour guides are very helpful and speak good English. Tip them before you get back to the changing room though as they won’t be able to accept the tips in...More  ","tripadvisor_monas_409":"It's very comfortable to pray there with all the facilities. I just like didn't wanna go home after visited this beautiful and amazing place!","tripadvisor_monas_410":"We visited this impressive mosque in Ramadan. It had such a spiritual atmosphere than you can't imagine. I'm sure that it is one of the biggest mosques I have ever visited.","tripadvisor_monas_411":"it is sukarno design. very majestic. see the ornament inside and you can feel the uplifting emotion near God.","tripadvisor_monas_412":"All are welcome to visit this mosque regardless of religion. It was a very interesting experience for me; I learned a lot! It's a beautiful building, and it's size is amazing! It was also interesting to note differences between this mosque and others around the world. A couple pieces of info on dress...take your shoes off before you enter the...More  ","tripadvisor_monas_413":"As a westerner I felt privileged to be allows to wonder through this magnificent Mosque. Several years ago I had visited with a guide that gave me an incite into its workings, but this time I was permitted to walk through freely and contemplate this building in peace. I wore long pants and a shirt that covered my shoulder, and...More  ","tripadvisor_monas_414":"I went just there the end of Edul Fitri and I spent more than one hou inside. The mosque is impressive, biggest one in SE Asia and modern.Service is well organize and better to set up a guide that follow you inside and explain you something about this interesting place.Short visit but do not miss it.","tripadvisor_monas_415":"The Biggest Mosque in Jakarta. Near Monumen Nasional and Gambir Train Station. Some Presidents of Indonesia do Pray Iedul Fitri at Istiqlal Mosque. It's comfortable Mosque. Using Air Conditioner and Clean. Every people are permitted to come in this Mosque. The room for purification (berwudhu ) is big. So many tap water in the room. The mosque is supported with...More  ","tripadvisor_monas_416":"This mosque has no door,tha's why the air circulation is veey nice.The architecture is very sophisticated and beautiful. It is more likely that you spend your times here to do praying or just sitting since it has a very comfortable ambience.","tripadvisor_monas_417":"I have been to this mosque twice and both times learned something new. There are guides near the entrance who will take you through the mosque sharing elements of the architecture and symbols related to both Islamic tradition and Indonesian independence.It is required to wear a robe (provided) if you have on shorts or exposed shoulders. There is a...More  ","tripadvisor_monas_418":"This building really exemplifies the faith of the Muslim population in Indonesia. A capacity of over 200,000 praying at one time, incredible. I have always been impressed with...read more ","tripadvisor_monas_419":"This building really exemplifies the faith of the Muslim population in Indonesia. A capacity of over 200,000 praying at one time, incredible. I have always been impressed with the tolerance and acceptance of religious diversity in the world's most populous Muslim nation. But I was truly impressed when the tour guide pointed out that the architect for this Mosque was...More  ","tripadvisor_monas_420":"I spent an hour there, the mosque is gigantic (biggest one in SE Asia)View on Jakarta skyline and Monas is good from there when you are climbing from a floor to anotherI met a very friendly Indonesian woman who took me around do not hesitate to bound with people there","tripadvisor_monas_421":"This mosque was built in the sixties and I never imagined, as a non-muslim that I would be allowed to go in. But the tour guide took us there and showed us the inside and the history of the mosque. It was beautiful inside!","tripadvisor_monas_422":"Location is great. A huge mosque in the centre of Jakarta. Ask everyone on the street for direction and they will definitely know this mosque. The architecture of this place was amazing. Felt the calmness.","tripadvisor_monas_423":"Praying in this grand mosque bring such a different experience.Its location in the center of the city with many transportation access will make us easy to reach. Please use a proper and full cover dress (espc for women)","tripadvisor_monas_424":"Very nice and peaceful place to walk around in....there are small market stalls and restaurant carts nearby!","tripadvisor_monas_425":"Istiqlal (Arab for Independence) opened in 1978, and is Indonesia's National Mosque and is situated next to the huge, beautiful Merdika Square.The interior has 2 large Prayer Halls, with 4 levels of surrounding balconies and with 7 entrances. Most noticeable though are the 12 huge, ribbed stainless steal pillars and the golden dome.The Istiqlal Tower consists of a...More  ","tripadvisor_monas_426":"This is one of the biggest Mosque in Jakarta and often used for many Muslim ceremony and formal activities related to it.","tripadvisor_monas_427":"Wonderful mosquelocated near church and others old and historical area.Must visit each going to Jakartaalso should come to old town Jakarta Batavia","tripadvisor_monas_428":"You should go there to visit at least once to see its grandeur. They have an English-speaking guide available who will bring you around for a 20 min tour in the place. At the end of it, he will expect a tip so do have some small change with you.","tripadvisor_monas_429":"Nice mosque. Managed to enter and saw Friday prayer session. Good to see once if you have time in jakarta.","tripadvisor_monas_430":"Alhamdulillah visited here in 2011. A very spacious and epic masjid. Amazing huge dome and great pillars. Many levels to fit many people. Come and visit and perform Solat here.","tripadvisor_monas_431":"This is one of the biggest mosque in asia, and the unique thing is that it was designed by a christian (demonstrates diversity and peace). It is also right across the jakarta cathedral (so two birds with one stone visit!).Unlike the mosques in istanbul, this is mosque is less equipped for tourists. So if you come in with shorts,...More  ","tripadvisor_monas_432":"Don't loose your time (even if there is not much to do in Jakarta).I was with a friend of mine and they didn't want to let me go inside simply because of my short.I've been in many many mosques around the world - Abu Dhabi -Istanbul - Marrakech - Dubai and they all provide you something to cover...More  ","tripadvisor_monas_433":"Nice mosque. Managed to enter and saw Friday prayer session. Good to see once if you have time in jakarta.","tripadvisor_monas_434":"As Southeast Asia's largest mosque, the Istiqlal Mosque is always visited by visitors either from inside or outside the city even from outside the island of Java. Facilities at this mosque is very complete to support the Muslims worship.","tripadvisor_monas_435":"I love this place. I came for a Friday pray. Everything are well organized.I feel cold air even no air conditioner in the main hall of this mosque, so comfortable.","tripadvisor_monas_436":"It seems the mosque was built a long time ago and not a major renovation was done after that. It is quite big and as expected the atmosphere serene.","tripadvisor_monas_437":"This is the number rates thing to do in Jakarta for a reason. One of the most amazing experiences of my life. Try and get there at a pray time especially Friday.","tripadvisor_monas_438":"AWESOME! every detail of the mosque has its nationalistic value/symbol! the mosques is really big.Interestingly, it's built in front of the largest catholic church in Indonesia!Really the symbol of unity isn't it? :D","tripadvisor_monas_439":"I like visiting Istiqlal MosqueSo quite and love the architecture over there.If you are traveler who like history and also nice architecture you should come to this mosque.","tripadvisor_monas_440":"This mosque is well worth a visit. It can hold thousands of people, it's vastness is impressive, while still looking understated but beautiful. Right across the street from the...read more ","tripadvisor_monas_441":"This mosque is well worth a visit. It can hold thousands of people, it's vastness is impressive, while still looking understated but beautiful. Right across the street from the catholic cathedral also worth a visit.","tripadvisor_monas_442":"the expanse of this mosque is mind-boggling. Only thing that would be better than getting a look inside between prayer times would be to see it at maximum capacity during ramadan. Architectually simple and beautiful. No fee but donations welcome. Also a catholic church right across the street also worth a visit","tripadvisor_monas_443":"That was my first time to visit the Muslim Mosque and there is the biggest Mosque at South East Asia Country, feel very peaceful and I was sit somewhere in there for a rest and feels very quiet, but remember to take off the shoes before goes in and go to the guest room to put your belongings before you...More  ","tripadvisor_monas_444":"Stunning modern mosque. Will give foreigners a better understanding of Islam and the power and beauty of religion in Indonesia. Also, free and doesn't take more than 30 minutes to explore, so great to combine with other day trips in Jakarta.","tripadvisor_monas_445":"Epic mosque that Jakarta very proud to have. It's one of the biggest mosque in Indonesia that everyone should come and visit, but it's little bit too crowded and beware of pick pocket and thief.","tripadvisor_monas_446":"As soon as i walked in the door I was ushered to the visitors registration desk. The guide gave me a robe to wear around the mosque as he gave us an amazing tour for only 10,000 Rupiah","tripadvisor_monas_447":"We were told that this modern style mosque was the 3rd largest in the world after Median and Mecca and on important holidays could hold some 600,000 people inside and in the surrounding enclosed grounds. It includes a madrassa. The prayer spaces are also modern with women on the left side of the main hall and men to the right....More  ","tripadvisor_monas_448":"as a big,there are many visitors coming to the mosque,safety is the important concern belong to the every guest","tripadvisor_monas_449":"Be sure to cover up properly, however, they can lend you a shawl. Helpful guides will show you around for free. Just remember, that it is full for Friday prayers.","tripadvisor_monas_450":"It's huge. Not as picturesque and placid as the Cathedral across the street. I've been to mosques all over the world and this is just big. End of transmission.","tripadvisor_monas_451":"They have 'tour info guide' who will show you around and tell you the history and the tale of Istiqlal, personally, i like hearing the information, but if you're foreigner and...read more ","tripadvisor_monas_452":"Large-scaled mosque, interesting experience about different culturesDonation was like obligatory, at least 50k Rupiah for one person","tripadvisor_monas_453":"They have 'tour info guide' who will show you around and tell you the history and the tale of Istiqlal, personally, i like hearing the information, but if you're foreigner and don't understand Bahasa, I strongly suggest you to bring one, because it is meaningless to visit this place without understanding the story :) also,bring your own plastic bag to...More  ","tripadvisor_monas_454":"If you are muslim, come and visit on Friday 11.30 am, for sholat. Otherwise you can visit on the other days.","tripadvisor_monas_455":"We went to visit the mosque on a Saturday and where directed to information upon our entrance where a guide was there to show us the mosque. The visit took less than 30 minutes and you pay what you think it is worth at the end of it. We saw the main praying room with the big dome and also...More  ","tripadvisor_monas_456":"There is nothing disliked, everything is sound peace, harmony, cool, relax and supporting our spirit to arise our pray and hope directly to our creator, Al Mighty Allah SWT","tripadvisor_monas_457":"This is the biggest mosque in SE Asia and for those who are not familiar with mosques, an interesting place to go. At noon prayer time on a Friday, it is the most crowded. You can go upstairs to watch the main floor (sharing the upstairs with the women who are not allowed on the main floor). It is packed...More  ","tripadvisor_monas_458":"Location near National Monument and Gambir Station. Do Not forget to visit Istiqlal Mosque. The Big Mosque in South East Asia. You feel \"wow\" effect if you inside this Mosque due the very very big.The roof top so many \"kaligrafi\".So many place for wudhu.Every day many people visit this mosque for \"shalat\".","tripadvisor_monas_459":"Very big mosque and clean. Parking space very big. I recommended for every visitor to visit istiqlal mosque. Every friday will full of jamaah for friday pray.","tripadvisor_monas_460":"We were really well looked after when we visited the mosque. You go to a tourist room where you leave your shoes and can get some extra clothing if you are not appropriately dressed. You then sign the visitors book and make a contribution (I can't remember how much the minimum was, but it was very reasonable especially since you...More  ","tripadvisor_monas_461":"I love it here. The atmosphere is just perfect to have quite & quality time with Allah. The thing that need to improve is just their wudhu place u___u just expect to be cleaner & smell nicer.","tripadvisor_monas_462":"you must pray on it, but your shoes down and keep it till finish the pray. it seems that people there have a lot of activity to do but actually I didn't stay a lot on it","tripadvisor_monas_463":"The main hall of the mosque is very beautiful I could stand there for a while not wanting to leave. It gives me very peaceful feeling. But, I am not Moslem, I am Buddhist myself. The cleric there was very kind too, he took us around and gave us the information of the building. Note: wear clothes that cover your...More  ","tripadvisor_monas_464":"you must pray on it, but your shoes down and keep it till finish the pray. it seems that people there have a lot of activity to do but actually I didn't stay a lot on it","tripadvisor_monas_465":"A few really neat things about this Mosque. Firstly it was designed by a Christian guy, secondly it's only about 40 years old, thirdly it's really big!Personally I enjoyed the architecture of the Mosque a lot, my only point of reference is the Hagia Sophia so of course this is extremely different.When you enter the Mosque the security...More  ","tripadvisor_monas_466":"A relatively new mosque, built in our time. I visited this mosque with my parents and my two young children. We were obviously tourists with my father and I wearing shorts. So we were instructed to go to a small room where my father and I put on long robes. A guide then took us around and explained to us...More  ","tripadvisor_monas_467":"As a preface, this is one of the first mosques I have visited. I found it to be a lovely experience, especially to witness the call to prayer from such a unique vantage point. I was one of the only non-Muslim visitors when I went, and liked the opportunity to wander around the many floors of the mosque on my...More  ","tripadvisor_monas_468":"The huge Istiqlal Mosque was visited on a friday,where there will be 05 prayer sessons.The mosque can be visited by femals also and better to hire a guide from the office which will cost you (us$ 5) .they will not ask for the cost yet better to donate.The mosque is the 04 th largest in the word were can accomadate...More  ","tripadvisor_monas_469":"Having visited many beautiful mosques throughout the world we were bitterly disappointed with this one. We were immediately taken to an office to pay the obligatory donation before being allowed to look round. The mosque had nothing either architecturally or spiritually to offer- to us that is.","tripadvisor_monas_470":"the mosque is huge but beautifully decorated inside. our guide was nice and gave us good information about the mosque. You are allowed to take pics inside but have to be fully clad (they provide dressing gowns).","tripadvisor_monas_471":"well. very beautiful and very near to every body can reach it. It is in front of the Cathedral. Very convenient to go there by taxi or bus. It is a tourist spot.","tripadvisor_monas_472":"It was a spiritual journey and I enjoyed visiting the masjid. Masjid was clean, well managed and beautiful.","tripadvisor_monas_473":"A very big mosque, a major landmark near to Monas and Gambir Railway Station. Easily accessible by TransJakarta bus or from Gambir by walk.","tripadvisor_monas_474":"It's a biggest masjid in Asia. But, don't try to fall sleep if you don't want something is missing from you due to it's a quite masjd after praying time (usually between Dzuhur and Ashar)","tripadvisor_monas_475":"A very big mosque, a major landmark near to Monas and Gambir Railway Station. Easily accessible by TransJakarta bus or from Gambir by walk.","tripadvisor_monas_476":"open to non Muslims the mosque is huge and very modern. It lacks the old nice decoration of the ancient mosks","tripadvisor_monas_477":"Located in the heart beat area of Jakarta as biggest mosque in Indonesia, it make Istiqlal Mosque quite popular. This place near with other attraction such as monas and old town jakarta. This mosque very near with Jakarta cathedral and immanuel church, many says this area become a symbol of peace among religious adherents.This mosque quite calm and peaceful...More  ","tripadvisor_monas_478":"It is the biggest mosque in south east Asia. nestled in the heart of the city near to the President Palace and next to the catherdal.. surrounded by a river and gardens as well close by to the monument national of Indonesia.. If you are not a muslim some rule it seems apply for you.. Overall it is a beautiful...More  ","tripadvisor_monas_479":"It is very authentic place with Indonesia. When you go to Indonesia, you can also arrange your time to religious trip at these Istiqlal Mosque","tripadvisor_monas_480":"The mosq is not so beautiful, old and dirty outside to compare with the mosq of Kuala Lumpur.But it's interesting to discover the muslim world.","tripadvisor_monas_481":"Nice Mosque but there are better things to see. Nice architecture, Big Size, but nothing special I wouldnt rate it as the #1 Attraction in Jakarta","tripadvisor_monas_482":"This is a very interesting experience. It is a gigantic place and everyone is very friendly. I am not Muslim, so I did not quiet not waht to do but you can just follow people while entering because you have to take your shoes off, etc. You area llowed to take pictures inside.","tripadvisor_monas_483":"beware of the unofficial guide that asked for money, you'll be ripped off... it's totally free btw.the largest mosque in Southeast Asia. This national mosque of Indonesia was built to commemorate Indonesian independence, as nation's gratitude for God's blessings; the independence of Indonesia. Therefore the national mosque of Indonesia was named \"Istiqlal\", an Arabic word for \"Independence\".next to...More  ","tripadvisor_monas_484":"Evening being the largest mosque in southeastern Asia, if you hadalready a chance to have been to other Islamic destinations, you have seen much nicer mosques than this one.The...read more ","tripadvisor_monas_485":"Beautiful building from the outside. What i love the most is the fact that it's located very close to the one of the oldest/biggest Catholic Church in the city.","tripadvisor_monas_486":"It is my first time to Jakarta.I love Islam architecture. This place is one of my impression.Blending Seamlessly of Art.","tripadvisor_monas_487":"Evening being the largest mosque in southeastern Asia, if you hadalready a chance to have been to other Islamic destinations, you have seen much nicer mosques than this one.The guided tour for a minimal tip is very nice, though.","tripadvisor_monas_488":"This is one of the biggest religious structures I have been to. We were glad that there was somebody inside the mosque who told us about its creation. This is one Moslem mosque designed by a Catholic architect. Interesting!","tripadvisor_monas_489":"It a big mosque. From an architectural point of view I did not find it particularly interesting. I was taken around by an \"official guide\" who spoke hardly any english and basically just pointed out the male/female side.At the end he asked for a donation. Funnily enough he tried to reach for the money, but I made sure to...More  ","tripadvisor_monas_490":"A big mosque.. Restricted access and a guy in information who kept asking for donation... To be paid to him and not put into the donation box..","tripadvisor_monas_491":"When you come to this place, you have a chance to visit several recommended places arround. All located near of Istiqlal. Such as Monumen Nasional (Monas, Gold statue at the top and landmark of Jakarta), Roman Catholic Cathedral. Three of this places also arround of Gambir Trainstation (destination to Bandung, Jogjakarta, Semarang, Surabaya, etc).","tripadvisor_monas_492":"I were there with my muslim friend. It is really enormous place amke you feel small but guarded by the god.","tripadvisor_monas_493":"As a non-muslim foreigner, it was certainly an interesting experience visiting the largest mosque in South East ASia.Since shoes aren't allowed to be worn inside, you are directed to place your shoes in a area - i suspect specially reserved for foreigners. You are assigned to an English speaking guide. All quite politely.During the tour, I did ask...More  ","tripadvisor_monas_494":"Came here for the first time and after watching and seeing the place from TV and afar, the experience is quite moving. The volunteers are plenty and helpful, they usher the muslims to line up to front during pray time. There are the usual activities after pray times given by good and well educated clerics.Outside was a massive bedug...More  ","tripadvisor_monas_495":"My 2nd time visiting a mosque and this is certainly the bigger one. Surely a place to go if this is your first time in Indonesia :)","tripadvisor_monas_496":"We were the only tourists at that moment and the security guard showed us around. The mosque is huge and gives place to more than 200.000 people. It was interesting and worth a visit!","tripadvisor_monas_497":"I really liked how the mosque had a separate section where visitors, and non Muslim people could learn more about the mosque and its operations, and their beliefs.Guides were very friendly, spoke English and treated our group with a lot of respect. Best to wear long pants...","tripadvisor_monas_498":"In the usual day, for some Moslem people, this place would be the most private place for you and your Creator to meet. The serenity will support your devoutness during your praying time. Everything is just so simple, easy and one cool air hall certainly will make a comfortable ambience during \"the private meeting\" between you and your Creator...","tripadvisor_monas_499":"My 2nd time visiting a mosque and this is certainly the bigger one. Surely a place to go if this is your first time in Indonesia :)","tripadvisor_monas_500":"Huge, multi-storeyed. Simple architecure. Good, well-maintained facilities. Entrances can get crowded with visitors on non-praying times (definitely jam-packed during peak Friday prayer)","tripadvisor_monas_501":"This mosque is the biggest in South East Asia. It's located in Central Jakarta, right in front of Cathedral Church, near Monas (National Monument). Quite easy to access by busway, by local buses (kopaja & metro mini), and by train (near Gambir train station). But I suggest to not go there by busway because it spends so much time.Visitors...More  ","tripadvisor_monas_502":"This masjid is an amazing sight to see. Once you enter the main room you will understand just how spectacular the architecture is. Not only is it massive but it's designed magnificently.","tripadvisor_monas_503":"I have lived in Jakarta for almost two years and always meant to go to the mosque. I finally did and was actually quite impressed. You need to be prepared for the crowds, to remove your shoes, to seek out the English tour, to pay your tourguide a bit. The tour will take less than 30 minutes end to end,...More  ","tripadvisor_monas_504":"We had a private tour by Jimmy and were appreciative of his time and attention, but did not like the manipulative money requests at the end. We enjoyed seeing it and hearing about it's history and were glad that it allows Westerner and non-Muslims to visit. It is well worth a hour or two of your time to see this...More  ","tripadvisor_monas_505":"this mosque one of the biggest in southeast country, every moslem can pray (sholat) in this mosque, all the staff so friendly and welcome","tripadvisor_monas_506":"Tour guide gives lots of interesting details & facts. It was busy with a competition for school children. It is the 3rd largest mosque in the world holding two hundred thousand...read more ","tripadvisor_monas_507":"we visited the Istiqial Mosque late in the afternoon. I was not required to wear a scarf, though I was wearing a long skirt and a long sleeved shirt. Shoes were removed at the entrance.This visit was well outside tourist hours but a guide was happy to show us around and give us a rich history of the mosque.It...More  ","tripadvisor_monas_508":"Tour guide gives lots of interesting details & facts. It was busy with a competition for school children. It is the 3rd largest mosque in the world holding two hundred thousand people.","tripadvisor_monas_509":"Probably the biggest mosque in Jakarta. Also very famous, bustling with Muslim activities. If you're into cultural things, you shouldn't miss this.","tripadvisor_monas_510":"Our trip to beautiful Indonesia continued to visit Istiqlal Masjid or Mosque. It's really big and great. Many people and visitors to perform pray and visit such a beautiful place. It's a five stories buildings with many open yards and will be full during many occasions. I saw a big drum which will be used also at some occasions. If...More  ","tripadvisor_monas_511":"It s a big mosque with 3 levels. So wide and a long way to reach toilet and place for taking wudhu. There are also food sellers outside it. So it s a good place not only for praying but also for recreation","tripadvisor_monas_512":"on Ramadhan's (the fasting month for Moslem) we usually stays in the mosque for prayers and other moslem activity related.Located across Monas and next to the Cathedral. the Mosque is simply grande and alive.The architecture and the atmosphere inside will bring you to certain feelings. As you walk from one column to another you will find people from...More  ","tripadvisor_monas_513":"The complex of this mosque is really big. Inside it, you'll find everything you need as moslem. From generous water to clean yourself before pray, toilets, beautiful area for praying, up to corridor where people can do moslem related activities like kids competitions, school visit and so on. Spacious yard on the second floor, where everyone can run and enjoy...More  ","tripadvisor_monas_514":"A very big mosque... not sure what else to say, it is opposite a christian catherdral so taking a compare and contrast is quite interesting. Worth going to, just to say that you have I would say. Unfortunately, i didnt go inside, would have liked to!","tripadvisor_monas_515":"not bad for photostop...haven't went in before. it was abit too hot to stand outside for too long. maybe a shade for photo stop ppl. also too many vendors outside","tripadvisor_monas_516":"I have visited this mosque for several time already. Its defenately the biggest mosque in Indonesia. And its beautiful mosque.","tripadvisor_monas_517":"This mosque is like no others I've visited in the past. The architecture makes it well worth a quick visit. Since it's near the museum and National Monument, it is easy to get to.","tripadvisor_monas_518":"as Indonesia it is Islamic country you can enjoy by Islamic history was very old i love it so much i love dome of the mosuqe and everything inside it was wonderful really","tripadvisor_monas_519":"Great Mosque ^_^one of the big Mosque in jakarta..because of the posisition is in central jakarta soo its a bit traffic to reach it...","tripadvisor_monas_520":"Visited on a Sunday with a couple of co-workers. I expected many tourists (it is the #1 attraction in Jakarta) but there only seemed to be the three of us. We were directed to a special area to leave our shoes, sign in, and then follow a guide to view the mosque from an upper level. He explained some key...More  ","tripadvisor_monas_521":"Just a big concrete cube with a dome. Nothing to see both from outside and inside. From afar looks much better.","tripadvisor_monas_522":"This mosque is like no others I've visited in the past. The architecture makes it well worth a quick visit. Since it's near the museum and National Monument, it is easy to get to.","tripadvisor_monas_523":"I have been there so many times, year to year it's always became better and better..Nothing to say.. just GREAT!!","tripadvisor_monas_524":"Completed in 1978 and built to commemorate the Indonesian independence from Dutch rule in 1946, Masjid Istiqlal is the largest mosque in South East Asia in terms of structure as well as capacity. It is also recognized as the fifth largest mosque in the world.Istiqlal Mosque stands majestically on a sprawling piece of land in Central Jakarta and is...More  ","tripadvisor_monas_525":"One of the biggest mosques in Asia, Worth the visit! To be inspired by architecture and a sense of purpose. It is definitely a place to visit if you are nearby the area.","tripadvisor_monas_526":"An interesting mosque to visit in Jakarta. I love that it is just across the Catholic Cathedral. The place is huge and you can surely find a corner where you can pray or just think. If you are a female non-Muslim, you have to cover-up. Have a handy scarf with you and make sure you are wearing a top with...More  ","tripadvisor_monas_527":"I was a bit apprehensive, being female, how I would be welcomed but I need'nt have worried. Was warmly welcomed but a greeter who took me into an office were she gave me an interesting talk about the mosque. She gave me a long sleeve light coverall and guided me upstairs (were ladies go). Showed me around then left me...More  ","tripadvisor_monas_528":"First Mosque visited - beautiful, peaceful and serene building. The children were gorgeous dressed up and the stats on this place is amazing.","tripadvisor_monas_529":"First Mosque visited - beautiful, peaceful and serene building. The children were gorgeous dressed up and the stats on this place is amazing.","tripadvisor_monas_530":"I've been went to many mosque around the world and what can i say about Istiqlal was so beautiful. I am as Indonesian very proud having this mosque. Great place!","tripadvisor_monas_531":"if you visit Jakarta, this place is a must to be visited. This is the biggest mosque in Southeast Asia, and the 3rd largest mosque in the world. Pray here peacefully if you're moslem. If you're not moslem, visit this place and enjoy the landmark view, architectural inside the mosque, wonderful kaligraphies inside the mosque, and its history.Jakarta visit...More  ","tripadvisor_monas_532":"I enjoyed my tour of the mosque, and felt very welcome. I love that the mosque is across the street from the Cathedral. It was a wonderful opportunity to visit such a large mosque.","tripadvisor_monas_533":"Took my Spanish friends strolling around in Jakarta last May of 2014, the mosque are welcoming! Specially for tourists who want to know more about its history or activities inside.For non moslem and wearing casual clothes such as t-shirt and shorts, dont worry, they provide robe to wear inside the mosque so you can see the architecture from inside....More  ","tripadvisor_monas_534":"After checking out the Cathedral across the street, we headed over to the Mosque. We were asked to remove our shoes, then directed to the Guest Room. A guide asked us to sign their guest book, and then lead us on a 20 minute tour of the mosque. It was very interesting to see, and the guide was nice enough....More  ","tripadvisor_monas_535":"with big space of parking lot and huge terrace for praying, i believe it could accommodate more than 100.000 peoples in one time praying my be more, huge islam library with literatures from all over the world definitely its described as biggest mosque in Asia, may activities held by the mosque organiser to keep the mosque alive 24 hours, many...More  ","tripadvisor_monas_536":"It is one of Jakarta's landmark, I must say, and it's the main Mosque of Jakarta. It's located right across another landmark and the place is very quite within the bustling Jakarta life.It's beautiful.","tripadvisor_monas_537":"it is the biggest masjid in southeast asia, its organized and open for publics. and right across the street you can see a cathedral in front.","tripadvisor_monas_538":"Not like your typical mosques in the Middle East... This is the largest mosque in SE Asia... Place is huge. You get families hanging out inside the mosque, very friendly atmosphere. There's not really an enclosed room so the whole place is very open. Best to visit in the morning when there's less people and no prayers.","tripadvisor_monas_539":"Awesome place and impressively big. Super guide that showed us around and told some interesting background stories.","tripadvisor_monas_540":"Awesome place and impressively big. Super guide that showed us around and told some interesting background stories.","tripadvisor_monas_541":"Didn't have time to enter (& as non Muslim didn't want to). For a recent mosque it's architecture is amazing! Definitely set aside even 30 mins, good place to buy Islamic gifts also.","tripadvisor_monas_542":"What I liked most was the overall atmosphere. I felt the peace and tranquility once I entered the mosque especially during the prayers. The imam was so impressive being able to lead the prayers by reciting the noble quran by heart. He sounds like Shaikh Sudais of Saudi Arabia. The street vendors were everywhere and if they could manage themselves...More  ","tripadvisor_monas_543":"Not your Average Mosque, this is the place to see even if you are not Islamic you are most welcome to see this great Mosque. Be blessed and see the beauty.","tripadvisor_monas_544":"It is very clean, beautiful and spacious. The person in charge was very informative and showed us around. The locals and the staffs were very helpful and friendly. Outside, we could see or buy a variety of food, drinks, T-shirts, souvenirs and decor items within walking distance.","tripadvisor_monas_545":"The place is huge. We came at night around 8pm and the building looks really nice at that time against the light. It is not busy and not too hot either which is a plus. We were guided through the place by a man who I believe the security guard and he was really helpful.","tripadvisor_monas_546":"The plain exterior of this the largest mosque in Southeast Asia is deceptive. You must enter the building and ask a guide to help you put on the appropriate clothes and find the visitor gallery to see the majestic interior domed space. This is a truly spiritual place.Even as non-Muslims we were welcomed and helped in every way possible...More  ","tripadvisor_monas_547":"I'm not a Muslim, but I tend to respect all beliefs, history, traditions and, least but not last, architecture.This place is one of the (few) not to be missed spots in Jakarta.Indonesian people always tend to be kind and welcoming to strangers, so don't be surprised if many students will volunteer to proudly show you around this place....More  ","tripadvisor_monas_548":"The building is huge and the architecture is amazing. Maintained very well for being an old Masjid. Good for tourist to visit but ya need to go in the morning before prayers which is at noon and ya need to be covered out of respect for religion.","tripadvisor_monas_549":"Istiqlal Mosque is the biggest mosque in Asia...The building is so tough with nice kaligraphies...location is the best,, easily accessible. most of muslim around pray in that mosque...best for muslim people.. they would love that","tripadvisor_monas_550":"one of a kind in Jakarta some thing that european easily find but only one in jakarta.. a nice quite and religious place.","tripadvisor_monas_551":"Worth to visit the museum for moslem community especially in the evening after Ashar and before Maghrib","tripadvisor_monas_552":"Istiqlal Mosque is the biggest mosque in South East Asia...The building so tough with nice kaligraphies...location so trategic central of jakarta near the president palace and near the office complex too. most of muslim around there pray in that mosque...special in Idul Fitri and Idul Adha president and most of Indonesia ministers pray in Istiqlal, so if you are muslim...More  ","tripadvisor_monas_553":"the way we were taken to the mosque by a boy and the way he guided us during our short visit to the istiqlal mosque was commendable. Also, the mosque is unique and i was astonished to note that i am in 3rd largest mosque of the world. it was unique and experience was good.","tripadvisor_monas_554":"one of a kind in Jakarta some thing that european easily find but only one in jakarta.. a nice quite and religious place.","tripadvisor_monas_555":"It's like a vintage Moskee. Worth visiting because there's not a lot to do and see in Jakarta. Visit is free but as a tourist you are expected to donate.","tripadvisor_monas_556":"This place is not amazing but worth a visit if you are in Jakarta. I wandered in and was guided to Guest Room. The receptionist there provided me rope (I was wearing shorts) and asked for a 'donation' of 30k Idr before he brought me to a tour around the mosque. He was experienced as he knows where exactly to...More  ","tripadvisor_monas_557":"The mosque is absolutely worth to see! The only problem I've had was, that there are no signs to find the way. I stranded after half an hour of boyscouting somewhere close to it and still couldn't find it. Turning my \"Lonely planet\" a couple of times, suddenly an official from the tourist office appeared and guided me. The problem...More  ","tripadvisor_monas_558":"A bit hard to hard to navigate but locals are accommodating. Make sure you wear long pants. They will provide robes for arm coverage which is great as Jakarta can be HOT. Found a tour guide who showed us around and told us the mosque holds 200,000 people. Such a beautiful place and the cathedral is opposing side of the...More  ","tripadvisor_monas_559":"The Mosque is enormous. Not an architectural masterpiece but a very clear indicator of the importance of Indonesia Islam. Everything speaks of great masses of people who pray and prayer is the overall feeling you get once you enter.","tripadvisor_monas_560":"My guide was knowledgeable and friendly. The tour was fascinating. You'll need to leave your shoes in the guest area and you should be dressed modestly, though I think they have robes to offer guests who may need them. The tour is free.","tripadvisor_monas_561":"One of biggest mosque in Asia. Old building buat really great and maintained. Friday pray is the best time to visit to see many souvenir shops and also good and cheap good.","tripadvisor_monas_562":"Largest mosque I have ever visited of the countries. It's design and architect is great. A symbol of eternal peace and spiritual prosperity. There is huge gathering in Jumma that is in Friday . One muslim should say prayer and visit this mosque. It's a old building but very clean and gorgeous. There are many souvenir shops around the mosque.","tripadvisor_monas_563":"Jakarta visit is not complete until this landmark and the other two neighborly landmarks, Cathedral and MONAS, are visited. Muslim or non-muslim one can easily visit it - no barriers except to remove your shoes as the muslims do.","tripadvisor_monas_564":"thats what i felt there...it was a wonderful experience to be here...the largeness of the place was so overwhelming... its a must visit in jakarta...","tripadvisor_monas_565":"I always dropped by at a mosque everytime I had the opportunity. Given the chance to solat at this most is truly fascinating. Its the biggest mosque that I ever been too, guess what I think its is the largest in SEA. Do come by if you have the chance.","tripadvisor_monas_566":"Masjid Istiqlal is indeed the biggest mosque of South East Asia, Love the design and the architectures! Good place for pray. quite, peacefully place..clean place,the biggest mosque.","tripadvisor_monas_567":"One of biggest mosque in Asia. Old building buat really great and maintained. Friday pray is the best time to visit to see many souvenir shops and also good and cheap good.","tripadvisor_monas_568":"Love the design and the architectures! especially when people are here on Friday noon. sometimes the President shalat here! cool isn't it. anyway this place are built long time ago i think just after Indonesia indenpendemce","tripadvisor_monas_569":"its taking place in the heart of the city, big open area, i been there in Friday and it was full but organized, you will defiantly enjoy the experience","tripadvisor_monas_570":"I visited this place and I was really touched about the holiness seeing this place first time.But when I entered, one employee their requested us to take our shoes in his officeand write down our names, jobs and other info.First time he said we could donate some money for this place,But after our tour within this...More  ","tripadvisor_monas_571":"Huge architecture fully constructed with steel. The area of the mosque is also huge and spread across to accommodate thousands of people to pray at one time.","tripadvisor_monas_572":"I am not a practicing Muslim but my friend is and she was able to take us inside for prayers as long as we followed proper custom. It was such an amazing experience, and the local...read more ","tripadvisor_monas_573":"this place is so big and very different from any mosque in the world , when you are going through or should I say driving through its like heaven on earth its on a about square klm full of beautiful gardens very impressive","tripadvisor_monas_574":"I am not a practicing Muslim but my friend is and she was able to take us inside for prayers as long as we followed proper custom. It was such an amazing experience, and the local women helped us get more fully covered to be in compliance during prayers. The mosque itself is quite amazing and beautiful, utterly huge, very...More  ","tripadvisor_monas_575":"Visit this magnificent mosque. Everyone is allowed to go inside. Maintain silence and Pray .Must visit","tripadvisor_monas_576":"The architecture is nice. The dome, the spacious area and good lighting inside. The washroom proves that the building is a bit old, because of the style.. and maybe nevertheless been upgraded. If you come here, and wanna take a look inside, bring a small plastic bag to put in your shoes. Carry them inside and keep it at the...More  ","tripadvisor_monas_577":"It is a beautiful place full of peace. Try the guest experience were ypu can check the whole Mosque, get on a robe, take pictures, see musulmans praying and understand a little more their religion. Fully recommended","tripadvisor_monas_578":"To get to this mosque from Independence monument took me an hour! Even though they are 100m apart!! The entrance is far away, cannot cross the street, no crossings! Tons and tons of garbage on the way, it smells pee EVERYWHERE! people look at u as a big piece of money. The territory of mosque is dirty, littered and pee...More  ","tripadvisor_monas_579":"it's big and clean full stop. Non Muslims cannot go all the way in and you have to 50.000rp for a tour, no thanks, head to the cathedral it's free and all walks of life can enter. Also there are many people begging for money, safe at the cathedral from that.","tripadvisor_monas_580":"One of the places that recommended by Capsule hotel's staff to have a see. Since I came for business In term of killing my weekend time doing nothing. The mosque consider very big and I have been told the president and the minister use to this mosque at Friday prayer. It is worth the time to visit and all you...More  ","tripadvisor_monas_581":"It is a lovely mosque but is architecurally very different to many mosques you will see in the world. This nevertheless gives it a unique character and the dome is beautiful from the inside.","tripadvisor_monas_582":"I stopped here on the way to the airport with Bluebird taxis, they dropped me off the main road in the car park. I arrived at 8;30am, took off my shoes to enter, and the tourist counter told me they weren't open yet, After explaining I had to catch a flight they kindly offered a young man who took me...More  ","tripadvisor_monas_583":"This mosque is very beautiful. We went through the main security area and we were offered a 'free' tour by one of the security guards. He spoke decent English and gave a decent...read more ","tripadvisor_monas_584":"This mosque has made the effort to invite in rather than exclude non-Muslims, which is to be encouraged. It is better to turn up with slip off shoes and no shorts, but they are happy to kit you out in a cloak style outfit if you forget. You have to sign the visitors book and pay your guide but you...More  ","tripadvisor_monas_585":"A place that bring an boutique ambiance. Pray for a happy and good life for us and all people all around the world. We love peace!","tripadvisor_monas_586":"This mosque is very beautiful. We went through the main security area and we were offered a 'free' tour by one of the security guards. He spoke decent English and gave a decent tour, but in the end he asked for a tip. Not complaining, but it just won't be called a 'free' tour. Definitely worth a visit though.","tripadvisor_monas_587":"Good place for pray..quaite sure,peacefully place..clean place,the biggest mosque. I always like to be here","tripadvisor_monas_588":"We even got to meet the Imam. Although we are not Muslim, the guide was very friendly, showed us around in the back areas, so that we wouldn't disturb the prayers. The Mosque is the 3rd largest in the world and has an amazing view. Worth a visit","tripadvisor_monas_589":"I have visited many mosques before, but this was the first I have seen from the 20th century. There is some good architectural ideas in it, it is worth checking out the main hall from the gallery. I visited it on a Sunday and there were many people, old, young, men, women just spending their day there, chatting, reading, sleeping....More  ","tripadvisor_monas_590":"This is the first time we have visited mosque. 5 of us paid total RP250,000 in to our tour guide pocket instead of donation box. The tour about 10 min with very little english.","tripadvisor_monas_591":"This is a HUGE mosque / complex and its rather confusing how to get inside it in part b/c of the layout of the streets in the area and I think b/c I entered from what is technically the back (towards the Monas - I think the front is actually across from the Jakarta Cathedral). As a non-Muslim, you are...More  ","tripadvisor_monas_592":"Of course, some access is limited for non-Muslims, but I thought it was more so than in many other large mosques. Still, this huge structure and complex is a must visit if you're in Jakarta. I think they're trying to improve the surrounding areas and the moat/river, but it's really trashy in that area. Beware that they'll ask for donation...More  ","tripadvisor_monas_593":"Tips to visit Istiqlal for foreigners:1. Prepare small change.2. Take off your footwear before entering and carry them with you inside, there'll be a place to keep them.3. There are a lot of people at the entrance offering you a plastic bag to keep your sandals & shoes. If you want it, give them around IDR2.000-5.000 per...More  ","tripadvisor_monas_594":"I went to Istiqlal on my first day in Jakarta. Its a huge mosque. The shoes can be deposited for free, but expect to pay a tip, if you are not an Indonesian. The ablution quarter...read more ","tripadvisor_monas_595":"This place is average at best. Stop by if you are in the vicinity. Not worth the travel if you are not.","tripadvisor_monas_596":"I went to Istiqlal on my first day in Jakarta. Its a huge mosque. The shoes can be deposited for free, but expect to pay a tip, if you are not an Indonesian. The ablution quarter is very nice. The prayer hall is humongous. There was a conference going on there, but the ventilation, the air and the voice of...More  ","tripadvisor_monas_597":"Mosque is huge and love the simple layout and design of the building. There are multiple entrance and exit points and can be confusing when we want to get out of the building. Nice place for phototaking. Worth the short visit!","tripadvisor_monas_598":"it can be reach easy by train form Bogor directly. The nearest station is Juanda and walking aroun 10 minutes on opposite way","tripadvisor_monas_599":"The mosque is amazing, considering how old it is. Well ventilated. Quality pray all the time. Parking is very bad, you're stranded on the street. However, it's worth the trouble.","tripadvisor_monas_600":"Well worth a visit. This is a huge building and fascinating. I am not a Muslim but go with a Muslim if you can and listen and learn. Its really so well worth an hour or so.","tripadvisor_monas_601":"This is a fantastic opportunity for tourists to get a sneak peak into a mosque - would highly recommend!","tripadvisor_monas_602":"I went into the mosque and they assigned me a guide who show me and explain everything about the mosque. interesting place to visit","tripadvisor_monas_603":"The grand mosque is beautiful and the stark difference between Indonesian Islamic culture and Arabic Islamic culture becomes so obvious once you walk inside. Women and men are separated only by a hip high barrier and are side by side, whilst families gather together in between prayer times. So nice to be able to experience a mosque, it's peace and...More  ","tripadvisor_monas_604":"you have respect the muslim manners for visiting the masjid. And if you go to this tourist attraction if suggest you can take the public transportation like transjakarta busway go to there, cos you can enjoy the Jakarta living environment.","tripadvisor_monas_605":"This place is worth a visit if you have time to spare in Jakarta. Mosque guides meet you at the door and bring you around - they don't have great English but were very friendly...read more ","tripadvisor_monas_606":"Great place to find out a bit more about the Muslim religion. Fascinating!! Just like Vatican City!!","tripadvisor_monas_607":"This huge mosque was a disappointment. It's big but that's about all you can say for it. Morocco & Turkey have much more historical and architecturally pleasing mosques. This place is very plain. Non-Muslims cannot enter the main worship area and it's a long walk without shoes to reach this area.","tripadvisor_monas_608":"Stunning architecture, atypical in the extensive use of steel and glass construction. We were met by a Mosque guide, who outlined where we could freely walk to examine the building internally and surrounds, he advised us when the faithful would be moving inside for the prayers about mid-day, and said we were welcome to watch from the internal 2nd storey...More  ","tripadvisor_monas_609":"Majestic building where you could feel the merger of body and soul attaining a serene calmness. The coolness of it's interior coupled with the high ceilinged dome really makes it unforgettable; with a view of the Monas with its glittering golden flame.","tripadvisor_monas_610":"This place is worth a visit if you have time to spare in Jakarta. Mosque guides meet you at the door and bring you around - they don't have great English but were very friendly & welcoming. These guides are the only way to enter the mosque & are not trying to scam you. We were charged 50,000 for the...More  ","tripadvisor_monas_611":"be careful of beggars, dont gove it u dont feel like it. as u gave to one person, many more will come and ask.","tripadvisor_monas_612":"Went for friday prayers , was great, very nice and huge mosque , very big , first time I seen inside the mosque tv monitores so everyone can see the from fare the people can see the person conducting the prayer and the speechVery huge mosque , lots off gates , I got lost coming out .","tripadvisor_monas_613":"I have never been inside a Mosque and found this very interesting, the gentleman who was our guide was very helpful and informative. The building itself is huge and construction very interesting.Would recommend it.","tripadvisor_monas_614":"One of the biggest Mosque in South East Asia and of course the biggest in indonesia. If you want to pray with quality then this is the perfect place, great quality of imam, the marvelous voice of the muadzin and the cozy environment made this Mosque has Two Thumbs Up.","tripadvisor_monas_615":"I have prayed in many mosques around the world, the only thing outstanding about this one is its size.Many locals will tell you to visit it. Maybe they are impressed by the size and capacity of the place, but it is not an architectural masterpiece.If you need a place to pray, fine. I would not go out of...More  ","tripadvisor_monas_616":"Just on another side of National monument let say 10mn walk. If you using the train get off at Juanda station and cross the road. Nice place to visit if you in Jakarta. As...read more ","tripadvisor_monas_617":"Just on another side of National monument let say 10mn walk. If you using the train get off at Juanda station and cross the road. Nice place to visit if you in Jakarta. As spiritual place we think they shouldn't allow people sell stuff. They are creating other bargin market there.","tripadvisor_monas_618":"A great mosque in the center of Jakarta. The place is next to Monas, Gambir train station and not far from Merdeka strait. This mosque is very well known in Indonesia. You can take the train (KRL) and stop at Gambir or Juanda station. Then walk around 5 minutes. The praying area is very calm and peaceful. The terrace is...More  ","tripadvisor_monas_619":"The mosque was big and nice. This is the first time I entered a mosque because I am not a Muslim. The over all experience was just good. It was good to know that the one who designed the istiqial mosque is Christian because he won in the completion.","tripadvisor_monas_620":"From the outside it doesnt look so interesting, but inside it has pure and simple lines, room for some 200,000 plus worshipers, and an interesting ancient large drum. Tours are free but one is expected to give a tip at the end.","tripadvisor_monas_621":"Once in your life you have to visit this place, that is, after pilgrimage in Mecca. The complex is very big, you really need to plan your time accordingly. Once suggestion for the management is to provide overview map about the area, so you can plan to travel in order. Nice place.!","tripadvisor_monas_622":"the biggest and one of the biggest mosque in south east asia.coz 80% population in this country is a moslem. their a good people. dont shy to ask.","tripadvisor_monas_623":"This is the biggest mosque in Indonesia and located in the center of Jakarta, opposite the Jakarta Cathedral. Uniquely this mosque was designed by a Christian architect :-)","tripadvisor_monas_624":"Interesting mosque to visit. It has a capacity for 120,000 worshippers so it is huge. Interior dome is beautiful","tripadvisor_monas_625":"We stopped at this beautiful place of worship as part of the tour organised by ''Hidden Jakarta Tour '' . This mosque is very big and has an original architecture ! It seems to be made of stainless steel and wood which is unusual combination but which is really nice ! The mosque is also a multi-stories building which is...More  ","tripadvisor_monas_626":"I was impressed with the mosque's architecture & history at first but felt bad later because the officer at the entrance asked me to pay money after guiding me around. I was very scared because he guided me to the remoted, quite zone and requested 100,000 IDR for 10 minuted walk & guidance.He didn't mention anything about the charge...More  ","tripadvisor_monas_627":"I've never went to a place and visit a mosque if we avoid mentioning Istanbul ;)In Jakarta i was somehow forced to visit it due to the lack of activities :-P Anyway it was quite...read more ","tripadvisor_monas_628":"If you are in Jakarta rest assured that nothing much extra ordinary you can see except few shopping areas and relatively new area outside main town Taman Mini.Since there is not great history associated with Jakarta you really need to struggle for selecting places to visit to justify your travel plan to this mega capital.Masjid Istiqlal is once...More  ","tripadvisor_monas_629":"I've never went to a place and visit a mosque if we avoid mentioning Istanbul ;)In Jakarta i was somehow forced to visit it due to the lack of activities :-P Anyway it was quite interesting, i had a guide for the entire stay ( probably cause my trust is different from Muslim) but he did explain me a...More  ","tripadvisor_monas_630":"I think the mosque deserve one visit,is huge building with some very big pillars down to the golden color dome.To be there is just an unique experience.","tripadvisor_monas_631":"nice setting but the ablution area is only available at the ground level which takes me a while and some asking around before i can get to it.Big solat area and there's baggage counter (for a small fee) where you can leave your baggage for you to focus on your prayer.","tripadvisor_monas_632":"This is the third largest mosque in the world, and it is really pretty neat! There is a church right across the street, which to me symbolizes the tolerance Indonesia has for multiple religions even though they are a Muslim country.There is a lot of symbolism in the mosque, so it is very worthwhile to get a tour guide.","tripadvisor_monas_633":"After entering the building during praying time I was approached by staff asking me if I'm mouslim and answer being negative I was told that I would have only 5 minutes to look around. Staff took me to a balcony and inner yard for a quick look up to 10 minutes. Architecture is very 70's Soviet-style which I like a...More  ","tripadvisor_monas_634":"Take your shoes off and take the short tour. Big, but not very ornamented - minimalist style. If you like Arabian ornamentals go somewhere else.","tripadvisor_monas_635":"This is the first time I have seen such a giant religious place which can contain a huge crowd of people. You can go around the mosque and hear the voice of preacher very clearly","tripadvisor_monas_636":"Very interesting insight on Indonesian islan, with guided visits and very nice people around. Avoid Fridays, as it may be very crowded","tripadvisor_monas_637":"Masjid Istiqlal is the largest Masjid in SE Asia. Located in the most populated Muslim Country in the world.Was overwhelmed by it's sheer size and architecture.Even World Leaders make a stop to this iconic Masjid but sadly, non-muslim women freely roam around the masjid without asking them if they are in their monthly menstrual period which is a...More  ","tripadvisor_monas_638":"It's known as one of the largest Muslim place of worship is located in Indonesia. This building consist of 4 floors with beautiful sculptures. It has become the main attraction of...read more ","tripadvisor_monas_639":"So huge, make sure you know which gate you entered and exit. Pretty architecture. For Muslims, probably worth staying during praying times.","tripadvisor_monas_640":"It's known as one of the largest Muslim place of worship is located in Indonesia. This building consist of 4 floors with beautiful sculptures. It has become the main attraction of both domestic and foreign tourists, even world leaders ever visited the place from my findings.","tripadvisor_monas_641":"One of Indonesia's largest mosques, Istiqlal is an interesting one. It can hold more than 200,000 pilgrims at any point in time. The mosque has 12 pillars symbolizing the birth date of Prophet Muhammad and 5 floors symbolizing the Panchasila or 5 principles of Indonesian state. All tourists are provided a guided tour on request by one of the staff...More  ","tripadvisor_monas_642":"Since it was time for prayers, was unable to go in to see the structure from within but outside it looks majestic and peaceful.","tripadvisor_monas_643":"I went here with a friend who is also blonde. The staff were helpful in showing us around and it's quite well organised, however there were lots of men just hanging around and not praying, and a few of them were staring and winking at us etc. It's huge but I've seen much nicer, smaller mosques.","tripadvisor_monas_644":"Allahu Akbar, this is one of the beautiful Mosque in the world. Me and family do the Tarawih Pray at Istiqlal Jakarta when Ramadhan. Or sometimes we just pray Ashar and sightseeing. The location is near Passer Baroe and National Monument.When I was a kid, my parents took me to Istiqlal to see the Festival : I saw the...More  ","tripadvisor_monas_645":"This is the third largest Mosque in the world after Mecca and Medina, with a maximum capacity of 200,000 persons. It is a very impressive building, as a non Muslim I was not allowed onto the floor of the main hall, but everything can be seen from the surrounding balcony. There was a guide available to explain everything for which...More  ","tripadvisor_monas_646":"It is the largest mosque in Southeast Asia and was built to commemorate Indonesian independence. The mosque is positioned next to Merdeka Square and the Jakarta Cathedral.How to go there: from Monas you can ride bajaj which only costs 10,000 rupiahThere’s no entrance fee and there’s also available tour guide for foreigners.","tripadvisor_monas_647":"The largest mosque I have prayed in so far. Great architecture and the main prayer hall was a very relaxing place.","tripadvisor_monas_648":"Considered one of Jakarta's Landmark, where you can see 2 big mesjid & catedral facing each other nearby. If you are interested to the mesjid, make sure not to visit during the praying times. But if you're more into the crowd/ jamaah, Friday Prayer would be perfect..or you may get a jackpot at Eid Fitri/Adha.My last visit was a...More  ","tripadvisor_monas_649":"very kind and very friendly guide showed us around.It was possible to take photos and have a chat with him...All for just a dination.Very interesting and a Must in Jakarta","tripadvisor_monas_650":"I don't blame the Mosque for me not knowing what to do. However, it's so big that it left me worried I was going in the wrong door (they have lots of signs telling you which door to go in, but nothing in English) and would upset someone.The Mosque looks close to the National Monument on a map (although...More  ","tripadvisor_monas_651":"very kind and very friendly guide showed us around.It was possible to take photos and have a chat with him...All for just a dination.Very interesting and a Must in Jakarta","tripadvisor_monas_652":"The mosque is really big,if you see from the front,the mosque looks ordinary but when you go inside,the place is so beautiful. So many tourists come to this place. This mosque is one of the biggest mosque in Indonesia. When you go here make sure to wear appropriate clothes at least the top has sleeves and the bottom under your...More  ","tripadvisor_monas_653":"beautiful religious structure. view from the first hotel we looked at the mosque and the cathedral. one to the other are constructed. definitely worth a visit. huge buildings. with a white facade. I certainly recommend to visit for people who love to visit religious places.","tripadvisor_monas_654":"When we arrived at the Mosque we were invited by one of the employees that also showed us aroung. It was not prayer time so the Mosque was empty except for a lot of women who led a whole lot of children around. While the mosque itself is pretty huge, we finished the tour after about 10 minutes. There is...More  ","tripadvisor_monas_655":"Large modern mosque complex with striking inner square and minaret. Although we were obviously none muslims we were welcomed in and offered a full tour. Worshippers were smiley and friendly.","tripadvisor_monas_656":"I went there in 31 Oct 2013, it was nothing special, It's no 3 biggest Mosque in the world (No 1: in Mecca, No 2nd: in Madinah), and this mosque is no 1 in South East Asia according to a man who act as tour guide in the mosque. Too bad, this mosque is not really well maintained, it's nearby...More  ","tripadvisor_monas_657":"It is the biggest mosque in South East Asia and the third biggest mosque in the world. The dimensions are really impressive. Unfortunately there isn't much to see. One staff gave us some hints, where we can go, but you can't find an English speaking guide. After few minutes we went back.","tripadvisor_monas_658":"A very welcoming reception and the staff take pride in showing you around. Architecturally breathtaking due to the sheer size. Permitted to take photos without restrictions. Note that a donation is expected at the end - USD 10 - 15 per person should do.","tripadvisor_monas_659":"Well worth the visit it is one very impressive building. You must cover up to visit. One cannot believe how many people attend inside and out for worship.","tripadvisor_monas_660":"you will be welcomed by security guide that will take you to a room where you can leave shoes and put on some clothing. Then you will be taken for a walk around, guide is ok he...read more ","tripadvisor_monas_661":"you will be welcomed by security guide that will take you to a room where you can leave shoes and put on some clothing. Then you will be taken for a walk around, guide is ok he will give you some facts and take a photo of you. Then at the end of tour he will say \"this is a...More  ","tripadvisor_monas_662":"we did not enter but we saw from outside as we were not sure whether people of other religion can enterbut cleanniness and vast was impressive","tripadvisor_monas_663":"Given the reviews about unhappy experiences with 'guides' demanding payment, we went prepared (after putting it off for a long time). Whilst the interior hall is impressively large and some of the architecture interesting, it was not a pleasant experience.For those who still want to visit and want to avoid being ripped off: Dress conservatively (long trousers and tops),...More  ","tripadvisor_monas_664":"The Mosque is huge and facilities are nice with places for ablution around it. There is also places to eat and rest nearby. The Cathedral is right opposite of it. So if you come to visit the Mosque you can then visit the Cathedral.","tripadvisor_monas_665":"What can I say about this biggest mosque in Southeast Asia? It was totally stunning from the outside to the inside. Got a really nice tour guide who showed us around and told us a lot about this place. Highly recommended.","tripadvisor_monas_666":"We visited the mosque after the Independence Monument so were dressed in shorts and t-shirts. At the entrance we were directed to a small room with a waiting tour guide. Always ask for the guides fee before commencing a tour. We were told 70,000 rupiah per person. My brother had a similar situation to others after accepting a guide and...More  ","tripadvisor_monas_667":"Istiqlal Mosque, or Masjid Istiqlal, (Independence Mosque) in Jakarta, Indonesia is the largest mosque in Southeast Asia and has the highest capacity. This national mosque of Indonesia was built to commemorate Indonesian independence and named \"Istiqlal\", an Arabic word for \"independence\". The mosque was opened to the public 22 February 1978. Within Jakarta, the mosque is positioned next to Merdeka...More  ","tripadvisor_monas_668":"A wonderful place for (Muslims) one would love to be there for as long as they want bcos its a place to get peace. Have your time and take your kids for having a look for the great leader of Indonesia Mr Seokarno who was a good (Muslim)","tripadvisor_monas_669":"Impressive building from the outside. Long trousers necessary to get in. For that reason, we allowed an old man to guide us atound. He seemed friendly and helpful at first and made pictures for us.After a while he took us outside, behind the mosque where there were almost no tourists. After some minutes, his tone changed, saying he wanted...More  ","tripadvisor_monas_670":"Its huge and monumental. It gives you peace when you pray in it. The equipment for ablution is, at least to my opinion, unique and very practical.","tripadvisor_monas_671":"The largest mosque in South-East Asia with lot of symbolism is seen. (read more: http://en.wikipedia.org/wiki/Istiqlal_Mosque) It's a massive mosque with one elegant minaret. Once...read more ","tripadvisor_monas_672":"This mosque is a symbol of harmony between moslem and christian because it's location in front of Cathedral Church. It's the largest mosque in south east Asia, correct me if I'm wrong..","tripadvisor_monas_673":"I have never been so ripped off in my life. The guide took me through the mosque, then took me outside to the grounds and told me that it was an area reserved for VIP like President Obama, Clinton, Merkel, Cameron, etc. At the end of the tour, I tried to give him a 50.000 IDR tip, but he declined...More  ","tripadvisor_monas_674":"An excellent experience, I should point out that I, as an Indonesian-speaking non-Muslim white foreigner, was accompanied by an Indonesian Muslim, so that made it a little less daunting, especially since the visit was in the middle of Ramadan. But we were given a tour by an intern, and was a great insight into the Muslim faith. Highly recommended","tripadvisor_monas_675":"The largest mosque in South-East Asia with lot of symbolism is seen. (read more: http://en.wikipedia.org/wiki/Istiqlal_Mosque) It's a massive mosque with one elegant minaret. Once entered you have the feeling wandering on a plaza. Not the most beautiful mosque I have ever seen: lots of concrete, steel and marmble, but really a must-do when you are in Jakarta.","tripadvisor_monas_676":"Interesting visit to this mosque which means a lot to the inhabitants of Jakarta (both due to its size and its historical significance).An English speaking guide will take you to the second floor where you have a good view on the main praying area, and will tell you some interesting trivia (dome is 45m in tribute to Indonesia's independence...More  ","tripadvisor_monas_677":"For someone who hasn't been inside a mosque, I can say this is quite an experience. Getting a short tour of the inside of the mosque is easy. Just ask the guard at the entrance and he'll direct you to the visitors center. Make sure you understand and follow all instructions and ask questions if there's something you don't understand...More  ","tripadvisor_monas_678":"I went there for the Friday prayer, that was a unique experience, the architecture was a bit surprising at first, a mix between modern (material used) and old Islamic art but the overall impression was great ... unfortunately i don't understand Bahasa yet, so i couldn't understand the preach but i do advise you any one stopping by Jakarta to...More  ","tripadvisor_monas_679":"I didn't like the way that a \"security guard\" sought a tip for showing me around when I never saw the inside of the mosque at all.","tripadvisor_monas_680":"When you enter the Mosque you feel the special place. It's huge space, fantastic ceilings, light effects, cool air and quiet ambience grips you. The architecture of the building is fastantic. This is completely irrespective of your religion. And Muslims will come and talk to you, friendly, interested, open. If you want to get rid of any Muslim phobia, go...More  ","tripadvisor_monas_681":"There will always be an English speaking guide here. You must remove your shoes in order to enter the Mosque. Non-muslims are not permitted into the main sanctuary. But there is nothing lacking in the experience. You will be taken to the second floor where you can fully see the entirety of the main sanctuary. If you choose, as I...More  ","tripadvisor_monas_682":"Don't expect too much of the tour that the mosque offers. Nevertheless, the mosque is worth visiting. Especially on Friday just before noon when the worshippers flock to prayer.","tripadvisor_monas_683":"I find a little bit hard to take visitors when they come to Jakarta for reasons like traffic and iconic places. Please don't take me wrong, there are tons of places to hang around, excellent restaurants and night live. But the Istiqlal Mosque deserves a visit. It is not only huge, but you get a peaceful feeling like no other...More  ","tripadvisor_monas_684":"Don't expect too much of the tour that the mosque offers. Nevertheless, the mosque is worth visiting. Especially on Friday just before noon when the worshippers flock to prayer.","tripadvisor_monas_685":"I visited this mosque on April, 2013 at evening. The place was calm & quite without much noise. Also there were not so many people so I sat there for some time in quite place & thinking about life. There is a big dome with golden light & all the script written in arabic. The facilities are good for praying...More  ","tripadvisor_monas_686":"Lies in Central Jakarta, near hotel Borobudur and Lapangan Banteng. Surrounded by shooping centre Passer Baroe and the Cathedral church, this is a mosque which is architected by a non Moslem/Protestant Catholic mr Frederich Silaban. Ground breaking on 1951 with Indonesian first President Sukarno, Istiqlal means freedom. The non Moslem may also visit this mosque with some guide available.","tripadvisor_monas_687":"Having visited the first & original domed mosque, the Hagia Sofia in Istanbul, I can see how the architect attempted to replicate the Hagia Sofia’s imposing & ethereal atmosphere. The 1960’s must have been a dull period as the Masjid Istiqlal was built in simplistic & minimalist style, mostly of concrete with steel covered columns which are very weird. One redeeming thing is the huge golden dome which has nothing to do with...More  ","tripadvisor_monas_688":"Unlike most typical dome-designed mosques seen around the region, the Istiqlal Mosque is designed taking into account the future and is a reflection of Jakarta's growing prominence in the international arena.","tripadvisor_monas_689":"I'm a foreigner, alone on business. I had some free time and was attracted to the mosque thinking it might provide a peaceful experience, perhaps even somewhat religious, and it would be an opportunity to experience an important part of Islamic culture.As I entered, I was greeted by a guide who said he was with the mosque. He wore...More  ","tripadvisor_monas_690":"it is the largest mosque in South East Asia which easily could accommodate 120,000 peoples. It is a beautiful and magnificent mosque from the inside and modern from outside.","tripadvisor_monas_691":"Just amaing in its sheer size. A very basic tour provided, so hard to get an appreciation of the mosque's spiritual quality. As the guide didn't speak a lot of English (even though a dedicated one for foreigners) -and we spoke no Indonesian - it was hard to ask questions or get any information. And don't buy black plastic bags...More  ","tripadvisor_monas_692":"It is an edifice of overwhelming size, though not exactly a tribute to architectural accomplishment. It is interesting to see how much of a social magnet it is, with some sort of activity going on under its dome any time of the day. Make sure to see the huge drum in the courtyard of this largest mosque in South East...More  ","tripadvisor_monas_693":"aside from the fact that it is gigantic, Istiqlal Mosque gives you an undeniable divinity that is the culture and faith of our Moslem borthers. The beautiful architecture and...read more ","tripadvisor_monas_694":"aside from the fact that it is gigantic, Istiqlal Mosque gives you an undeniable divinity that is the culture and faith of our Moslem borthers. The beautiful architecture and massiveness of the edifice indicates sacrifice and love to their religion. Something worth emulating and celebrating.","tripadvisor_monas_695":"I discoverd it was the biggest mosque of south east asia. and I can confirm : it is huge !! you can tell from the ouside already . as a tourist you will need a guide to show you around . he was seating watching TV in the \"information room\". He took us to one of the balcony where you've...More  ","tripadvisor_monas_696":"So big..and very nice architecture (on the first place i thought it one of the normal office building. Located opposite of Cathedral Church. Quite jam during prayer time. (Jakarta ? What do you expect? Traffic is very congested every day!)","tripadvisor_monas_697":"I went there with my American parents,while we're taking our shoes off the security guy already looked at my papa and started to whisper,I did not suspect anything \"racist\" but I was just curious why,as soon as we stepped in into the building the guy asked us to follow him,I was nervous but actually it's nothing! the guy lead us...More  ","tripadvisor_monas_698":"interesting mosque, almost next door to the old Dutch Kathedral.Beware of dodgy guides who try to pick you up in the driveway","tripadvisor_monas_699":"I had a little bit of trouble getting to the mosque I had no idea how to get there and there were no signs. As I was walking a little old man who worked for the mosque took me in and gave me a tour. He helped me put my shoes somewhere and got me the proper coverings. He then...More  ","tripadvisor_monas_700":"It's not only so big but also so beautiful. The architecture can inspire one who want to build new house in Islamic stylist. The roof and the wall can give motivation to us to always pray seriously to Allah. But bro and sis,.. The poor around the street also remind us to work harder and give the part of them...More  ","tripadvisor_monas_701":"A pride of Jakarta People even maybe for Indonesian People. comfortable for pray. but not to big for holy day like Idul Fitri.","tripadvisor_monas_702":"The true identity of Indonesia is spotable in this beautiful mosque. Verry big and a good explanation from the staff on why and how .","tripadvisor_monas_703":"Worth seeing, just because of its size!Under construction at the moment but don't be put off by that","tripadvisor_monas_704":"Say goodbye to small, old, and poor mosque condition you've ever seen. This one is grande, luxury, and welcome visitors from other beliefs. Just try to come.","tripadvisor_monas_705":"If you visit Jakarta, take a little time to visit here. You will be amused of its big interior inside the mosque. Moreover, it is located in the center of Jakarta - you can continue your visit to another spots in Jakarta!","tripadvisor_monas_706":"if ur non Muslim and wanting to visit and have a look around and even inside, simply borrow a sarong where u leave ur shoes, they'll be happy to lend u one.i came here on a bicycle, which was great, i parked wherever i want and cycled the huge complex. the smell from the sewer/river was annoying..inside, u...More  ","tripadvisor_monas_707":"Say goodbye to small, old, and poor mosque condition you've ever seen. This one is grande, luxury, and welcome visitors from other beliefs. Just try to come.","tripadvisor_monas_708":"Very chinese influenced architecture .It could easily accommodate 20,000 people at one go!But what really got my attention was that, there is cathedral just across the road from the main entrance to the grand mosque!","tripadvisor_monas_709":"It's big, it's grandeur, it's awesome. It's very special during Ramadhan:). However, because it's one of the most respected mosques in Jakarta, many people go to this place that sometimes it becomes dirty","tripadvisor_monas_710":"Compared to mosques in the middle east, this is no sight. From an architecture point of view, there is nothing to see here, a warehouse may be more interesting to visit, even the church opposite the mosque is more interesting. So yeah, visit the church instead.Enjoy your stay anyway, if that's even possible in Jakarta.","tripadvisor_monas_711":"Many times I go there, not only for the big event they have, but also sometimes I go to there for dailly praying. If I pray there, I fell more peace and we know that we are nothing in front of God. You will find that that feeling, with the nice sound and pray from Imam of istiqlal will make...More  ","tripadvisor_monas_712":"It is the biggest mosque in South East Asia. And probably the one and only mosque that was designed by a catholic architect.The inner dome is amazingly beautiful!They have an official tourist guide located at the entrance. You are wearing shorts or open sleeve shirts they will lend you a robe.No official rate for the guide, only...More  ","tripadvisor_monas_713":"Very big but not so interesting for me.Under renovation currently. it look like big building with stores. Main pray area is has a huge doom.","tripadvisor_monas_714":"A beautiful mosque in the heart of Jakarta, every Muslim who visit Jakarta should go there to see this fantastic and huge mosque...","tripadvisor_monas_715":"Perhaps one of the biggest Mosques on the planet. Could cater up to 10,000 . Designed by an architect, Silaban who, I understand has no formal qualification. he was alsi the...read more ","tripadvisor_monas_716":"A very unusual mosque, quite modernist and very imposing. Less beautiful than imposing, but worth visiting because of how unusual the atmosphere is.","tripadvisor_monas_717":"Beautiful large mosque but the river next to it is extremely dirty with black, rubbish-logged condition","tripadvisor_monas_718":"The mosque is HUGE and I was impressed with the architecture even though there's renovation going on when I was there. Was surprised with hospitality - friendly security officer (I think) greeted and escorted me into the mosque (not sure if that's standard for all tourists), gave me a little private tour (without me asking for it) but towards the...More  ","tripadvisor_monas_719":"I think all travellers in Indonesia know who things are working regarding the annoying hawkers. But what happened to us at the Mosque was unique. As soon as we entered the mosque a nice guy, looking reliable, was coming over to us and explained us what to do when visiting the mosque. he went to the wardrobe with us to...More  ","tripadvisor_monas_720":"Visited in early November 2012, and the interior was being refurbished, with scaffolding covering must of the interior, so difficult to see much.The mosque is indeed large. When I visited, there were very few people there, so hard to get a sense of how many people could fit. My guide said 200,000 people had filled it previously.My \"guide\"...More  ","tripadvisor_monas_721":"Huge, very impressive. But off course no comparison with Cairo mosques we visited in the past. Level of decoration is nice but very simple","tripadvisor_monas_722":"Simply the place where you can just sit down and absorbed the life. If the government pay attention to the surrounding area outside the Mosque it will be great...","tripadvisor_monas_723":"Perhaps one of the biggest Mosques on the planet. Could cater up to 10,000 . Designed by an architect, Silaban who, I understand has no formal qualification. he was alsi the architect of Bank Indonesia building.","tripadvisor_monas_724":"I wasn’t much impressed by this Mosque. Even if it is the biggest in SE Asia, it isn't really worth to see. When you have seen others like that one in Damaskus or Allepo it is disappointing. Only steel and stone.","tripadvisor_monas_725":"Okay, so it's the largest mosque in SE Asia, so they say. When you enter, all tourists must register with the reception, and indicate their religion. Non-muslims are required to view the mosque from an upper-level balcony and are not permitted to enter upon the ground level. (There were no prayers when I visited.) I asked the guide why non-muslims...More  ","tripadvisor_monas_726":"The sheer size of the mosque can be see even from afar! Inside, I was amazed by its simplicity but the design of the dome inside is great. What needs to be improved by the...read more ","tripadvisor_monas_727":"The sheer size of the mosque can be see even from afar! Inside, I was amazed by its simplicity but the design of the dome inside is great. What needs to be improved by the Indonesian authorities is the carpeting because I think it is rather old and worn out. Otherwise, the mosque is grand and a must see for...More  ","tripadvisor_monas_728":"Worth a visit, especially with the Cathedral on the other side of the road. Although, it is weird to visit this sacred place when you're not used to mosques. Its huge.The guides are inside the mosque, buy a bag in front of the mosque to store your shoes.","tripadvisor_monas_729":"Its really big mosque I ever seen. Clean and also quiet. Sign are very clear which make tourist easy to visit.","tripadvisor_monas_730":"I went there three days ago...so here is what i have to say: Before entering the mosque, you need to remove your shoes. FOR THE LADIES: if you are too particular walking bare-footed, I suggest you bring socks with you. Anyway, in case you end up walking around without socks, please find it a relief thAt after the guided tour,...More  ","tripadvisor_monas_731":"Very welcoming, peaceful and tranquil place. Great for escaping the noise and pace of the Jakarta. Open on all sides, a beautiful breeze sweeps through the inside areas of the mosque.","tripadvisor_monas_732":"Very good interior architecture it is pretty clean. Very big mosque biggest I ever seen at least. The tutors are pretty helply and you can wander araound easily.","tripadvisor_monas_733":"What is it exactly ? long cold corridors, large stairs, columns...looks like a huge airport hall. And indeed, people walk in and out like in an airport. Not the place for meditation.it has the charm of a 70's soviet era building.Some like it. I don't.","tripadvisor_monas_734":"Until now, it holds the predicate of the biggest mosque in South East Asia, the Istiqlal was built decades ago but it still has that charm to welcome every moslem to come & pray. One of my favorite place to pray whenever I'm around the area, although, like many other Jakarta public place, it could really do an improvement in...More  ","tripadvisor_monas_735":"Do not expect anything particularly attractive (quite simple architectonic building with huge proportions for people accostumed to European architecture).Amazing when you recognize the real size of the whole building (almoust 3000 muslims can pray together).We thought to be very luky when we found near by a very kind old man who has proposed us to visit the mosque,...More  ","tripadvisor_monas_736":"If you visit Jakarta..do not mis Istiqlal Mosque..The biggest mosque in South East Asia, this mosque is truly grandioso..High ceiling, beautiful marbles, and many symbolic architecture, Istiqlal is the magnet for many muslims from around the world who happen to visit the capital city of Indonesia. Long alleys, beautiful minaret.. On Friday, Istiqlal will always be packed with moslems...More  ","tripadvisor_monas_737":"This is a beautiful and very large masjid in the best tradition of Indonesian architecture.It has a huge dome and a beautifully carved minaret that can best be described as...read more ","tripadvisor_monas_738":"The biggest mosque in South-East Asia. can accommodate more than 10,000 people and 800 vehicles. there are five level, all wakways, floor and wall covered with marble from tulungagung","tripadvisor_monas_739":"This is a beautiful and very large masjid in the best tradition of Indonesian architecture.It has a huge dome and a beautifully carved minaret that can best be described as filigree work, and which can be seen from a great distance. Visitors can also enter the large prayer hall.","tripadvisor_monas_740":"Masjid Istiqlal is one of the biggest mosque in Southeast Asia. It is majestic. If you go pray there, you'll fell very comfortable.","tripadvisor_monas_741":"The Mosque wasn't just huge but it's interior architecture was something the attracted my concentration. The guide was explaining it's history and significance simply. We became surprised when we came to know that about Twenty million people can say their prayer at once there! The Mosque has both religious and structural significance.","tripadvisor_monas_742":"The architectural of the building so great, you can feel the energy.","tripadvisor_monas_743":"Living as strangers in a mainly Moslem country we wanted to learn more about the religion. We visited the central mosque which is the biggest in Indonesia. I must say I was blown away by how welcoming they were and it broke downmany of my misconceptions. While complying with their customs of removing shoes and generally covering up the opennes...More  ","tripadvisor_monas_744":"Registered myself and got a free (well, almost, albeit a tip to the warden and contribution in the donation box) conducted tour of the mammoth place. Had to don a grey robe whilst being shown around.See the massive praying squares - separately for males and females.","tripadvisor_monas_745":"A must visited landmark when you are in Jakarta. During major celebrations be prepared there will be many beggars and on Friday sometimes you will see few seller.","tripadvisor_monas_746":"We were here on a Friday which is the main prayer day for Muslims. This mosque is huge and it was absolutely packed.","tripadvisor_monas_747":"The capacity is huge. Great,and extraordinary interior and architecture...","tripadvisor_monas_748":"one of the great Mosque in Asia. Must visit since it's become the city landmark!","tripadvisor_monas_749":"one of the great Mosque in Asia. Must visit since it's become the city landmark!","tripadvisor_monas_750":"you get a robe for free and a guide shows and tell you info.12 huge columns in the centre5 floursclean WC (toilets)","tripadvisor_monas_751":"The Istiqlal Mosque is a huge monument to early nation-building practices in Indonesia. It's a symbol of Indonesia's ambitions to be modern and practitioners of progressive Islam. If you have never been to a giant mosque before then you will find it interesting and welcoming. If you have, then it's nothing too unusual or interesting compared with other mosques in...More  ","tripadvisor_monas_752":"If you are not a Muslim they are very happy to have you come visit the mosque. We were treated with the utmost in hospitality and given a rather extensive tour. Don't miss the enormous drum.","tripadvisor_monas_753":"The Istiqlal Mosque is a colossal and architecturally impressive mosque. It's never empty with people who want to take their time praying to God or even simple tourists who want to take a few photos and a walk in the mosque and its surrounding. Even though it's located in Jakarta, it's usually a serene enough place, except for major Islamic...More  ","tripadvisor_monas_754":"Really had fun walking around the mosque, very bright and airy and just a wonderful building. Spent a good 30 minutes here.","tripadvisor_monas_755":"great place, the praying hall is huge. very nice and comfortable place to pray. bring your shoes in and store it in the shoes stall","tripadvisor_monas_756":"Although the building is grand, there is a feeling of welcome when I walked in to use it to pray. Big pillars, very soft and thick carpets, high ceiling, and the fact many people there to pray or recite al Quran, and not just to crash and sleep, told me that they respect the place.","tripadvisor_monas_757":"Istiqlal is claimed to be the biggest mosque in South East Asia. And it is very very huge. The dome is very beautiful and grande, and the ambient is very soothing and calming.This place is also opened for non-Muslim, just make sure that you wear proper dress code.","tripadvisor_monas_758":"The guide was really helpful and was happy to share his knowledge about the mosque and his religion. While it's not the most beautiful mosque it's definitely massive.","tripadvisor_monas_759":"Not bad tours by friendly guides who took their time to explain what there was to see. Not sure it helped me understand Islam more however!!!","tripadvisor_monas_760":"Not bad tours by friendly guides who took their time to explain what there was to see. Not sure it helped me understand Islam more however!!!","tripadvisor_monas_761":"A grand architecture, which is a true proof of Indonesia's unity in diversity. The architect , (late) Silaban, was christian, yet he studied Islamic way of worship to create this grand mosque.","tripadvisor_monas_762":"the mosque had a huge dome, nice.. the mosque is very big. but needs to be have its connecting building renovated.","tripadvisor_monas_763":"I am not a Muslim, but I can imagine the rush one would get here being one of the 50,000 people at Ramadan, shoulder to shoulder with fellow worshipers chanting the praises of God. However, when the building is empty, frankly it reminds one more of the great Senate building of the Galactic Republic in Star Wars than of a...More  ","tripadvisor_monas_764":"the mosque is located opposite to a old church.i think this mosque can fit around 50 thousand people at the same time for prayers.","tripadvisor_monas_765":"As long as i can remember this is the Biggest Mosque in South East Asia, with beautiful architecture.","tripadvisor_monas_766":"awesome building :) it so amazing....nice to pray in that mosque:) thanks for the human who made that mosque to prying to ALLAH","tripadvisor_monas_767":"Everyone knew this mosque. This is the mascot of mosque in Indonesia","tripadvisor_monas_768":"Wonderfull, pecefully, and made mee feel like im in heaven because it is feel so cool even in the outside the weather very hot","tripadvisor_monas_769":"Stunning detail inside, amazing architecture, unbelieveble in its size!","tripadvisor_monas_770":"It's one of the favotit place to visityou should tty to shola there . the plance near to the big church and located in Cental Jakarta","tripadvisor_monas_771":"I came for a wedding ceremony and this building have a great architecture","tripadvisor_monas_772":"It's one of the favotit place to visityou should tty to shola there . the plance near to the big church and located in Cental Jakarta","tripadvisor_monas_773":"This is one of the great Mosque to visit if you are in Indonesia, the biggest one at least in South East Asia and amazingly the architect of the building is Mr Silaban a Christian who made this mosque as one of his masterpiece. Its a great symbol of Unity in Diversity of Indonesia !","tripadvisor_monas_774":"It is the biggest mosque in Jakarta. Of course you've gotta see it.","tripadvisor_monas_775":"the largest mosque in Southeast Asia. This national mosque of Indonesia was built to commemorate Indonesian independence, as nation's gratitude for God's blessings; the independence of Indonesia. Therefore the national mosque of Indonesia was named \"Istiqlal\", an Arabic word for \"Independence\".","tripadvisor_monas_776":"The design, the details and the locations (side aside with the cathedral), symbolizing Indonesia's harmony in divergence","tripadvisor_monas_777":"It's one of the biggest mosque in South East Asia or maybe in Asia. The architecture is so beautiful and it's very historical. A must see building in Jakarta.","tripadvisor_monas_778":"We visited this mosque with a local guide who was hanging around at the side entrance where we entered the mosque. The mosque itself was okay, but not particularly interesting. However, upon leaving the mosque, the guide asked 200k rupiah for information and security. When we naively paid this sum, the guide requested an additional 100k, claiming that the previous...More  ","tripadvisor_monas_779":"This Mosque is located in Central Jakarta on the historic Lapangan Banteng.The only claim to fame this mosque has is its' size. It is indeed very large and some claim it has the largest dome in South East Asia and also that it is the largest mosque in the region as well. However neither of these claims can be...More  "}