{"tripadvisor_monas_0":"Once a Dutch Manor, residence of VOC's governor Reinier de Klerk, built in early 1700's. Later after independence, it was used as National Achive. Nowadays national archive moved...read more ","tripadvisor_monas_1":"A must see if visiting Old Town. It is located just before the Old Town complex. The garden and surroundings are well maintained. Sometimes the complex is used for wedding and exhibitions. The building itself is magnificent.","tripadvisor_monas_2":"Once a Dutch Manor, residence of VOC's governor Reinier de Klerk, built in early 1700's. Later after independence, it was used as National Achive. Nowadays national archive moved to new Building in south Jakarta, and the old manor open to public and usually used as pre-wedding photoshoot location as well as wedding party in weekends.The building is still preserved,...More  ","tripadvisor_monas_3":"This elegant building was, in the 18th century, the residence of the Governor General of the Dutch East Indies trading company.In 1992 the building was renovated and defined as a cultural heritage. Today is a museum and it is used as a venue for the events and exhibitions.","tripadvisor_monas_4":"I was married in 2014 in this beautiful place.Until now, with my husband, we always visit this place again and again.Lovely and memorable place for us..","tripadvisor_monas_5":"This is a Old Building since the dutch period and this building still well maintain. This Building also use as a Outdoor Party Venue, can be use as a Wedding Party, Gathering, etc. This Area really open air except inside the building it self.","tripadvisor_monas_6":"we were taken there and it is very nice,, it is big, but the time given is short,Very nice items worth seeing, one should go with atleast 1 hour with you.","tripadvisor_monas_7":"Wear you flats when you were here. Quite huge museum but really wonderful with its greeny park. Try to come at night, the view was spectacular although a bit spooky :P hehehe","tripadvisor_monas_8":"This museum has a huge open area in which suitable for outdoor wedding concept. I have attend one of my officemate wedding here and love it.","tripadvisor_monas_9":"on weekend, many poeple use this place as weeding ceremony place, beuatiful place for night, but for museum not really worth it","tripadvisor_monas_10":"If u an art deco lover u should come to here, 90% interior and exterior still in original structure. The landscape also great. But sometimes they have any wedding in there.","tripadvisor_monas_11":"One would expect some sort of organisation or management because it's called a museum, but in fact the building is managed by ANRI (Indonesian Archives) and not by any Tourisme...read more ","tripadvisor_monas_12":"One would expect some sort of organisation or management because it's called a museum, but in fact the building is managed by ANRI (Indonesian Archives) and not by any Tourisme board explains the conditions a bit.You will be asked to fill in a guestbook and hand over some ID in exchange for a Visitor's badge. I was carrying my...More  ","tripadvisor_monas_13":"Wonderfully restored building but not much too see. Also the traffic in the surrounding area is crazy!","tripadvisor_monas_14":"Well the building is the most beautiful and well laid out and the gardens are still visible.Its not far from the Old Town so doable on the same trip. get your pictures of the building!Inside its a bit overrated S splendid colonial building whose archives have moved out leaving a few map copies and furniture in various rooms on...More  ","tripadvisor_monas_15":"In the weekend, this museum is more often used as place for wedding reception. In the noon there will be preparation made in the inner courtyard and close to the evening obviously it will be for peoples with invitation only.The museum also have a no-photograph rule unless you deal with the manager.","tripadvisor_monas_16":"Fascinating place to visit, we had some time in between flights and t.ook time to look around Jakarta, this was a hidden Jem only a short distance from the Ritz Carlton hotel by taxi. A really interesting place to visit the staff were fantastic and very helpfull.","tripadvisor_monas_17":"Jakarta can be a maddening city with its hot, sweaty weather and interminable traffic jams. Many travellers leave the city cursing the place and vowing never to return. But there are some historical relics to be found amongst the concrete and traffic fumes, and the National Archives Museum is one of the best.This building once housed the archives of...More  ","tripadvisor_monas_18":"At one time, this former VOC governor's residence was in the countryside outside of Batavia but now its in the heart of the city along the TransJakarta busway and near the Candra Naya - so its not difficult to reach if you are traveling up or down that route to reach Kota. Otherwise, I would not make a special trip...More  ","tripadvisor_monas_19":"The building was poorly maintained, exhibits out of a garage sale, displays not worth a look, the court yard was poorly maintained, and if this represents Jakarta's best I’d be ashamed as a citizen!One positive note the schools kids visiting were very friendly ,courteous and having fun.","tripadvisor_monas_20":"This was a very interesting place to visit. The history there and many of the things on display were a good representation of early government and life in Indonesia. The buildings do show their age and the upkeep wasn't the best but still an enjoyable place to spend a few hours in you are in the area. I love the...More  ","tripadvisor_monas_21":"When I arrived they were preparing for a wedding hence the first floor with the actual artifacts was initially closed. However, upon request they opened it and for those who like ancient maps there is quite a wealth of that in terms of quality. The ancient building itself is also interesting and one can only imagine what Jakarta must have...More  ","tripadvisor_monas_22":"a must place to go for those who appreciate history , quite well preserved, but the DKI government should spent more money to kae it a fisrt class tourist attraction","tripadvisor_monas_23":"a must place to go for those who appreciate history , quite well preserved, but the DKI government should spent more money to kae it a fisrt class tourist attraction","tripadvisor_monas_24":"I stumbled on to this hidden gem my chance and thoroughly enjoyed my visit. The architecture is very elegant and well-restored. It provides a sense of the opulence of the Dutch elite in Batavia. An hour is sufficient. Definitely worth a visit!","tripadvisor_monas_25":"There is a mystical part of this building, as it was used as the prison for politic imprisoners such as some Indonesian heroes : Si Pitung etc. I've visited this place many times even someof neighbors use it for wedding events and I love it soooo much","tripadvisor_monas_26":"I actually visit it when attending a function. Very nice Dutch architecture.","tripadvisor_monas_27":"purrrrfect place for a romantic garden party and for wedding party .. the ambience is so romantic with the open sky and nice green grass..","tripadvisor_monas_28":"located in jalan Gajah Mada, beside GRAMEDIA BOOK STORE, and RADIO SONORA.u cannot find any archives at there, due they move all archives to another places.U can see old building architecture and now many people will do Pre Wedding Picture over there.it's free entry, but when u put ur name onthe guest book, they will asking for...More  ","tripadvisor_monas_29":"If you look at the building or the surroundings, you'll be quite amaze how a museum can be so arthistic and beautiful, especially the one that keep archives!! In the night time, the light and the atmosphere even more beautiful and romantic.","tripadvisor_monas_30":"Despite its name, in true Jakarta style this museum is nothing to do with the National Archives (which is in a new building in South Jakarta). But it is well worth a visit. The building was constructed around 1760 as the home of a prominent Dutch businessman and later Governor of Batavia, Reiner de Klerk. It was restored in 2000...More  "}