{"tripadvisor_monas_0":"Fantastic way to get away from the shopping malls. Not really geared to western tourists, you'll pay more than the 6,000 locals pay, actually 30,000 but still less than £2. Cold...read more ","tripadvisor_monas_1":"Fantastic way to get away from the shopping malls. Not really geared to western tourists, you'll pay more than the 6,000 locals pay, actually 30,000 but still less than £2. Cold drinks are more expensive if you look foreign, a guy in front of me paid 2,000 for a bottle of water I was charged 6,000. Nothing is written in...More  ","tripadvisor_monas_2":"Came here today with my toddler son. Very reasonable entrance fee, Rp. 4.000 only. Too bad, the elephant rides only available on weekend. It should be available on weekdays too.The place is much cleaner now then few years ago, it definitely makes several improvements. My son was playing at the play area, some of the playing facilities seemed need...More  ","tripadvisor_monas_3":"Been trying to walk early in the morning when most people are busy to prepare all their stuff to sell. The sound of animals and trees will making your jogging activities more enjoyable. By the time, around 6AM they didnt charge me for a ticket :)","tripadvisor_monas_4":"If you get bored to go to the mall every weekend just to look for an entertainment after hectic work day, maybe you can consider to go to ragunan zoo.With a cheap ticket, you could see many animals and make your children happy. If you tired of walking, you can rent a bike or just have picnic under the...More  ","tripadvisor_monas_5":"Ticket price just Idr4000. But can spend your whole day there. The area is big. A lot of animal. Alot of local ppl go there picnic too. Overall the zoo look like quite old age and facility look like old age too, hope can have more improvement. Curious how they can maintenance the zoo with this cheap ticket price.","tripadvisor_monas_6":"good to visit with kids its far from the city although , its a very big zoo need with small kids not advisable you will hv to carry them all nothing to eat much inside the zoo","tripadvisor_monas_7":"the zoo's most great feature is the size of it: 140 acres! You can jog, renting bikes (or bring your own), or just walk in it from north gate to south and back. but the animals there are just average. some look skinny and sad too. some of the directions are not too precise so it will take a lots...More  ","tripadvisor_monas_8":"Big area and large with the various animal and a lot of place to see the attractions is more valuable for the zoo","tripadvisor_monas_9":"I have to say this was one of the best Zoos our family has been to in regards to the ease and price. It was not crowded, its clean and shady, and plenty of vendors to get lunch or plenty of parks to sit down if you take your own lunch.","tripadvisor_monas_10":"I went there with couple of friends I like it, they have good variety of animals.The only two I didn't like that the bathroom are not so clean.Also the animals looked so tired.Bring with you water and wear comfy clothes and sport shoes.","tripadvisor_monas_11":"Go there on weekday! Weekend is too crowded! Its also a good place to walk bcs its a huge land. Maintainance wise it is very old and for me it is a bit hard to find the animals i...read more ","tripadvisor_monas_12":"A horrible run down zoo. This could have been better should they do proper maintenance with better facilities. You can do without coming here.","tripadvisor_monas_13":"With so many animal collections, this is surely a good place gor the young and old to know or study animal. The place itself is considered cool coz so many trees around. It is also good for those who wants to have a walking sport while watching around. The ticket considered cheap. Better come on weekdays to avoid traffic and...More  ","tripadvisor_monas_14":"The zoo itself is quite poor! The facilities are run down, the animals seem quite unhappy and tired of all the hustle of huge crowds specially on the weekends! I found myself having to crawl between crowds to see the animals and show them to my little daughter who got so upset she didn't want to see them anymore and...More  ","tripadvisor_monas_15":"Go there on weekday! Weekend is too crowded! Its also a good place to walk bcs its a huge land. Maintainance wise it is very old and for me it is a bit hard to find the animals i want due to lack of information post in the zoo. PS: if you need food, get one at the foodcourt nearby...More  ","tripadvisor_monas_16":"To mention first- yes the zoo would Need some maintenance. But the animals look ok, they have enough space and don't look sick. The area itself is a wonderful getaway from busy, polluted Jakarta. Lots of trees and areas to sit down for a picnic.Some areas are closed but there is so much to see anyway. Remember to avoid...More  ","tripadvisor_monas_17":"the zoo can be good refresh place specially for kids, very spacious and also variety of animal. indeed not really well maintain, and not as clean,but okay to visit tho.","tripadvisor_monas_18":"Not just a normal zoo, Ragunan is visited also because of its greenery. Except on weekends and public holidays, it is a nice area to walk around for its big trees and ample place to do picnic, especially in the morning. The collection of animals also. good. Many food sellers and people offering mat for rent at reasonable price -...More  ","tripadvisor_monas_19":"The newish Primate enclosure is great - we felt we were he caged ones! Some enclosures not so pleasant. But worth a visit to stretch the legs and see many fascinating creatures.","tripadvisor_monas_20":"The site was not maintained well. So many broken facilities and no sufficient control on visitors. We used the big convention hall but the AC was not working well. Guests should sit on the floor. Not convenient at all. No proper restaurants, only hawkers (kaki lima) were available. Not recommended place to visit.","tripadvisor_monas_21":"The animal collection is quite good; lions, tigers, elephants, bears, snakes, birds, giraffe, zebra, and many more... The good things are the tickets are cheap, the toilets are old but clean, the parking lot is big... But please be prepared for the hot n humid weather, so make sure you drink enough water...","tripadvisor_monas_22":"Ragunan zoo is quite spread out, which makes it a good place for a walk or a bike ride. The zoo itself is ok. Plenty to be improved.","tripadvisor_monas_23":"It could be so much more, a conservation for Indonesian endangered species or educations for the children. But in reality it seems to be just there without proper management or attention. Such a pity...","tripadvisor_monas_24":"because i love animal and i have been to several other zoos, this place is quite poorly managed. the animals looks unhealthy and the cages looks like it hasn't been cleaned for a while. but it is cheap","tripadvisor_monas_25":"Ragunan zoo is quite spread out, which makes it a good place for a walk or a bike ride. The zoo itself is ok. Plenty to be improved.","tripadvisor_monas_26":"What can i say about this zoo.. It is definitely very cheap!!With less than $1 per pax you can enter this zoo and spend your time with your kids.Notable animals are lion (and tiger of course) and all kind of chimpanzees","tripadvisor_monas_27":"It was sad to know the fact that gorilla population getting less and less. I thought they need to add some more varieties for the animal. In general the animal are common everywhere. I didn’t see any special species in here.!","tripadvisor_monas_28":"Spent the morning there. Firstly nice and green and pretty well maintained walking tracks. It is huge but really has limited animals for its size and sign posting / directions to the enclosures are practically non existent. Recommend you arrive early and hire a bike and try not to get lost in the endless long trails between enclosures.","tripadvisor_monas_29":"We visited the zoo on a Saturday morning, arriving just after 7 am, so no problems with traffic, the weather was cool, and it wasn't too busy yet. This is a great place to walk.According to Wikipedia, the Jakarta Zoo is the 3rd oldest zoo in the world, which means that the exhibits still showcase a fair bit of...More  ","tripadvisor_monas_30":"I think it is the biggest zoo in Indonesia. Of Course, it has lots of animals. Recommended for educational purpose.If you want to explore this zoo, you should rent a bike or wear sport shoes.Also the price is very cheap, about Rp. 4.000,-. Suitable for less-budget traveler.","tripadvisor_monas_31":"I'm a Saturday afternoon we decided to go to the zoo.Unfortunately we arrived close to 4pm and it closes at 4pm.Huge traffic and rain (consider that before you go there)The entry is IDR 4000 (really cheap)At the entrance you can rent a bicycle to go around (I strongly recommend )This zoo is huge so if...More  ","tripadvisor_monas_32":"the biggest zoo I've ever visited. their animals also very complete. So amazing. but, some cages smell so stinky. and until now I still remembering that in my nouse.","tripadvisor_monas_33":"Visiting ragunan zoo, especially for kids and students, might create their brain to be smarter. It supports their brain to memorize the name of the animal and its latin language...read more ","tripadvisor_monas_34":"Visiting ragunan zoo, especially for kids and students, might create their brain to be smarter. It supports their brain to memorize the name of the animal and its latin language. Even for kids under 5 years old, they start to know the each names of the animal.","tripadvisor_monas_35":"One of the largest zoo in Indonesia, Ragunan Zoo have many ependic animal from Asia especialy from IndonesiaBut i suggest to don't come in public holiday, theres so many people come here for enjoying holiday","tripadvisor_monas_36":"From my perspective there are two good reasons to go to this Zoo. One, there is a lot of green space, something that is very hard to come by in Jakarta. The second is the amazing assortment of monkeys and primates, most of them from Indonesia that you can see.And its so very cheep! Go early befor the crowds.","tripadvisor_monas_37":"One of cheaper place for family vacation. But this zoo, it is not clean enough, especially during long weekend, it is too crowded and no longer convenient for family holiday","tripadvisor_monas_38":"Ragunan Zoo is now tidier and cleaner. They've made some improvements too. The cages don't look pathetic anymore.","tripadvisor_monas_39":"As a fellow Jakartans, I need to continuously looking for a place to spend weekend or holiday within Jakarta or nearby city. Not willing to give up to go to malls for recreation, make Ragunan as one of my family go to place. This zoo was built on a very large area. Hosnestly to go from one animal to another...More  ","tripadvisor_monas_40":"This is a zoo Locate ad East Jakarta and Very Big area. Good place to do some recreation with Family. Here we can see many Animals. For the ticket no so expensive and can be reach by public transport by transjakarta Bus. This Zoo very very crowded on certain season/period","tripadvisor_monas_41":"Ragunan Zoo is not the most beautiful zoo in Indonesia, animal collection is not too complete, and poorly maintained. But even with that factors, this zoo is always crowded in weekend and holiday because the entrance fee is so cheap.Many people visit this zoo not just to see animal, some of them use this zoo as a place for...More  ","tripadvisor_monas_42":"One of favorite spots for weekend and holidays. It has a great variety of animals including elephant, tiger, bear, komodo, and so on. Good place for children.","tripadvisor_monas_43":"This zoo might be one of the cheapest and most complete zoo in Jakarta! I was so surprised seeing white tiger in it. It's just I can't stand the heat, making me didn't visit all the animals inside. Make sure to rent a bike/bicycle coz it'll be a very long journey to get around the zoo!","tripadvisor_monas_44":"This is a nice place to come to get some fresh air and open space. The entrance fee is low. For another small fee you can ride the 'train' around the park, which is a nice way...read more ","tripadvisor_monas_45":"This is a nice place to come to get some fresh air and open space. The entrance fee is low. For another small fee you can ride the 'train' around the park, which is a nice way to cover a lot of ground. There are some somewhat sketchy kids' rides, also for a nominal price. You can also pay to...More  ","tripadvisor_monas_46":"This zoo has a great variety of animals, and they're all very active. I'm from Australia, so it was good to see animals that I'm not used to seeing in Western zoos as there was a lot of emphasis on asian animals. It's also a really big park- the premises is quite large, so I recommend you spend a full...More  ","tripadvisor_monas_47":"we always go to Ragunan at least 2 times in a month, my kids love to rent a bike and we go around the zoo , in the morning situation still quite, only few people, but after 9 AM, it will be starting many people","tripadvisor_monas_48":"I recommend to visit in morning time while jogging (if you loved to), because the air still fresh and not too packed. Besides animals, you can enjoy lake view in this zoo,I recommend wearing running shoes and comfortable shirt.Ticket is only Rp. 4000 / pax, entrance fee per car Rp. 6000Do not come at Indonesian Public Holiday,...More  ","tripadvisor_monas_49":"It is much larger than Singaporean zoo but much less fund too. If you and us feel that this the largest greenest park in a capital city lets work together to preserve either by fund raising or G to G development work. It is should be separated become two area first class and economy class","tripadvisor_monas_50":"The ticket \"really\" cheap, no more than 5000 IDR. The place is really big and you will take almost whole day to see every animals there. The collection not quite vary, and from one area to other area separated quite far.If you bring children you better take train tour inside the zoo rather than take a walk.","tripadvisor_monas_51":"Only if you want to see some Indonesian animals, it is worth a visit. The price is 4500 IDR, but the monkeys and the birds are living in old cages, not the modern vision of a zoo","tripadvisor_monas_52":"a big zoo located at jakarta. surprisingly ragunan zoo is really big and quite entertaining. some part need to be renovated but mostly the animal site is good and already renovated. and i hope they put bigger and much more signs in the area since it is really big so we dont get lost and confused.","tripadvisor_monas_53":"Location big and easy to get arounds but need improve some area dirty a lot trash still a lot to do socialize important to keep zoo clean.","tripadvisor_monas_54":"I went to this zoo with my daughters and my grandchildren. It is not far from our house. The complex is huge and has a lot of tress so it is not so hot there. The variety of animals just like in other zoos. The fee is \"very\" cheap, so that maybe thre is no enough fund to maintain and...More  ","tripadvisor_monas_55":"This zoo set in acres of grounds is quite sad looking as there has been no rain since June. The trees and shrubs are suffering from it. I was very unhappy with the monkeys in...read more ","tripadvisor_monas_56":"This zoo set in acres of grounds is quite sad looking as there has been no rain since June. The trees and shrubs are suffering from it. I was very unhappy with the monkeys in cages. Many were alone and quite obviously unhappy. The facilities in the cages for the monkeys to gain some pleasure or exercise was lacking and...More  ","tripadvisor_monas_57":"Tickets are cheap, entrance fee only Rp. 4500 per person (per October '15). Free for kids under 3 yo. Even you can park your car a whole day for only Rp.6500.The zoo opens from Tuesday - Sunday, untill 5 PM. Closed on Moday to give the animals a break from human visitors :) The area is very large, but...More  ","tripadvisor_monas_58":"I visited the zoo with my wife and little daughter.It's one of the biggest zoo in Indonesia with almost complete collection of animals.The zoo is very well managed and very clean to Indonesian public space standard. In the morning you could enjoy bicycling or jog around the zoo. On weekends normally it's very busy with visitors. I purposedly...More  ","tripadvisor_monas_59":"Ragunan Zoo is a large and poorly-maintaied zoo in South Jakarta. It is relatively easy to get to by car and there are various entry points. Parking early on a weekend morning is pretty easy to find. Entry cost is pretty minimal for those used to international prices.The zoo is a large grid with pathways routing around enclosures on...More  ","tripadvisor_monas_60":"Zoo was great, better than any zoo i have been in yet. First it starts off with a live safari through the mountains in your own car and get up close and personal with all the jungle animals. Get to feed them as well. That goes for about 2hrs. Then you go into the actual zoo but this zoo, is...More  ","tripadvisor_monas_61":"This is a place to avoid in Jakarta. Apart from the fact that it can be very crowded, due to the liw entdance fee: there is nothing to see. There are hardly any animals.It used to be a very nice zoo in the early nineties but due to corruption and bad management, it is like it is now. Yes...More  ","tripadvisor_monas_62":"Been to this zoo q couple times. A favorite place for locals to come for their weekend picnic.Place is huge, but not well maintained.Entry is cheap, which probably explained the substandard conditions.","tripadvisor_monas_63":"One of the largest zoo in Indonesia, quite tired to walk on feet if you want to go around the zoo. Basically the place is supposed to be good but lack of maintenance.Though some animals are in great shapes, some I found depressed, which is too bad :( their cages are mostly tired and old.But all in all,...More  ","tripadvisor_monas_64":"Had some time spare so we decided to go to this zoo with our 2 children. I was shocked to see how dirty it was. Not that there are no bins but people just leave their rubbish everywhere. What a shame. Entrance fee was very cheap. For some reason we didn't get to see a great deal of animals. It...More  ","tripadvisor_monas_65":"With the TransJakarta Bus the Ragunan Zoo is easy accessible, takes some time though.The entry fee is so cheap, around 6000 rupia and the area is huge. To see the whole zoo you definitely need more than half a day, but unfortunately half of the cages or open areas for the animals were empty. Especially the famous tiger areas...More  ","tripadvisor_monas_66":"As an expat from Sydney I must confess to being very biased when it comes to what to expect when visiting a zoo for the first time. Anyone who's been to Sydney's Taronga Zoo will...read more ","tripadvisor_monas_67":"We visited the zoo in Jakarta a few days ago and I was astonished to see how the animals are caged it was heart breaking to see a white tiger in a pen that was very small and with only dirty water to drink , there were monkeys in enclosures that were very small , I would not recommend this...More  ","tripadvisor_monas_68":"As an expat from Sydney I must confess to being very biased when it comes to what to expect when visiting a zoo for the first time. Anyone who's been to Sydney's Taronga Zoo will know it's a tough act to follow.So my expectations were quite low for the Jakarta Ragunan Zoo. How wrong I was.While some of...More  ","tripadvisor_monas_69":"Very cheap and potentially a good family day out.However the animal enclosures appear small, whilst many bigger animals show signs of repetitive behavior ( ie possibly in distress) My twenty year old daughter was most upset for some animals and refused to take the elephant which we had really gone there for.Would suggest people go there and make...More  ","tripadvisor_monas_70":"I visited on April 2015 with a friend because we were very curious about a zoo in a big and hot town like Jakarta. As predicted the air is very very hot even though so many trees and the map is very confusing. The animals looks sad somehow and surprisingly the visitor gives the animal human's snack!My friend want...More  ","tripadvisor_monas_71":"I love this place since I consider this as the greenest area in the city (Jakarta). They have nice collection of animals and kid zoo. The entire area can be considered as clean place.Since this is very large zoo, you can rent bike there. Unfortunately they don't provide hand map. It is understandable since tickets are really cheap.This...More  ","tripadvisor_monas_72":"I was been visiting Ragunan Zoo on 16 July 2015, with some friends and 1 nephew 4years old. We like the place, clean and shady with the tree, nice walking and chat during our trip to Ragunan Zoo, spacious garden and great pathaway for picnic, lunch box or relaxing walking and chat activity but the animal collection, its so pity....More  ","tripadvisor_monas_73":"I took my 2 little boys to Ragunan and they seemed to enjoy it and interested in the animals, especially the older one. He asked a lot of questions about them. Overall, I think Ragunan is worth to go to with your little ones. It is clean, it has many big trees that give you fresh air, the animals are...More  ","tripadvisor_monas_74":"I go there once a week for a run. I usually dont see the animals, because I am there for some fresh air and a little jog. To be honest the animals dont seem to badly looked after - remember the culture of animal treatment in Indonesia - you will soon appreciate the animals are treated far better int his...More  ","tripadvisor_monas_75":"It's a bit of a run down, messy zoo, with animals that don't look like they have the best care here. If you want to go to a zoo in the region, the one in Singapore or Bali is miles ahead of Ragunan. Also the \"drive through\" zoo in Bogor is a lot better than this.","tripadvisor_monas_76":"I think they need to improve the maintenance of the zoo. but the pecans outside the zoo near the exit gate is breathtaking. the population of the animals especially gorilla is less and lesser. they need to breed their animals and variate the species.","tripadvisor_monas_77":"As the title say, the zoo doesn't have any interesting animal collection. Just a standard animal that you can see in every zoo. The place is not too pretty enough. In the weekend...read more ","tripadvisor_monas_78":"As the title say, the zoo doesn't have any interesting animal collection. Just a standard animal that you can see in every zoo. The place is not too pretty enough. In the weekend there are many people go for a small jog there. I'd rather say this zoo is more interesting as a place to jog rather than seeing animal....More  ","tripadvisor_monas_79":"The animals were poorly malnourished. They were so skinny that the sight of it just make you sad. Went there for a date, coming home sad. :-(","tripadvisor_monas_80":"A huge zoo with marvelous gardens but they seem to pay more attention to their gardens than their animals, they were very sad, dry and unkept. I wouldn't pay a penny to go. It's a totally disgrace!","tripadvisor_monas_81":"This attraction is aimed at local Indonesians NOT tourists as the fee to get in is extremely cheap. Some of the animals have lots of room but others do not; some enclosures have lots of rubbish that have been thrown in. It is a huge zoo and is not well organised so hard to find everything. The fairly new primate...More  ","tripadvisor_monas_82":"If you're looking for something on the lines of the Singapore night safari, you will be disappointed. But if you compare it to other zoos in Indonesia it's not really that bad.Of course the cages could be a little nicer, the food and restrooms could be a lot nicer, and it would be great if they properly guarded the...More  ","tripadvisor_monas_83":"I have to split this review into several area: Cleanliness, Variations, Attractions, FoodsLets start with cleanliness,for the most area, the zoo is very clean. lets give it a 5toilet: worst. yes, the worst. smelly, dark, untreated. i said 0Variations.Zoo, i expect to see a lot of animal variations. what i see here, a small kind...More  ","tripadvisor_monas_84":"I think when we'll try to visit this zoo.. the first impression is good place for refreshing while slow walking. In addition that this zoo has a lot of trees and makes the air so fresh when we sniffing.. so good :D","tripadvisor_monas_85":"This zoo really needs an overhaul in terms of cleaning up the trash, giving the animals better habitats and things to do for stimulus. The animals seemed often in poor health, very stressed, with no toys or things for them to do all day except sit in sweltering heat. The canals and waterways were clogged with trash and pollution. It...More  ","tripadvisor_monas_86":"I got into the park an immediately saw the huuuuge compound for the Pelicans. It looked amazing and I was wondering how they could finance all this with the cheap entrance fees.However this first compound was the best one... The leopards were in pretty small cages, and the apes were almost all in bird cages... The orang-utan was eating...More  ","tripadvisor_monas_87":"I went there a week ago, and some animals were not in their place.Actually the environment is not bad, the entrance fee is cheap, but i'm wondering does the cheap entrance fee make the tiger starving?? Because the Sumatran tiger was very skinny when I saw it a week ago. I'm wondering if the tiger is fed properly. I...More  ","tripadvisor_monas_88":"Entrance ticket to the zoo was 6000 Rupiah and with most sign indicators being in Indonesian i literally lost myself on entering this huge zoological park.Luckily there were...read more ","tripadvisor_monas_89":"Entrance ticket to the zoo was 6000 Rupiah and with most sign indicators being in Indonesian i literally lost myself on entering this huge zoological park.Luckily there were direction signposts with the animals photo's and hence managed to guide myself inside the zoo.For the first time saw the \"Sumatran tiger\" ,kept in small circular moat enclosures.Most of the large Carnivores...More  ","tripadvisor_monas_90":"I went to this zoo with great expectation, the entrance fee is so cheap, only 4500 rupiah to enter the zoo and 6000 rupiah or something to enter schmutzer primate centre. well but what made this zoo very poor is because the location of the animal is unorganized. what shown in the map is different that what shown in the...More  ","tripadvisor_monas_91":"visited this zoo more than 5 times, i just love the fresh air, so many huge trees.but the animal? I think those animals are in poor treatments.","tripadvisor_monas_92":"I came to the zoo for I had seen the movie Kebun Binatang. Strangely, although the film was mostly about giraffes, I did not see even a sign about those not too small animals.Anyway, with only 4500 rps you can see some wild animals almost in their natural environment, without looking through the bars. This is a major privilege...More  ","tripadvisor_monas_93":"I visited the Rangunan Zoo at 27.06.2014 in the morning. The Zoo ist at the weekend very crowded and I decided to wake up early to be one of the first visitors. Compared with a normale european Zoo, this one is enormous huge.The entrance is very cheap, only 4,500 Rp for one adult. The employee at the entrance was...More  ","tripadvisor_monas_94":"Do not go here. As an animal lover I was just horrified by the terrible living conditions of these poor animals. Even people who don't love animals feel the same way. Avoid this entirely.","tripadvisor_monas_95":"I was Appalled on the Standard of Living of the Life Animals, and the Bear was Trying to get back inside, lifting the Gate, and was Dropping on it's Paws, also going round in Circles, Poor thing, and I will be taking this up with the Higher Authorities, cause there is no need to Keep Animals has they are, including...More  ","tripadvisor_monas_96":"This place is an oasis in the hectic-busy-traffic of Jakarta.. I came here on may and pay 4500 rupiah both for locals and foreigners. One thing for sure in Jakarta there is no different treatment for local and visitors. 4500 is damn cheap about less than 50 cents. If you wish to see Gorila you need to pay again less...More  ","tripadvisor_monas_97":"If you stay a long time in Jakarta, you will need to visit Ragunan Zoo in order to see a decent park. There are very few places elsewhere in Jakarta where you can sit and have a picnic on the lawn or stroll through shady treed areas.The admission is inexpensive.Many of the zoos in Southeast Asia are not...More  ","tripadvisor_monas_98":"The Zoo is a great visit as it houses some of Indonesias most famous animals including Komodo Dragons, Sumatran Tiger and Elephants and Orang utans. It is a bit of a hike out there considering Jakarta traffic but it is also nice because of the many beautiful and peaceful gardens surrounding the zoo. The entry fee is very small (...More  ","tripadvisor_monas_99":"alot of grounds, generally busy. interesting things to see.fun day all around.locals welcomed me as an expat with no issues.","tripadvisor_monas_100":"I really did love the beautiful trees all over the grounds. A wonderful spot for family walks and picnics. The little one and I immediately rented a tandem bike upon entry so we can explore the place. I think tandems are cool, but I think for a parent with a child, a normal bike with a seat at the back...More  ","tripadvisor_monas_101":"alot of grounds, generally busy. interesting things to see.fun day all around.locals welcomed me as an expat with no issues.","tripadvisor_monas_102":"We visited the Jakarta Zoo today. After reading all of the negative reviews we really wondered if we should go or not. However we are trying to see as much of Jakarta as we can and felt we needed to go. So we did, and we were very glad we did.This is not an excellent zoo nor is it...More  ","tripadvisor_monas_103":"It's a very disappointing zoo. The variety of animals is really poor. The upkeep of the animals area and public areas are also very poor. People just throw their rubbish wherever they please. It's typical indonesian. The only positive is that it's cheap admission and a good place to see some green areas in the crammed space of Jakarta.(that's if...More  ","tripadvisor_monas_104":"I was really disappointed in that zoo. Even though the entrance is cheap I felt like it was a waste of time. It's not well organised at all and you cannot see the animals as they are hiding. Also the animal areas are far away from each other and so you have to walk for a long period which is...More  ","tripadvisor_monas_105":"Only good for locals. Tourist will find this zoo VERY dissapointing in all aspects: service, cleanliness, variety of animals, facility maintenance, and almost everything else.It's only good for local people, because it's the only zoo in town! In my opinion, probably the worst zoo in South East Asia.","tripadvisor_monas_106":"I remember the Ragunan zoo from a visit around 1990. A great zoo.Now it is only a very big garden with empty cages and really nothing to see, except a few elephants, pelicans, a komodo dragon and one lion in a very small cage.Avoid this zoo at any price. It is not a zoo at all, it is...More  ","tripadvisor_monas_107":"After planning a visit to this zoo, with the purpose of writing a review about it...Ive not much to write about it. Disgusting, bad excuse for a zoo..The idea of zoos is as i thought to educate people about animals...All enclosures have litter in them, plastic , metal cans, remains of food thrown in....The animals dont...More  ","tripadvisor_monas_108":"The varieties of the animal there is perfect! the zoo actually is quiet large so it's really good because that means we get to see more, and the entrance fee is damn cheap for a zoo! The surrounding area of the zoo is like a tranquility since trees is all over the place, a good way to get away from...More  ","tripadvisor_monas_109":"The zoo covers a very large area and walking around this place gives a good exercise...we can also rent a bicycle and go around...as a park its green and beautiful...the primate's center is well maintained...the other animals and birds display places were stinky...the animals in the show looked very pathetic...only the pelicans and the lake in which they were looked...More  ","tripadvisor_monas_110":"large park area, decent animal display, cheap entrance, many other activities.Nice day out in jakarta for a family, suitable for foreigners as well. Easy to acces (busway...read more ","tripadvisor_monas_111":"large park area, decent animal display, cheap entrance, many other activities.Nice day out in jakarta for a family, suitable for foreigners as well. Easy to acces (busway Ragunan or taxi express).","tripadvisor_monas_112":"I was prepared to see worse things ( I was a couple of weeks in BandungZoo) but it was actually better. Some animals where in small cages though, but most, e.g. lions, had some free space. There was no rubbish and no people threatening the animals. There was plenty of activities, like go carts and elephant riding, and there where...More  ","tripadvisor_monas_113":"Just one more time I go there... I don't know if why goverment doest look inside, there's many gurbish and people don't understand... they smoke everywhere...","tripadvisor_monas_114":"The poor animals in this zoo are merely serving as exotic back drop for family outings, company functions, photo shoots etc.You can't blame the people of Jakarta for going there as it is one of the few green spaces available in the entire city which is also relatively clean and has a minimum entry fee. Unfortunately the visitors leave...More  ","tripadvisor_monas_115":"Ragunan Zoo is one of my favorite places, which I often visited in weekend. Apart from the many animals collection, it is a nice place to walk around, give my body a good exercise, after a routine weekdays work.I also liked to sit back on the benches that were located everywhere in the huge park, just to enjoy the...More  ","tripadvisor_monas_116":"The area is large and good for picnic. There is smuthzer-cage also to see gorillas. The zoo provide bike-rent if we want to see around. This zoo is not only good for family-relaxation but also sports. The collection of the animal not so many","tripadvisor_monas_117":"This large zoo is quite easy accesible with the Busway line. In my opinion, the most convenient way is to either change stations at Dukuh Atas from K1, or directly go from Sarinah (middle door) to Ragunan (grey buses). Once there the ticket is very cheap, I guess it was 4000 RP. However, the entry to the gorilla park costs...More  ","tripadvisor_monas_118":"We really enjoyed our morning here ( we found it too hot to stay all day, and I'd recommend arriving as early as possible.) As much as anything, it's a beautiful park, busy in parts but I felt that just added to the atmosphere. There aren't animals everywhere you look, and it seems some people just come to enjoy the...More  ","tripadvisor_monas_119":"Go at 6am, venture a walk. I spent many times with my 5 year old exploring and conversing in wonder. I let him interact with the officers and we had so much fun. He developed the respect for nature and animals there. Surely you can't expect a zoo not to smell like a zoo, so do brace yourself. You're there...More  ","tripadvisor_monas_120":"I can't enjoy the show nor the animal living there since I have to hold my breath. Its crazy stinky and dirty.","tripadvisor_monas_121":"-visit on weekday,too crowded on weekends and public holidays-nice peaceful place on weekdays- boat ride is good- hire a bike and bike around the zoo (weekdays only)- take...read more ","tripadvisor_monas_122":"-visit on weekday,too crowded on weekends and public holidays-nice peaceful place on weekdays- boat ride is good- hire a bike and bike around the zoo (weekdays only)- take ride on the tram-they have a good collection of animals but most of them look lethargic and sleepy.-and drink a lot of water","tripadvisor_monas_123":"BYO food or travel a bit further out from the location. Of course, there are food inside, but don't expect luxury. Other than the food, all good.","tripadvisor_monas_124":"Ragunan Zoo is in best condition to visit from 6am, before its too crowded by visitors. Bring your bikes or rent it there. The bike rental is open from 7am on weekends. Explore the lake, woods. Visit Schmutzer Primate Centre also.Bring your own drink and snacks in boxes, so keep the zoo clean. Wear caps and sunglasses.The Kerak...More  ","tripadvisor_monas_125":"The places were horrible, it was packed with lots of people. There were lots of empty exhibit, and lots of animal that look lifeless or sick... The surrounding is very dirty with lots of garbage","tripadvisor_monas_126":"Terrible, I'm wondering where the animals are? Are they hiding or there are no animals around in Ragunan Zoo? Suggest you to visit Taman Safari Indonesia Cisarua Puncak better.","tripadvisor_monas_127":"One of a good place to take the children to see the animal. Unfortunately, the authorities doesn't really take a good care or maintenance to the public amenities.","tripadvisor_monas_128":"I went there last month for a gathering. The place has a very cheap entrance ticket price. But too bad the management seem not to keep this place well. Kind of dirty. I don't blame the management for this, the patrons need to be more discipline to keep this place clean as well. My concern is the F&B vendors there....More  ","tripadvisor_monas_129":"feel the natural echo.feeding the mamals the feedback i feel very honour guy save the nature save the green in the heart of citylife","tripadvisor_monas_130":"some of the cages is in poor condition,not giving the animals enough space to move. However, Schmutzer Primate Canter is a must visit, especially in the morning when there are not many people around. You can see gorilla,monkey and its family just before your eyes.It feels like you're in jungle.","tripadvisor_monas_131":"The exhibitions were dirty and the animals looked very pitiful and hungry. The zoo itself wasn't well maintained.","tripadvisor_monas_132":"K, I went there with 1 purpose in mind, to c a komodo dragon. And I did, there are actually 5 or 6. This reptile is unique and, as u know, a rare sight to foreigners. But they...read more ","tripadvisor_monas_133":"K, I went there with 1 purpose in mind, to c a komodo dragon. And I did, there are actually 5 or 6. This reptile is unique and, as u know, a rare sight to foreigners. But they have it there! Just for that and it's worth paying a visit. Entrance fee is less then a dollar, ridiculous. They have...More  ","tripadvisor_monas_134":"large area to explore, most animals have decient space and clean habitat. Not modern in any way, but in early morning you get the taste of urban wilderness and fantastic Bird - Gibbon sounds.","tripadvisor_monas_135":"It's still the biggest and the most complete zoo in the country (perhaps also south east asia. i love spending the day checking out the animals, it's just I think they need to maintain it better. more cages were empty, so they need to get more animals to replace the dead ones i suppose.","tripadvisor_monas_136":"Do not expect fancy zoo where signs are dependable and animals appears comfortable.But this zoo is the best bet in Jakarta. I recommend going straight to the primate centre at the back (if you enter from main gate)compared to the ragunan zoo it encloses, this largest primate centre in Asia (i think) is in much better condition and...More  ","tripadvisor_monas_137":"Not a great place to really see animals. Yeah, you can't really expect this is a great zoo but Ragunan is a good place to escape from Jakarta's routinity and to find some fresh air.I went here around 8 am, and the trees and scenery is good enough to replenish your stamina. Just don't expect to see interesting animals,...More  ","tripadvisor_monas_138":"Well, I live in Jakarta. And we do not have too many options to take our kid out to spend outside. Ragunan is a huge park, not so many animals. But was enough for my 2,5 years old. the entrance fee is almost nothing. do not remember exactly how much I paid, but it is something between 5000 - 7000...More  ","tripadvisor_monas_139":"Go during office hours and ride one of their mini train. If your family is large, they even provide you with guide. The jewel is schmutzer primate centre, latest facility and cleaner too (pay extra fare to get inside)","tripadvisor_monas_140":"Ragunan zoo is located in Pasar Minggu, South of Jakarta, with area of 140-hectare. The zoo housed many endangered and threatened species from all parts of Indonesia and some parts of the world: Komodo dragon, Orangutan, Gorilla, Macaques, Langur, Gibbon, Lion, Tiger, Leopard, Peacock, Elephant, Lemur, Pelican, Deer, Crocodile, Hippopotamus, and many kinds of colorful birds, snakes and fishes. The...More  ","tripadvisor_monas_141":"Its great to take a bicycle ride in the morning as the zoo precinct is soo huge with big trees, also its very near to my house so i always jog/biking there every weekend morning..","tripadvisor_monas_142":"I hate it that it is so dirty and smelly and I think the animals there are also not kept well. I wouldn't visit Ragunan Zoo again.","tripadvisor_monas_143":"Interesting collection of animals, should have more informative signages , helpful officers to guide the visitors, and maybe interesting programs for the kids to know more about...read more ","tripadvisor_monas_144":"This zoo is by no means a great zoo but the people of Indonesia like it as they all seem to come here for the open spaces and somewhere to walk with out a motor cycle running you down on the side walk. If you are expecting a zoo with high standards then you will be disappointed many animals are...More  ","tripadvisor_monas_145":"Interesting collection of animals, should have more informative signages , helpful officers to guide the visitors, and maybe interesting programs for the kids to know more about the animals.","tripadvisor_monas_146":"This is the right place if you are looking for a extremely cheap entrance fee, lush gardens and some common animals. It is not that well maintained but still, thousands of Jakarta families flock here to enjoy their weekends and holidays.","tripadvisor_monas_147":"I loved running inside the zoo on Saturday or Sunday morning. Fresh air, nice ambience","tripadvisor_monas_148":"by far ragunan zoo is the worst i've ever visited and i guess it's one of the worst zoo in the universe..nothing to see, garbage everywhere, animals there looked so miserable, no street sign i got lost trying to find the exit gate...what a shame..","tripadvisor_monas_149":"Specially I give intention to the cleanliness. All area are dirty. Infrastructure for visitor is poor","tripadvisor_monas_150":"Hot and dirty too! No proper map either........................","tripadvisor_monas_151":"With all the animal, the Kebun Binatang Ragunan actually quite nice, it's offer a fresh air in the middle of city. The problem arises when a lot people start to picnic and throwing their trash randomly.","tripadvisor_monas_152":"I think the management has to pay more attention to the animals and the facilities in the zoo. It seems that we travel to see the empty cage instead of to see the animals","tripadvisor_monas_153":"Ragunan Zoo is located in Taman, South Jakarta (most taxi drivers will know how to get there, about 20 minutes with no traffic and 25,000 rupiah from Kemang). The entry fee for adults is 4000 and kids (3 and up) 3000. The main entrance is located at the North Gate (Pintu Utara). I visited on a Monday morning from around...More  ","tripadvisor_monas_154":"Well if you want to see the animal better, just go to Taman Safari instead.","tripadvisor_monas_155":"far from Singapore zoo standard :( must must must must improve","tripadvisor_monas_156":"Well if you want to see the animal better, just go to Taman Safari instead.","tripadvisor_monas_157":"The locals love to come here on weekends, so be prepared for the crowds. Great place to take kids. However the grounds are old and unupdated. I wish they would put more money into this venue. It gives the people an alternative place to go other than the mind numbing MALL weekends.","tripadvisor_monas_158":"I was a little worried about going to a zoo in Jakarta since many people in Jakarta don't understand how to treat animals. But I was very surprised at how they were treated. Most of the pens were well taken care of and clean for Asia. It cost only Rp. 4,000 to get in and you had access to pretty...More  ","tripadvisor_monas_159":"Good range of animals and very good value (4,500 entrance fee) and whilst a bit run down, it is improving facilities. Go early to avoid the rush, and make time for the amazing and privately run primate centre in the middle, which has some amazing facilities, although you have to pay extra","tripadvisor_monas_160":"Ragunan zoo is a nice place for family short weekend when you cant get a long trip holiday. The condition of this theme park is kinda fine, but i dont think it was very special, but still... i think it is easy for children to get entertained there.","tripadvisor_monas_161":"I was told not to expect much out of Ragunan since I have been to Taman Safari, and so I did, I lowered my expectation to the lowest it could possibly reach, as yet I was shocked of the miserable zoo, if you call it a \"zoo\". I was in such a mess walking back and forth under the sun,...More  ","tripadvisor_monas_162":"Some cages were overpopulated, and when it comes to lunch time, the park was usually overcrowded as well. Better go to Taman Safari instead if you love animals.","tripadvisor_monas_163":"If you plan to go to Ragunan Zoo, please don't go on public holiday. A lot of people go there and the zoo is just too crowded and dirty.","tripadvisor_monas_164":"Don't expect much when you go to Ragunan zoo. After all, you only pay 4.000 rupiahs to enter, so it can't be fantastic. In fact, you may end up walking around, wondering where they put the animals; once you find them, you'll see that some look like they're ready to hang themselves. But still, if you leave in Jakarta and...More  ","tripadvisor_monas_165":"Ragunan zoo, is a well known attraction located in Pasar Minggu, south of the capital city. It housed hundreds species of animal and also provide the greenery and grass to lay...read more ","tripadvisor_monas_166":"I have been to many zoos around the world and south east asia, and this is by far the worst one, not only for the animals, but for people as well.This zoo should have been refurbished years ago, and it is obvious. The animals look on the brink of starvation, and with each kilometre walk to each animal, it...More  ","tripadvisor_monas_167":"Ragunan zoo, is a well known attraction located in Pasar Minggu, south of the capital city. It housed hundreds species of animal and also provide the greenery and grass to lay under the big tree shades that is very scarce in Jakarta.So of course, the tree, the long pedestrian walk, the rental bike and big spaces to roam around...More  ","tripadvisor_monas_168":"If you are monkeys or addicted to something like it.Come and visit Schmutzer in Ragunan zoo...This place is very sweet for educational and recreation. You can see many of primates activities likes baboon, chimpanzee, gorilla, etc... Not just that but this place is very relaxing."}