{"tripadvisor_monas_0":"Thousand Island is easy to reach, one and a half hour sailing from Jakarta by speed boat. We chose for a house stay on Harrapan Island. It is price worthy and comfortable. From...read more ","tripadvisor_monas_1":"Thousand Island is easy to reach, one and a half hour sailing from Jakarta by speed boat. We chose for a house stay on Harrapan Island. It is price worthy and comfortable. From Harrapan Island we went Island hopping with a small local boat. Activities are snorkeling fishing, swimming and BBQ on the beach. Bring your own cooler box for...More  ","tripadvisor_monas_2":"I was out on one of the islands called Pelangi, the island was so beautiful, This island you really must visit","tripadvisor_monas_3":"Just 1.5 hours by speed boat from Marina, north of jakarta. A Total different experience from the mountain of Bogor. Diving, jet ski, snorkelling.. all kind of water sport is available. You can choose from many different island with different prices. Go further north from jakarta to get better and cleaner water. Must leave early around 7 AM maximum to...More  ","tripadvisor_monas_4":"If you are in Jakarta and need a break, this is well worth it.There are many islands to choose from. Boats normally leave from Ancol early morning, its a great short weekend break on real tropical islands. Chose your island carefully and look for reviews on the Island you choose.","tripadvisor_monas_5":"Cool had so much fun during my visit there with a group of friends. Though it was kinda of hot weather there.","tripadvisor_monas_6":"An awesome place for short trips. I came here 3 years ago, has a scenic atmosphere. An enjoyable inn is located on Pari, so do not miss out on that. Never miss out on the recommended fish barbecue. It gives an awesome taste of your trip.","tripadvisor_monas_7":"Although we stayed there overnight but one can go in the morning and come back in the evening . the sea is clear and one can go island hopping","tripadvisor_monas_8":"I had gone with my family which incl 2 kids to pulau ayer on a weekday. It was a very good experience because there were not many people on the island. Its only a resort with cottages extending in water. Water is very clean but no scuba. Amazing sun rise.... costed nearly 1 juta for adylt and half for kids....More  ","tripadvisor_monas_9":"A Thousand islands or Pulau Seribu in bahasa Indonesia, is on north of Jakarta, best location to go is from Ancol Bay (North Jakarta), its called Marina.There are 128 islands around it and from Ancol bay it takes 1-2 hours by speed boatIta good for diving, clear sea water, nice sunshine and good view for sunset.There are...More  ","tripadvisor_monas_10":"In Jakarta and missing the beach? Don't go to Ancol, hop on a boat and sail to the thousand Islands instead!The thousand islands is a group of islands located north of Jakarta.There are islands with 5 stars resorts, and there are also some that are less developed but great for camping sites. You can also visit for a...More  ","tripadvisor_monas_11":"A relaxing day on the islands just north of Jakarta. A fresh breath with a wide choice of destations and activities.Don't have to go to Bali to bananaboating","tripadvisor_monas_12":"We have two one-day trips to islands. Sea near Jakarta is vey very very very dirty and polluted! (( such a beautiful location is now absolutely disgusting.First island was Sepa. It was good, clear water, wild beach available. The way took 90 minutes in a small yacht, so most of the people were sea sick.Second trip to Pari...More  ","tripadvisor_monas_13":"A relaxing day on the islands just north of Jakarta. A fresh breath with a wide choice of destations and activities.Don't have to go to Bali to bananaboating","tripadvisor_monas_14":"Visited in the month of Aug with 4 families, 20 min ride by speedboat to this Island quite nearby to Ancol - Jakarta, very trained and English speaking staff for booking the cottage, USP is floating cottage - quite unique to thousand island.Staff at the island is quite helpful and ready to serve, we have requested for Vegetarian food...More  ","tripadvisor_monas_15":"We have visited the place along with 4 families, booked the package through Pulao Ayer sales person - who was very helpful and suggested us to book Floating Cottages on the sea and also told that this is the USP of the Island.By Speed boat we reached from Ancol to Island in just 20 min and from the island...More  ","tripadvisor_monas_16":"Well.. It's thousand islands and it has lots of island.. I visited Tidung like several years ago for snorkling but if you're not into snorkling and more into history you can visit this 3 islandsOnrust, Cipir and Kelor. I forgot the story of each island.. But 1 has the fort (I think Onrust) the other used to be hospital...More  ","tripadvisor_monas_17":"Avoid the hustle and bustle of Jakarta and cruise out to this beautiful location.Avoid the chaotic city and relax on an island and enjoy a fresh beer","tripadvisor_monas_18":"You can visit this island by using speed boat it will take one hour or normal boat which will take two and half hours.","tripadvisor_monas_19":"We weren't sure about doing this, but absolutely loved the day trip to Putra Island. The boat called at several islands on the way out and back. Had a lovely lunch on the Island, if we knew more before hand we would have spent at least one night there. Beautiful little bungalows to stay in, just a very peaceful and...More  ","tripadvisor_monas_20":"This place is really weekend gateway for people that lives in Jakarta.Very surprisingly we can find a very beautiful and clean sea close to Jakarta.But we need to go more far with boat for see the clean water. For tidung island and bidadari island is already to crowd and not so beautiful.We can take for package to...More  ","tripadvisor_monas_21":"Thousand islands is the best place when i want to enjoy beautiful beach around Jakarta, event for on one day trip. Underwater is good and the view is still natural. I jumped from \"jembatan cinta\" to the sea for adrenaline rush. Visiting turtle center in Kelapa Dua island was also n unforgettable moment.","tripadvisor_monas_22":"Large and big area of Indonesian Island and many kind of characteristics between one island and other island, also good for the tourism","tripadvisor_monas_23":"We have experience staying 2 days and 1 night in Pari Island. We paid 30 USD for the tour package. The cost is including ship, lodge, 3 meals, bike rent, entry pass to white sands beach. It is really amazing","tripadvisor_monas_24":"These are the closest tropical islands to Jakarta, unfortunately the underwater landscape has been ruined by indiscriminate dynamite fishing.","tripadvisor_monas_25":"Mostly small islands but charming. If you are in Jakarta and you dont want to travel far to have an island vacation then The Thousand Islands is the place. There are many small islands and some medium. There are no 5 star hotels but you can find very cute charming villas and houses for rent at about $100 at least...More  ","tripadvisor_monas_26":"Large and big area of Indonesian Island and many kind of characteristics between one island and other island, also good for the tourism","tripadvisor_monas_27":"We visited Pulau Pelangi as a work weekend trip from Jakarta. Read somewhere that if you want clean waters, you are advised to travel at least 90 minutes out of Jakarta. We booked with the resort directly which was an easy process. We met the resort's friendly English speaking guide at Ancol early in the morning who made sure we...More  ","tripadvisor_monas_28":"I visited an Island in the 1000 islands \"Sepa Island\"No much crowd and there are no one to disturb and very clean beaches.Best Scuba dive.","tripadvisor_monas_29":"my friend and i goes to thousand island using sheila tour / valena 081298309995. this place very nice not traffic and snorkling area very nice. recommended.","tripadvisor_monas_30":"When holiday was coming, everybody should be spent time with lovely people either with family, best friend or couple. I was going to thousand island (pulau seribu) on May 2016 with my best friend, we was planned to swimming, snorkeling and enjoying the beach.We was attended to semak daun island, this island quite small and has a white sand...More  ","tripadvisor_monas_31":"If you want to having time at beaches, chilling, sun bathing, or even Snorkeling, you should try this one. You can choose one of the Islands to go and having a great time there. The most important thing is you have to find the best \"guide\" from the local citizen to company you. They can show you the great spot...More  ","tripadvisor_monas_32":"Its a great getaway weekend for people living in jakarta. You can take boats from Marina Ancol, and in a few hours voila, you're in a whole new relaxing place.There are many island to choose from, the main island is the pramuka island. But i recommend searching for information first before settling for an island. The islands here usually...More  ","tripadvisor_monas_33":"Our family had a blast in beautiful Pulau Putri. We were in Jakarta in July visiting family and thought that it would be nice to do a quick trip close by without having to fly...read more ","tripadvisor_monas_34":"I went to Pulau Tidung in April 2016. First of all, I would not go to any of the Thousand Islands. The whole bay around Jakarta is polluted. Want to go snorkeling with trash? Be my guest! I don't know if Pulau Tidung was the worst example of the islands, but it was pretty bad. The one \"street\" running the...More  ","tripadvisor_monas_35":"Our family had a blast in beautiful Pulau Putri. We were in Jakarta in July visiting family and thought that it would be nice to do a quick trip close by without having to fly anywhere else. The overall trip was excellent below are some notes that hopefully will benefit fellow Trip Advisor users...Getting to/from the island...This was...More  ","tripadvisor_monas_36":"Good to get out of Jakarta, swim, snorke, relax in clean air. A boat takes you out on Saturday morning and back on Sunday afternoon.","tripadvisor_monas_37":"These islands offer some rest from the hectic life of Jakarta, you have to make sure that you take the island the furthest away since the pollution from the mega-city reaches pretty far into the sea","tripadvisor_monas_38":"For the best cottages, close-by Ayer Island has themBut for the best snorkeling & diving spots, farther islands such as P. Sepa, P. Putri are the best.","tripadvisor_monas_39":"Pulau Seribu (Thousand Islands) is a place where you can spend your holidays close to home.All that you can find in Bali Island you also can find here. You actually don't need to fly to Bali to enjoy sea resorts or snorkeling or diving.We went there without any expectations.Surprisingly, the sea transportation is easily and cheaply available....More  ","tripadvisor_monas_40":"As I said, it's a popular (by that, I mean close) getaway for parents with small kids in Jakarta. Not particularly touristy. Go to Bali or Lombok or the Gili Islands....or other for tropical places.","tripadvisor_monas_41":"It is a good weekend gateway when you don't know what to do. I spent only one day at Sepa Island and it was pleasant, although the staff wasn't very kind. It is indeed a very nice place but it was very dirty, it looks like no one really take care which is a real bummer.Anyway, in general, i...More  ","tripadvisor_monas_42":"I went to Semak Daun island. It's an island to go with a backpacker style. There was no accommodation and only sea water available, so if you have to build your own tent and bring your own water or buy it in the stall. The island is pretty small, it doesn't take a long time to circle the island. There...More  ","tripadvisor_monas_43":"The thousand Islands are just an hour and a half North of Jakarta by fast boat.Make sure you go at least and hour and a half north as the closer islands have garbage from Jakarta and water quality is dreadful.Island accom varies from very good to miserable so make sure you check it out thoroughly before you go....More  ","tripadvisor_monas_44":"Who likes water, snorkeling or diving it is wonderful when would not so much plastic in the sea and on the costa of the islands. here the global community will have a lot to do. I...read more ","tripadvisor_monas_45":"Booked an IDR 95.000 one day tour to 3 islands (Kelor, Cipir, Onrust). One of the best decisions I've ever made in my life. Each island has different feeling about it. Especially Kelor Island is really beautiful. The sand is really white and the fort/tower feels historical and amazing. Onrust feels like a tropical rainforest inside an island. Drank the...More  ","tripadvisor_monas_46":"It's not just one island but a lot of islands some with facilities and some without. The best thing is that it is within Jakarta or greater Jakarta. So this is like the first stop if one wants to get away from the city. Sad to say most of the facilities are a bit run down but if you go...More  ","tripadvisor_monas_47":"From Ancol harbour we can find several island to go. Pulau Pantara is quite far to go to enjoy it's beautiful and natural island that surrounded by many fishes that can easily snorling with them. Also good japanese food served there. Pulau Anyer is best choice to bring your family with kids to play and stay at it unique cottage....More  ","tripadvisor_monas_48":"Who likes water, snorkeling or diving it is wonderful when would not so much plastic in the sea and on the costa of the islands. here the global community will have a lot to do. I booked a regular weekend trip  one day on recommendation of my Indonesian colleagues to take the time to go to a Island which...More  ","tripadvisor_monas_49":"if you live in jakarta and you don't know what to do on the weekend just go to thousand island, there's a lot of island you can visit there, for example hoping island, umbrella island that island was amazing island, you can do snorkeling, barbeque, enjoy sunset and sunrise or short visit to other island, usually local people rent their...More  ","tripadvisor_monas_50":"Firstly, dont book one of the over expensive tours / packages for sale at Marina Ancor, simply book a ticket to an island and find a place to stay when youre there. Pramuka is the central hub for all the islands and is well developed with schools and hospitals etc, this is where I stayed over night. You can easily...More  ","tripadvisor_monas_51":"From many islands of Thousand Islands we chose the Perak Island as our destination. The island is still underpopulated so you will find a peaceful and quiet place to relax and enjoy the ambiance.We camp for a night at the island. The distance from Harapan Island (the capital island of thousand islands) is about 1,5 hours using local boat...More  ","tripadvisor_monas_52":"If you live in Jakarta, it's great to get away sometimes for the weekend, get some fresh air and get away from the crowds. If you are a tourist in Indonesia I would advise to go to other places, there are much better places than Thousand Islands. The islands are heavily affected by local tourism and at some islands you...More  ","tripadvisor_monas_53":"I chose speed boat to get there. Nothing special instead ! there are huge amount of leaves, seaweed, plastic rubbish. It looked like the island half deserted. Food was expensive for foreigner, it was not fair different treatment between local and tourists. No possibility to come back,,,,,","tripadvisor_monas_54":"This place looks like paradise in photos but after arriving and walking around the main and busiest island for an hour we got the boat straight back to Jakarta. The place is filthy, locals are unhelpful and budget accommodation is 400k for beds on the floor. You're surrounded by flys constantly, we planned on visiting the smaller and supposedly nicer...More  ","tripadvisor_monas_55":"located approximately 60 minutes by Ferry ---- should spare more than half a day to enjoy the beauty of this clusters of islands---- A very good Family recreation and rare in its...read more ","tripadvisor_monas_56":"located approximately 60 minutes by Ferry ---- should spare more than half a day to enjoy the beauty of this clusters of islands---- A very good Family recreation and rare in its nature---","tripadvisor_monas_57":"Thousand Island or Pulau Seribu is an Archipelago in the big Indonesia archipelago near Jakarta. You want to try? you can but remember that if you have kids you have to buy the safety jacket for travelling on the boat. Personnally I don't feel sure in that boats so littles and often so crowded. You can find more than one...More  ","tripadvisor_monas_58":"I took my first scuba exam here and it was ok. I mean, the island basically is clean and well-maintained, but not so great for the underwater world (marine life).","tripadvisor_monas_59":"Amazing, beautiful, relaxing, what can I say anymore? A place for anyone who loves nature. Solo, family, friends, all are welcome.","tripadvisor_monas_60":"God created the universe with beauty so grandly, for that we have to maintain, nurture and preserve it, so can be enjoyed by all mankind. Of the many works of the Great, the natural beauty of the sea is not less interesting to the other, one of which is the natural beauty of the ocean in the Thousand Islands. No...More  ","tripadvisor_monas_61":"I've benn here for the second time. Both visits are for diving purpose. The accomodation was in Penginapan Delima. It was great, 50m from the main harbour. It served very delicious dishes. My favourite was Bandung Cabut Duri! The diving spot was just ok. It's not very beautiful but acceptable. Great place near the metropolitan Jakarta. Overall, if you want...More  ","tripadvisor_monas_62":"I would like to say that ​you (Giri), dive master Yanto, and your dive center were very accommodating and provided a lovelyexperience for us at Pulau Seribu. Justin and I had memorable dives at the Soft Coral spot and at Penyu Point where we were lucky to meet sea turtles, lion fish, clown fish, and beautiful coral. Your equipment was...More  ","tripadvisor_monas_63":"I went here Scuba diving, arrive Saturday morning directly from the ferry at Ancol Marina. 1 night stay over, return to Jakarta Sunday afternoon. The ferry ride is about 2 hours. Accomodation is quite basic, but this is nt the sort of place that you want to spend a lot of time in your room at! \"Adequate\". All meals are...More  ","tripadvisor_monas_64":"I don't remember the name of the island but nearby is another island occupied by inhabitants that can be reached by low tide. There is a low round bungalow in the center of the island and about 4 rooms settled on drums with a glass floor so that we can see the sea below. It was a nice and exciting...More  ","tripadvisor_monas_65":"Interesting, soitude and adventure trip.Must visit place if you are in Jakarta or if you want to fishing this will be the best place for experience fisherman.","tripadvisor_monas_66":"Thousands Islands or in Indonesian called Pulau Seribu, are a group of island in the north of Jakarta. It can be reached in 1.5 hour by boat from Marina Ancol. There are villas...read more ","tripadvisor_monas_67":"Thousands Islands or in Indonesian called Pulau Seribu, are a group of island in the north of Jakarta. It can be reached in 1.5 hour by boat from Marina Ancol. There are villas and hotels to stay overnight and family can enjoy snorkeling, diving, fishing and many others.","tripadvisor_monas_68":"I came to holiday with my friends, we enjoyed the beach and planning for diving and swimming. But actually we were not really enjoyed because the trash swim in the sea. My suggestion is maybe you should do cleaning once a day or spread campaign for cleaning the sea","tripadvisor_monas_69":"I am a solo female business traveller, was in Jakarta for a week and wanted to escape the city for a day. I found a non licended guide via the internet, we exchanged emails and she proposed me different islands to visit. The Putri Island and Sepa Islands are great for snorkeling, but they are far away (2.5 hours by...More  ","tripadvisor_monas_70":"Visiting Pulau Kotok and staying over the weekend with friends gave me an idea of building a tree House such as the one in this Island. We enjoyed our time there but we brought some snacks to make sure we have enough.","tripadvisor_monas_71":"Pulau Pramuka, Tidung, Pari, Macan, etc... i visited a few island in there, and im not bored to go back.","tripadvisor_monas_72":"Thousands island is the nearest dive site to Jakarta. They have various level of sites range from beginner site at Pramuka Island to More Experienced Diver Site at Papatheo Wreck near Sepa Island. Hyperbaric chamber facility is available ay Pramuka Island. 1000 island also suitable for family with non diver family member.","tripadvisor_monas_73":"We were so excited to board the boat from Marina, but alas, what a disappointment! Place lacked in maintenance and bordered on disrepair.Wish something could be done soon!","tripadvisor_monas_74":"tour with my friends were wonderful I hope that the prices are non- exaggerated and cleanliness of places to sit by boat need more care","tripadvisor_monas_75":"This is truly another side of Jakarta that might never come accross your mind! Reachable by boat in 20 minutes to 3 hours, depend on which island you want to visit, Thousand Island offer you the natural face of the megapitan. It has beaches, snorkeling sites, an interesting piece of dutch colonial history, bird watching spots, old lighthouse that you...More  ","tripadvisor_monas_76":"My plans fell through in Bali so I flew back to Jakarta to join some friends heading to thousand islands. It was incredibly cheap for us all to have boat transport, accommodations, and food for 4 days. Everyday our boating crew picked us up to explore new islands and go snorkeling. At one point our boat got stuck in coral...More  ","tripadvisor_monas_77":"i come there have recommendation for my family. the weather is hot but so nice. before someone told us that not nice and i confuse to go there. finally like a dream","tripadvisor_monas_78":"You can take the ferry early in the morning or travel in style on your own chartered speedboat. Nothing much to do unless you're staying here on the pretty cottages onThe pool here was overflowing with chlorine and the buffet included in the entry charge was kind of sad. Cannot comment on the water-sports as the weather was too...More  ","tripadvisor_monas_79":"i come there have recommendation for my family. the weather is hot but so nice. before someone told us that not nice and i confuse to go there. finally like a dream","tripadvisor_monas_80":"Pari Island is one of the Islands in Thousand Island, its so quiet and peaceful. The people around that area are so kind. The water of the beach was so clean with lot of star fish. I love the environment so much. The only negative thing was the transportation. The boat was not comfortable and the engine was too loud.","tripadvisor_monas_81":"Close to the city (well, if you can get to the right jetty, watch-out) the island are actually very nice, at least the ones a further away (1h boat ride or more)Went to Pari island. Accommodation is fairly basic (home stay) but hopefully improving soon. Just 1 night possible in that context, but the 2 days trip was great....More  ","tripadvisor_monas_82":"Nice beaches, depends on which island you visit. Only 30- 120 minutes from Jakarta, makes this destination a must go if you're in Jakarta. Don't expect bali or hawaii type of beaches, but it's worth going. Choose which island you want to visit ahead of time","tripadvisor_monas_83":"if you like to find clear water and white sand, go a liitle further to the north, its called \"Sepa Island\" , its about 1,5-2 hours boat ride from Ancol. Be prepare, when the tide is high, many of people get seasick.","tripadvisor_monas_84":"If you like history, you can visit these three islands. You don't need to stay there, you can do a day trip. If you want to spend the night there, you can stay on Cipir or Onrust Island. There are a few rooms that you can rent or you can camp there as well.I find Kelor island a beautiful...More  ","tripadvisor_monas_85":"Thousand island or in indonesian called pulau seribu is a lovely island. There are many small islands here. With white sand, and nice corals. You could do snorkeling here. Some islands of pulau seribu are resort where you have to pay more money to come and visit those islands. But some other islands are resident islands, where the people are...More  ","tripadvisor_monas_86":"Thousand Island (pulau seribu) it's a good place to go if you don't really feel traveling by plane to see blue sea. Some Island are good. Worth to try for those who never been.","tripadvisor_monas_87":"When I worked in Jakarta, I came here for International Coastal Clean Up Day, where I volunteered to collect underwater trash while snorkeling/diving.For those who come to Indonesia for a holiday, don't come here as a main destination! There is still a LOT of more beautiful beaches in Indonesia. Thousand Islands is beautiful, no doubt. But its proximity to...More  ","tripadvisor_monas_88":"For the workers in Jakarta if want to find peaceful place with stunning view and sunset, thousand island is one of better choices. Because near from Jakarta and many activities to...read more ","tripadvisor_monas_89":"For the workers in Jakarta if want to find peaceful place with stunning view and sunset, thousand island is one of better choices. Because near from Jakarta and many activities to do.","tripadvisor_monas_90":"Nice beach, sea, and place.You can snorkling and diving, it is beautiful enough.It is not to expensive, fun and great.The weather is realy hot and shiny.There is no many option for foods.But It is depends on which island You visit","tripadvisor_monas_91":"Me and my friends do not regret having visited this great island.For those of you who love the water and scenery, immediately go to this place.","tripadvisor_monas_92":"If you live or work in Jakarta then you're probably stuck with this as one of limited options, but if you're a tourist then please go to Bali or re-book somewhere cheaper like the Philippines. I took a tour with Skycity tours to Sepa Island (one of the 130 \"Thousand Islands\") and it counts as one of the worst tour...More  ","tripadvisor_monas_93":"I did realy enjoy our weekend gateaway with my wife, we went to Sepa Island, it take about 1 hour 30 minutes from Marina Ancol.Once you have arrived at the Sepa Island (One of the 1000 Island), it has very clear beach and with nice bungalow on that island.You can experience snorkeling, boat, jet ski, and enjoy play...More  ","tripadvisor_monas_94":"lousy diving, poor viz, little to see. accomodations can be shockingly spartan, virturally no night life at all where I was, unless you bring your own bottle but one can do that at home around their pool eh. close to Jakarta but definately not a destination worth traveling soley for which one would travel to Indonesia.","tripadvisor_monas_95":"pulau seribu...tapi kita cuma ke 3 pulau ajaa...kelor, onrust dan cipir..just one day trip..but i was enjoy ..","tripadvisor_monas_96":"i went there in last week ..so very exotic small islands there.beautiful beach there..and close location from jakarta.","tripadvisor_monas_97":"Surely not one thousand but definitely many, many islands. They are diverse in size, seawater quality, accommodation and food. The best ones are expensive. Water quality is better with the distance from polluted Jakarta. Water currents can also affect sometime the water. However they are all beautiful. Go there for beach, sun, snorkeling or diving. Speedboats are available from Marina...More  ","tripadvisor_monas_98":"island with beautiful scenery to unwind, the white sand and blue water of a charming small fishes .The fish,, but cleanliness is still less nice..I'll not know how hygiene officer .maybe result of other visitors.","tripadvisor_monas_99":"I always like to go there with my hubby or our friends. Even the location rather far from our home but when we come there, it will make u happy and enjoy ur holiday time.We can...read more ","tripadvisor_monas_100":"I always like to go there with my hubby or our friends. Even the location rather far from our home but when we come there, it will make u happy and enjoy ur holiday time.We can reach there from Tanjung Pasir, not far from Bandara Soekarno Hatta.We use boat with cheap price per person and ticket also.There...More  ","tripadvisor_monas_101":"When I visiting this island..Lot of fish and beautifull bird that fly.And traditional ship from fisherman.Resort and white sand is making more beautifull atmosphere.Fresh Blue sky and small resort near with beach.","tripadvisor_monas_102":"The easiest way to enjoy beach life from Jakarta. Only 1-2 hours away from Ancol, There are lots of islands to enjoy from Pulau Sepa, Pulau Tidung, Pulau Pramuka and others.. The further you go from Ancol, the better as the beach is cleaner.","tripadvisor_monas_103":"I went to pulau Anyer on August in an office outing.The island is well maintained.You can't play in the sea though , there's garbage floating from Jakarta if the current swept it to the islandThere's a lot of bugs attracted to lights and it smells nasty if you Touch it. the staff island Provide insect repellent but...More  ","tripadvisor_monas_104":"We had been to SEPA island which is about 2 hr speed boat ride from Ancol marina in mainland jakarta.White sandy beach with lot of water sports.","tripadvisor_monas_105":"There are various ways to go to Pulau Seribu. The cheapest way is from Priuk, chartered a passenger boat. But unfortunately, this way you'll find yourself as a sardines in the boat. Better find small agency that gives a 2/3 says tour to avoid hassle, and they actually give you competitive prices, depending how many people in your group. I...More  ","tripadvisor_monas_106":"Went to several islands in the area of Pulau Seribu (Pulau Putri, Pulau Macan, Pulau Sepa, and Pulau Tidung). My favorite are Putri, macan, and Sepa. I wont go back to Pulau Tidung, there are too many people living in the island and not hygienic. Met some crazy (as in literal mentally ill) people there and it was not a...More  ","tripadvisor_monas_107":"I've been to Pantara island and Putri island. Pantara bungarow's facility is quite old but clean. There was a lot of mosquitoes and we got bitten, so don't forget to bring anti mosquietoes.","tripadvisor_monas_108":"its the cheapest and near Jakarta to find a great beach and it not cost that much to go there. nice view, clear water and great outdoor activity with some friends.","tripadvisor_monas_109":"I live since 3 years in indonesia and travelled to lots of islands. I was told thousand islands was nice. My god...how can i describe this ?? It's just the most polluted place i've ever visited in my life. Leaving from the harbour you can already see the water has a strange color. With petrol reflection in the water, plastic...More  ","tripadvisor_monas_110":"When u are missing going vacation to the beach but you dont have much time its such a beautifull island near Jakarta. I'm visiting Pulau Tidung...they had Pulau Payung Besar such...read more ","tripadvisor_monas_111":"When u are missing going vacation to the beach but you dont have much time its such a beautifull island near Jakarta. I'm visiting Pulau Tidung...they had Pulau Payung Besar such as heaven....the water is so blue and clean...we go snorkel that the equipment already provide by the host....Hostel no much choice but is okay with the facilities","tripadvisor_monas_112":"it has alot beautiful island. your family vacation its great, you can go to pramuka, Pari, Laki for stay or go to Andrus islan to see bird","tripadvisor_monas_113":"We only managed to do three of the thousand islands. We took a boat from a local jetty called Muara Kamal which is definitely not for the fainthearted, situated next to a fish market, it stank and had lots of flies. The boat looked pretty rickety, but I'm typing this review, so it was safe!One of the most interesting...More  ","tripadvisor_monas_114":"Its been a long since I visit Thousand Island... This year on a very short time for planing our holiday, we choose Pulau Pelangi (Rainbow Island). Its fits with our budget and Its one of the island that has a small good beach for you and family to hang out...its not the top one...but you still can enjoy the sun...More  ","tripadvisor_monas_115":"pulau seribu are islands near north jakarta, you should take the ship from muara angke or speed boat from Marina Ancol to the islands. The islands that you can visit such as tidung, ayer, bidadari, pramuka, sepa, pari, harapan, or unpopulated island like semak daun. The costs are variations like tidung/pramuka/harapan/pari about Rp 300,000 - 400,000ish by ship from muara...More  ","tripadvisor_monas_116":"Thousand Islands located at the Northern Part of Jakarta. We have so many island arround 17.500 Island that's why we called this area Thousand Islands area. If we want to go to some island usually we start from the Ancol Marina Area which usually the Ship start. Nice Island to visit such as Bidadari, Ayer, Kotok, Putri, Sepa, Pelangi, Pantara....More  ","tripadvisor_monas_117":"Incredible to experience such amazing clear waters off the coast of Jakarta. I have been to a couple islands here and must say it's a perfect getaway for a weekend as long as the weather is good.","tripadvisor_monas_118":"this is indeed heaven on earth... Just few minutes from Jakarta.. have some excellent romantic resorts.... Nice place for couples...","tripadvisor_monas_119":"Lots of choice is offered on different Islands. Easy to book, together with range of prices. Crossing back to mainland is very choppy.","tripadvisor_monas_120":"If you want a relaxing day and don't mind riding boats to get to the island this is a nice retreat from Jakarta. You can see Komoda Dragons on this island but be careful. Their bite is deadly and they won't mind taking a bite out of you so watch your distance. But there is scuba diving which is ok...More  ","tripadvisor_monas_121":"ok.. to getaway from jakarta within distance i suggest to have a day or two trip to seribu islands, lots of operators will promote and have package but make sure you ask around...read more ","tripadvisor_monas_122":"Travelled to Bidadari island for a day tour. Trip includes a boat ride to and from Ancol marina, lunch, welcome drink, banana boat, cycle rental and boat trip to three near by islands.8 hours is a long time to spend on an island which takes only about an hour to explore completely. Good for romantic getaways, would advise staying...More  ","tripadvisor_monas_123":"I'm happy to visit this island but i think the people's there must concern about clean the beach! The island look welcoming but since arrive many plastic trash. So sad to write this.","tripadvisor_monas_124":"We stayed at Tiger Island for 1 night. The snorkeling was not the best we have seen in Indonesia but the accom was clean and fresh, food was delish!","tripadvisor_monas_125":"ok.. to getaway from jakarta within distance i suggest to have a day or two trip to seribu islands, lots of operators will promote and have package but make sure you ask around first, get info from other travelers and also make sure you visited and enjoy your time in the north part of the seribu islands, the southern parts...More  ","tripadvisor_monas_126":"Your trip starts from a smelly and dirty waters of the port of Jakarta. You have to go a couple of hours on a boat to see the difference between clean and dirty water. There are plenty of islands with two inhabitants (security guy and fisherman). If you look for real adventure go to the one with no electricity. The...More  ","tripadvisor_monas_127":"For those visiting Jakarta and wanting to have small island feel and adventure, Thousand Islands is just a couple hours away from North Jakarta. You can do many water activities and, most importantly, do some relaxations. Some private islands are for rent and basic accommodation are available in some larger islands. A range of transportaion from jet foil to just...More  ","tripadvisor_monas_128":"I went to Pramuka Insland for diving and I stay in .I can recognize two star level for the infracsture. Anyway good food and good stay. The sea around is deeply and nice for diving and enjoy the day.Insland is not so dar from Ancol peer and the boat service is good enought.","tripadvisor_monas_129":"This is where city dwellers go to escape and they, unfortunately, leave all their rubbish behind. Water filthy, land side worse. Very crowded at weekends. Certainly not for diving.","tripadvisor_monas_130":"The government should've done more efforts to develop this hidden gem outside Jakarta's shore.The location which is close to Jakarta makes these islands easy to access, especially for Jakarta residents. Unfortunately many of these islands are not well-maintained, even some of them are privately owned, so it's restricted for the public, of course.Hopefully, someday, someone will do something...More  ","tripadvisor_monas_131":"If you are in jakarta and looking forward to have a weekend by the beach with a cheep prices , so best destination is thousands island ,Heading to the harbor to take a boat , it takes about 2 hours to reach the islandsBetter to get a package with a travel agency it will be everything includedSo...More  ","tripadvisor_monas_132":"Thousand islands is a string of 105 tiny islands in the Java sea, north of Jakarta. Depending on which island you are visiting it will take you 30 min to 2 hours in a speed boat...read more ","tripadvisor_monas_133":"Crystal clear water is good to having water sports likes diving snorkeling and etc. Also like private island where is not too crowded be good and great place to relax and having romantic session with the loves one.","tripadvisor_monas_134":"see the nature in thousand island, eat fresh sea food, drink kelapa muda, young coconut liquid. wow that is paradise in earth. snorkel and canoeing.","tripadvisor_monas_135":"We bought a one day trip to Sepa island with Shaila tours located inside discovery hotel. Be aware that they do not care about their clients safety. Our boat trip coming back from the island was extremely dangerous. The boat was too small for the rough waves. A few times the boat was close to be turned over by the...More  ","tripadvisor_monas_136":"I went to pulau pelangi to take my diving license lastyear, while the beaches and the sea is the best you can get if you are living in jakarta, you just no need to explore deeper to the bottom of the sea because its full of garbage. Well, the thing is you still can see a seaturtle here swimming free....More  ","tripadvisor_monas_137":"Thousand islands is a string of 105 tiny islands in the Java sea, north of Jakarta. Depending on which island you are visiting it will take you 30 min to 2 hours in a speed boat. The island I visited is called Sepa. It has a resort near the seashore, remaining part is thickly wooded.","tripadvisor_monas_138":"Loved it - not too crowded and friendly people, a great place to relax but like everything in Indonesia it can change on a daily basis","tripadvisor_monas_139":"It has thousands of small to big islands. Blue clear water and life of reefs good for snorkeling, diving or even just for a stay with a family, friends and business meeting.","tripadvisor_monas_140":"A beautiful area, as soon as you get further from Marina Ancol. When close to Jakarta, there is too much junk in the water. On the further islands, some gradation beaches can be found. Only 2 or 3 of the islands have resorts on them.","tripadvisor_monas_141":"Went to Harapan Island with my bf in mid June 2015, we booked a private 2D 1N trip for 2 from a local tour guide, turned out it wasn't so private. On their ad, they said we will get a private island hopping trip to 5 different spots, a trip to the turtle breeding site, photo underwater facility, a private...More  ","tripadvisor_monas_142":"This place offer a quick getaway from the busy and crowded Jakarta. Only take approximately one hour from Ancol using fast boat.Blue ocean, clean air, this place also offer diving and snorkeling experience, which I think is quite fine, although not quite on same level as the ever famous Bali, Raja Ampat or other remote area.It is really...More  ","tripadvisor_monas_143":"I have been to thoisand island, Tidung Island for exactly and i fell in love with it. Nice although it was so damn hot. If you wanna go there cheaper,go from Muara Angke. But you...read more ","tripadvisor_monas_144":"Can Believe Jakarta Have Beautiful Island..!Yeah, that things I say it louder when first time visiting Thousand Island in very north of Jakarta city. Over here you can see blue water of sea and amazing sea creature around it.Snorkeling is a must if you visiting here.","tripadvisor_monas_145":"but the transportation to go there quite expensive. so better everyone go to Bali or other city in Indonesia","tripadvisor_monas_146":"I have been to thoisand island, Tidung Island for exactly and i fell in love with it. Nice although it was so damn hot. If you wanna go there cheaper,go from Muara Angke. But you must be there at least at 8am. It takes 2hours from Jakarta to Tidung. But it pays off.","tripadvisor_monas_147":"All of the thousand islands have a bad correlation between price and value. That is in general you have to pay a lot, but the standard of accommodation is average at best and the food quality often is poor. On the plus side it's close from Jakarta and after 90 minutes from the Marina in Ancol/Jakarta you will arrive at...More  ","tripadvisor_monas_148":"stay for 1 night with a group of friends went for snorkling at islands (Kayu Angin, genteng kecil,putri) near harapan island, water is clear, some rubbish throw away from local tourist (cigarette butt, plastic bottle mineral water and cigarette pack).","tripadvisor_monas_149":"Lovely coral islands near a capital city... run down, dirty but still worth a look, just do not expect 5 star hotels or quality beaches unless you get right out.","tripadvisor_monas_150":"My Sole purpose to visit \"Pulau Pelangi\" is to dive. It is pre arranged in Jakarta. The island itself is one of the furthest, so it takes about 2 hours to visit. If the weather is not good the speedboat to visit the island is extremely bumpy like a roller coaster ride. Otherwise it is a smooth ride.The only...More  ","tripadvisor_monas_151":"I have visited most of the Thousands Islands. The top ones: Tiger Island, PantaraStay no more than 2 days not much to do if you are looking for activities, just relax, massage by the beach, snorkelling , kayakLove the water colors, clear skies, FRESH & CLEAN AIR. The scenario is quite perfect.Traveling time 1;45 by speedboat.","tripadvisor_monas_152":"Well there is a wealth of choice of little islands usually with just one hotel/bungalow setup on each. Take Some time to choose a nice setup. Diving is ok as well as dolphins etc","tripadvisor_monas_153":"Wonderful to get away, lovely snorkeling, very relaxing once you get there! We have explored two of the islands in weekend all-in packages to escape from the Jakarta bustle. We will be exploring others.","tripadvisor_monas_154":"I've been there last year for short escape. With low budget, we can get a lot of activities like snorkelling, bicycling, and fresh seafood for dinner, If you don't have a long...read more ","tripadvisor_monas_155":"We bought a 2 days 1 night trip to Tidung, booked through travel agency found on Internet.Speedboat to Tidung is 1 hr from Ancol, good distance from Jakarta since sea can get rough. Price is 1/2 if you compare to resorts on other islands.We had a guide all the time, very nice homestay, bycycles, snorkling, boat trip, 3...More  ","tripadvisor_monas_156":"I've been there last year for short escape. With low budget, we can get a lot of activities like snorkelling, bicycling, and fresh seafood for dinner, If you don't have a long time for holiday, you can choose Pari Island for short escape.","tripadvisor_monas_157":"Initially, the plan was to go on a fishing trip nearby the islands in Thousand Islands but because of the weather everybody got bad seasick so we gotta stop in one of the islands there. The island called Peniki Island, there was little houses in the island and a big hall which we later use as dining room. i have...More  ","tripadvisor_monas_158":"Stunning view surround the islands, the blue lagoon are everywhere you could do snorkeling and see cute fishes towards you. You can swim all day long and rilex at nite by the moon and star also all the nature voice acomppany you. You couldnt imagine that not far from you is the hustle bustle city that always busy. Thank God...More  ","tripadvisor_monas_159":"I visited Pulau Tidung, Pulau Pramukan and Pulau Semak Daun and I wish I never left those islands! All of the above are stunning and photogenic. Tidung and Pramukan are the more lively ones, though. With cute, colorful little villages and superfriendly locals! Plenty of fresh coconuts to drink. The water is mostly very shallow and very clear, which gives...More  ","tripadvisor_monas_160":"Awesome experience. Wen to 1 day trip to 1000 island's tidung from Jakarta.The place is nice in monsoon if not raining. Tidung is a small island village inhibited with locals and lot of cats. I mean a lot. We went for snorkeling majorly and it was amazing to see so many rich diversity in ocean.Water sports are bit...More  ","tripadvisor_monas_161":"The best place for ocean lovers. Best to visit during September. One can enjoy a lot if planned for a night camp with your best gang.","tripadvisor_monas_162":"This time we went to Pulau Macan. This place is AMAZING! It a small island, only 88 minutes away from the city, with not many huts but everything is great. The furniture was from drifted woods etc, very natural and nice and cozy. The staffs are great and friendly. They spoke fluent english. Food is great too. The price of...More  ","tripadvisor_monas_163":"I think you can easily spend every holiday exploring this amazing corner of the world ....and it will still reserve you a surprise.","tripadvisor_monas_164":"Suitable place for relax near Jakarta.My advice, choose Pantara island or Macan Island. Both of this island is the fartest island from Jakarta.All in tour package around USD 200 for 2days 1night, include cruise to the island, all meals, accomodation, 2 water sport and sunset view.Here is really nice place for relax, superB view, clean water and...More  ","tripadvisor_monas_165":"Went and stay in Pulau Harapan (Island of Hope) with my collagues, the island itself was not interesting at all. It was overcrowded with citizen's house and lodge.The main...read more ","tripadvisor_monas_166":"Went and stay in Pulau Harapan (Island of Hope) with my collagues, the island itself was not interesting at all. It was overcrowded with citizen's house and lodge.The main reason to get there was for it's surrounding islands. It has great snorkeling spots, starting with the shallow sandy shore, to the 10 meters deep. The coral was beautiful. The...More  ","tripadvisor_monas_167":"i went to thousand island with my friends, the island i was visit there was : Tidung island, and Harapan Island this is the island of backpacker budget, we could find many offers or packages to visit this island, they offer weekend gateway, its start from friday to sunday, they have 2 packages offers , for staying example : 2...More  ","tripadvisor_monas_168":"Easy to go there from Jakarta. Transport and accommodation cost is reasonable. Sea water not so clear, unfortunately.","tripadvisor_monas_169":"Must go. great destination within easy reach of jkt. just make sure u don't get trapped in afternoon traffic getting there.","tripadvisor_monas_170":"This island is option for you to escape from the city on the weekend, can be reach with a short time from the city. With so many island you can pick where you'll stay or just full day hoping island. The big is pramuka island as it a central government of pulau seribu. Even the sea is blue but probably...More  ","tripadvisor_monas_171":"In case you want to get rid of Jakarta traffic buzz this should be your first choice. You will be greeted by lovely weather, beautiful beaches and exotic seafood. My suggestion is to opt for an island which is far from Jakarta port as it will be having less tourists and more clean. You can travel by sharing Speed boat...More  ","tripadvisor_monas_172":"I really like 1000 Island because its near by Jakarta 4-5 hours by boat. afterwards, if you are in group then it hardly cost you Rp. 300,000 per person. As weekends you can goi and come back Jakarta fast. Really nice place for escaping from town view to Ocean view & White Sanda ...really Love it.","tripadvisor_monas_173":"Just 1.5 hours boat trip from Jakarta and you are in clean water and fresh air. Nothing to do but relax and enjoy the water. My favourite island is Pulau Macan but there are others that offer seclusion and fun. If you live in Jakarta it is a must. If you are visiting - try to fit it in. On...More  ","tripadvisor_monas_174":"By no means the nicest islands in Indonesia, but still a great escape from the city. The further you can get from the mainland, the nicer and cleaner they get.","tripadvisor_monas_175":"For domestic budget tourist, I suggest to go to Pari Island if you want to enjoy low tide, calm and cleaner beach. But only 1 beach; virgin beach (Pantai Perawan), other than that was filled with drifted garbage. Accommodation cost you around 600k IDR for one house (2 bedrooms, air conditioned), and every meal need to be booked on advance...More  ","tripadvisor_monas_176":"We stayed for 2 night at Pelangi island Resort.Took us about 90 minutes off the coast from Jakarta with the boat to get there.Water was clean and it is simple even only for...read more ","tripadvisor_monas_177":"really was very nice i i enjoyed inside it where i can see more historical places and wonderful trees and the location near by sea where you will see water and smell the air was wonderful","tripadvisor_monas_178":"get bore with Jakarta or west java or Banten destination on weekend, Thousand island consist of many small island with habitat or inhabitant, offering from small house to rent until luxury villa and resort to stay with numbers of water sport activities to try, many ways to get there, ancol dreamland, Muara karang, Kamal or other small harbour port in...More  ","tripadvisor_monas_179":"It's the best place to getaway from Jakarta's traffic jam. Well, everyone thinks the same! The result? Thousand Islands is now full of visitors, full of trash! Hopefully the tourists can be more responsible for its cleanliness.","tripadvisor_monas_180":"We lived in Jakarta for 4 years and in all that time we tried various times to book a few days away only to find we needed to have at least 14 people in our party. They would not take our booking for 2. Seems it's ok at weekends because many people go so it's worth their while ( we...More  ","tripadvisor_monas_181":"We stayed for 2 night at Pelangi island Resort.Took us about 90 minutes off the coast from Jakarta with the boat to get there.Water was clean and it is simple even only for snorkeling people to explore the serene and pure under water life.Also my daughter was amused to see millions of stars under the clear sky at night time.Next...More  ","tripadvisor_monas_182":"Hello fellow travellers,Good to share my thoughts again, was in Ayer Island during December 28 to 29 2014, really great time. Stayed in fak fak, floating cottages. Good location and view. Took speed boat from anchol, 20 to 30 minutes travelling time to reach.We took a day package for 1.3 million Indonesia rupiah. That is roughly about 220...More  ","tripadvisor_monas_183":"This is a simple getaway, for you who already bored with Jakarta's rush and crowd, go to thousand island can be really helpful, especially if you nature and beach. There are some recommended islands to visit i.e. Bidadari island (the closest 30 minutes from Marina Beach Ancol), Tidung island, Bira Island which still well conserved, Pelangi Island, Sepa Island.There...More  ","tripadvisor_monas_184":"Actually here are several islands to visit. I have visited 2 of them, Pari island and Harapan Island. Best by reserving a tour from Jakarta, so you just have to pay the fee and the travel agent will arrange everything from accommodation to meals and other fee (e.g boat, entrance fee etc.). Try april-october for better weather, otherwise you may...More  ","tripadvisor_monas_185":"I went there twice. My first trip was great. I stayed in Putri Island which the service is good and the condition is also good. We got a proper room and can enjoy the view. I departed from the Ancol Harbor which is nice and using speed boat. My 2nd trip was terrible. departed from Harbor close to Muara Karang...More  ","tripadvisor_monas_186":"We've been to Sepa island. Bounty beaches are there, but the included meals and accommodation are definitely not worth the price (we paid 1.500.000 Rp. per person).If you know locals - definitely go there. Prices for locals are as low as 350.000 per person, which makes it a nice weekend getaway","tripadvisor_monas_187":"Pulau Bintang is a small island in the thousand islands jakarta, 90 minutes by speedboat from Jakarta. very isolated, quite and alone. nice and unspoiled beaches. We recommend...read more ","tripadvisor_monas_188":"Pulau Bintang is a small island in the thousand islands jakarta, 90 minutes by speedboat from Jakarta. very isolated, quite and alone. nice and unspoiled beaches. We recommend that you bring your own food if staying here because here there are only 4 bungalows and the guard of the island alone. The bungalow available stove and gas for cooking","tripadvisor_monas_189":"Pulau Seribu offers hardened city residents a welcome escape from all the hustle and bustle. Easily reached by boat from Ancol, it makes a great destination for a weekend getaway. Hotels abound, good food is aplenty and you can get all sorts of water sports - including scuba diving. A fun option. Highly recommended.","tripadvisor_monas_190":"Food are cheap there but the availability of proper lodges is limited. We booked a whole homestay when we travelled there. Was nice, clean and air-conditioned, located right on the beach front. But I forgot the name of the place. The underwater biodiversity isn't that abundant, though. Only dead coral.","tripadvisor_monas_191":"Prepare early in the morning. Come to the historical Kelor Island and surrounding islands. Enjoy the view and historical story.","tripadvisor_monas_192":"if you have a change visit Jakarta.... You should come to thousand islands. It takes around 2 hours form Ancol Marina using speed boat and you can see really nice underwater view. You don't have to spend extra money for airline tickets","tripadvisor_monas_193":"Living in Jakarta for almost all my life I understand the need for escape. Thousand Islands is the answer for a short getaway. Unbelievable difference in scenery within an hour or 2 from high skyscrapers to clear blue sea and clean beaches. Protection of turtles and coral has become a fantastic way to increase eco tourism. Diving, snorkelling and other...More  ","tripadvisor_monas_194":"you can visit many islands there for example pulau untung jawa, pulau pramuka, pulau tidung, pulau pari, atau pulau bira. from all islands mentioned, the most memorable is the Pulau Bira. it's like a forgotten island. many resorts are no longer used there. Whereas, you can see a beautiful sunset there, as great as in Bali.","tripadvisor_monas_195":"These hundred of island are just barely 1 hour out into the sea from Jakarta city harbour.It is like a dream come through to snorkel in the shallow and calm waters with sunny blue skies","tripadvisor_monas_196":"Enjoy....Beautiful Java Beaches...Wonderful landscapes,Crystal clear water....Corals... Do Swimming..Snorkeling...diving...water sports...foods.. and have a peaceful vacation","tripadvisor_monas_197":"you should have a private boat to take you to the remote ones (30 km plus) because of the vicinity to the harbour of Jakarta the beaches of the near by islands and the waters around are pretty much polluted.","tripadvisor_monas_198":"Thousand Islands at the Jakarta Bay has many spots for scuba diving.The most economical way is to go to the Pramuka island for a weekend stay and dive around the island. There...read more ","tripadvisor_monas_199":"Thousand Islands at the Jakarta Bay has many spots for scuba diving.The most economical way is to go to the Pramuka island for a weekend stay and dive around the island. There are several dive operator on the island which can provide dive guides, airfill and equipment rental.Costs around Rp250,000 per dive.","tripadvisor_monas_200":"this island is the furthest one between the island cluster. it took us around 3 hours to reach the island. between the island that I've visited, this one could be said that got most complete facilities. My first impression is the island is like a resort, with bungalow accommodation, swimming pool, helipad, beach restaurant. after we finished unpacking, we toured...More  ","tripadvisor_monas_201":"Just back from the short weekend trip to one of the thousand island area. This area very potentially become one of the world famous place to visit. There are still many rooms of improvement, i.e. boat transfer, island management, room management etc.Really hope that this area will be prefessionally managed by Jakarta","tripadvisor_monas_202":"I just wanna give an excelent reviews for this place, named perak island, we can doing camp activities there, in the night the beautiful night in the private-like island, we can do a beautiful moment there, im going there with my friend trip organizer, its @ngetripmulu especially for low cost budget adventure trip in indonesia","tripadvisor_monas_203":"Contains many beautiful small islands, clear beach, good for fishing and snorkeling. Easy access to go there from marina beach ancol, northern jakarta. A bit expensive for the boat, but it was worth it. Stay there in one of the islands for about 2 or 3 nights or maybe more, because the islands is very private.","tripadvisor_monas_204":"It's another world of crowd Jakarta, by taking a small boat from Angke port for few hours, you will arrive in paradise. suddenly you will forget the pollution and the traffic jam you had in jakarta, i came with a group of friends, we rent a villa, with 3 bedrooms, we did snorkeling, we cross one small island to another...More  ","tripadvisor_monas_205":"I like the beach because it really clean, you can see through to the bottom, it has some of water game ( I couldn't play that time because I have a child to take care of ), but it has lots of trash at the seashore. The food was made by the local, so you can taste the local food....More  ","tripadvisor_monas_206":"best island in thousand island. clean, pure, go green. eco building. good food. all you can eat and drink all day","tripadvisor_monas_207":"A lot of good Beaches very closed to Jakarta. Just to take a boat and in less than one hour you can be on the beach.","tripadvisor_monas_208":"Near from Jakarta City centerIt's a place u want to come, to refresh ur mind, soul, and body, after a hard works, in the routines, the busy of JakartaU can do camping, snorkling, diving, also sightseeing","tripadvisor_monas_209":"pramuka island is the biggest island at the thousand island, jakarta. In the island is located the government offices. We stay in pramuka island for 2 day and 1 night in a nice...read more ","tripadvisor_monas_210":"my title says it all, been there couple times and by each visit more and more garbage on the sea, even the local passengers on the boat we were in threw plastic bottles into the sea insensitively. I stayed in Harapan island , and really sad to see too many people living on the island making huge stacks of garbage....More  ","tripadvisor_monas_211":"pramuka island is the biggest island at the thousand island, jakarta. In the island is located the government offices. We stay in pramuka island for 2 day and 1 night in a nice hotel named villa delima.","tripadvisor_monas_212":"The beaches are very nice, but once you get into the water my opinion changed. There were so much garbage that every so often the boat had to stop to clean the garbage from the propeller. I was especially disappointed by the habit of local fishermen to throw garbage to the sea and anchored the boat wherever they like, even...More  ","tripadvisor_monas_213":"We took a trip to Sepa for a day trip which was an absolutely beautiful island. Really small island, not crowded, and amazing beaches and water. I didn't have any regrets picking this island.Now some really good tips going here...1. Boats! We were told it would be a speed boat. When we arrived they wanted to put us...More  ","tripadvisor_monas_214":"I was surprised by how great this islands that so close to jakarta. Make pramuka island as our base and then island hopping to sekati island, water island, semak daun island and kotok island.","tripadvisor_monas_215":"I have now stayed at 3 of the island resorts. So far this is the best. Good beach bungalows, excellent staff, food is fine, nice clean beaches, lovely pool, slightly pricey but you get what you pay for.a truly lovely island escape from the very busy Jakarta. Highly recommended.","tripadvisor_monas_216":"The Thousand Island archipel is located north of the Indonesian capital Jakarta. It is a popular weekend hide-out for the locals. It is just about a 2 hour speed boat trip. We choose to go to Pular Pelangi (Rainbow Island) which is basically a resort. If you have the chance to go off-season and during a week day it is...More  ","tripadvisor_monas_217":"I went with my friends for a short weekend getaway. We booked a travel organizer for 500.000 per person for a group of 5 person.It began with a boat trip from muara angke pier, beware, seasickness is common on this boat, better pick the open area at the back of the boat. The boat trio took about 3 hours,...More  ","tripadvisor_monas_218":"We visited pulau bidadari for a day tour. The water was not clean. However, we was enjoying the cycling around the island. My kids was happy with playing the sand. They caught few small crabs and fish.","tripadvisor_monas_219":"You can take a speed boat or ferry in the morning at the marine pier ancol to pulau seribu, just few hours you can arrive your destination and the sea is very pure, fantastic for snorkeling.","tripadvisor_monas_220":"perfect gateway, beautiful beaches, diving, snorkeling, seafood, budget live-in houses, blue seacool!","tripadvisor_monas_221":"Facilities are old and not well maintained. Food was poor and the worst part of it is that the water (which normally is the purpse on going to 1000 islands) is dirty!!!!","tripadvisor_monas_222":"perfect gateway, beautiful beaches, diving, snorkeling, seafood, budget live-in houses, blue seacool!","tripadvisor_monas_223":"Set up a two night stay with my wife and daughter at the resort. When we arrived it was obvious that the resort was is total disrepair and its best days were probably over fifteen years ago. Most of the public areas are unsafe to enter or walk on, there are no real activities for youngsters, and the accommodations were...More  ","tripadvisor_monas_224":"It depends on which island you want to visit. The longer you take a boat , the more beautiful it would be. Beautiful coral and fishes at shallow water. A lot of locasl go to Pramuka, Ayer or Bidadari island because it's not far from jakarta. The transportation is well organized so you have to take a boat from the...More  ","tripadvisor_monas_225":"a nice escape out of jakarta madness and pollution.however i found the boat ride expensive.once you reach the islands, i recommned you walk around a bit to leave the crowd behind and you will surprinsgly enjoy the clear water and nice sceneryI was a bit disappointed to see all the trash that typically are left behind by...More  ","tripadvisor_monas_226":"There are many islands you can stay on within the 'thousand' islands. If possible head for the ones further out from Jakarta - less rubbish around, less touristy. Closer ones are set up as family friendly resorts with pools, water 'toys', etc. Outer ones are great for peace and relaxation. Picture yourself sitting on a deck chair on white sand...More  ","tripadvisor_monas_227":"This place offers good recreational activity for family and friends. you could find accomodation from guest house to resort class. Perfect for a quick getaway.","tripadvisor_monas_228":"I went there with a group of friends in April 2014. It was an awesome experience going there. You can do snorkling, island hopping, swimming in the sea, or just enjoying the beach. There are a few islands to visit in the area, such as Perak Island (with small port, swings, food stall), Gosong Island (only appears when the sea...More  ","tripadvisor_monas_229":"We did a day trip to Bidadari Island, one of the inner islands. The trip included lunch, a session with dolphins, a three island mini cruise, a banana ride and bike hire. It was great value but spoiled by lots of rubbish in the edge of the sea.","tripadvisor_monas_230":"The view and the beauty of the ocean was outstanding. Diving was the sport of the day. Booked at Ayer's Island, it was value for money for what we got.","tripadvisor_monas_231":"These islands boast amazing white sand beaches. They are, however, too crowded with local groups. In fact they are only affordable if you are in a group. Otherwise, all the...read more ","tripadvisor_monas_232":"Just about the most friendly place I have ever visited!There are two ways to do the islands. You can go first class to some resort island via speed boat. We chose another path.We caught the ferry from Muara Angke that locals islanders use so that we could visit the some of the fishing islands rather than the resort...More  ","tripadvisor_monas_233":"Escaped to Pulau Putri for the weekend after a week in Jakarta for business. I decided to visit Putri as it was recommended to stay as far from Jakarta as possible as there is rubbish floating still around the beaches of the closer island.Putri was delightful. Nice private cottages, snorkelling activities and scuba diving. The water was crystal clear...More  ","tripadvisor_monas_234":"Thousand islands is a group of small islands that are located near Jakarta. My personal opinion, it is a very helpful get away places for whoever live in Jakarta. Looking for clean, quite and private island that you want to spend during your weekend, i recommended you go to Macan island (Tiger island). I really enjoyed it. I did not...More  ","tripadvisor_monas_235":"These islands boast amazing white sand beaches. They are, however, too crowded with local groups. In fact they are only affordable if you are in a group. Otherwise, all the available packages are too expensive for the quality of accomodation offered","tripadvisor_monas_236":"islands in north of jakarta beach, take 3-4hour to reach farrest island. u can stay for 1-2nite here. fishing spot, good beach, bird island. good people here. dont forget to bring UV cream.","tripadvisor_monas_237":"Due to ocean water pollution near Jakarta you need to go to the most distant of the 1,000 islands to get crystal clear water, coral and a good variety of fish. Sepa Island is one of these outer islands, one and a half hours by high speed small ferry. Good for a day out of Jakarta with the family -...More  ","tripadvisor_monas_238":"Although it quite faraway to get to 'Pulau Seribu' from Jakarta, it is totally worthed. Once you get to this place you would definitely forget the crazy traffic and all bunch of stuff you left in the big city. Too bad some tourists leave some trashes during their stay on the island.","tripadvisor_monas_239":"Great place to visit.The cottage was so big, and the bathroom also nice...Compared to other islands in thousand Island, for me...Pantara is the best..","tripadvisor_monas_240":"Went here last weekend to Pulau Harapan, three hours away from Jakarta. I left from the stinky stinky as Muara Angke port via wooden boat, waves are big so brace yourself if you're prone to seasickness. Upon arriving we went snorkeling in two points [beware of sea urchin....and jellyfish, apparently, as I got stung by one] then waiting for sunset...More  ","tripadvisor_monas_241":"Hit the largest of the islands during a quick overnight trip.It was a holiday weekend, where finding a place to stay was difficult at such late notice, but were able to find a room. If you visit, book in time to make sure that you can get a room with working AC, as sleeping in a room at 35...More  ","tripadvisor_monas_242":"We rented a private charter boat (took a bit of haggling with the people in charge), but was able to get a small boat for 5 of us to go to one of the islands (we went to Sepa...read more ","tripadvisor_monas_243":"We rented a private charter boat (took a bit of haggling with the people in charge), but was able to get a small boat for 5 of us to go to one of the islands (we went to Sepa). The boat ride was a little bumpy, but the further you get away from Jakarta, the clearer the water was. It...More  ","tripadvisor_monas_244":"Incredible clear waters so near Jakarta, a short ( about one hour, depending of the island you choose ) from Jakarta. Avoid going during rainy season, can be very bumpy and uncomfortable.","tripadvisor_monas_245":"Islands close to Jakarta still have dirty and oily water. Go further and the water become clearer and free of trash. Some diving sites but not great. OK for diving practice or lesson.","tripadvisor_monas_246":"If you go to this place, you must watch the screening of the movie on Indonesia. The place is really big and the bag at the information center is not very helpful. So either opt for private tour or motorbike taxi or use the buses plying. One can easily spend an entire day here. Houses and museums represents the Indonesian...More  ","tripadvisor_monas_247":"I went there for weekend with couple of friends, it was actually my first visit. It is a great place for few days to relax and escape from all the hectic in jakarta, definitely worth the visit!","tripadvisor_monas_248":"The islands are nice enough but the holiday packages can be so expensive that it's actually better value to fly and visit Bali instead. Best value is to go in large organised groups.","tripadvisor_monas_249":"Been to Jakarta a number of times now and to be honest I wouldn't stay for longer than a few days if I could avoid it due to a lack of things to see & do. Pulau Seribu on the other hand is perfect for a few days to get out of the pollution / traffic that makes Jakarta a...More  ","tripadvisor_monas_250":"Great place to get away from the crammed streets of Jakarta. Only about 1 - 3 hours by boat(depending on which island or boat service you use). It's incredible how clear the water is considering it's so close to the dirty polluted waters of Jakarta. You still will see some trash floating around(Indonesian thing unfortunately) but the wayer is crystal....More  ","tripadvisor_monas_251":"Crystal clear waters. Soft, white sand. Crisp, fresh air. The Thousand Islands is absolutely gorgeous, and perfect for a getaway vacation. We stayed in a villa atop the water (eek! So cool!), and although there isn't much to do, had a great time. This allowed for family bonding time. Do be mindful of the jellyfishes that wash up ashore.Truly...More  ","tripadvisor_monas_252":"I came here on a community service trip with my friends. after the job was done, we went snorkeling. the waters were clear, and the marine creatures were beautiful. we kept snorkeling for hours and witnessed the sunset. this is a beautiful island, i really want to come back.","tripadvisor_monas_253":"I visited Sepa Island for a 2d/1n dive trip with my buddies. The island is very beautiful, the sand is white and soft like flour, the water is quite clean, the air is fresh, the...read more ","tripadvisor_monas_254":"I visited Sepa Island for a 2d/1n dive trip with my buddies. The island is very beautiful, the sand is white and soft like flour, the water is quite clean, the air is fresh, the trees provide shady area to protect us from heat. I brought along my 3 years old daughter and she really enjoyed the beach. There were...More  ","tripadvisor_monas_255":"We hired a private boat from the harbor and they took us out about 1.5hrs to 2 islands..first was Seepee Island which was picture perfect..BUT dont take the food option as it was VERY basic. Apart from that we loved our time with the kids relaxing on the beach. We went jet skiing and snorkeling. We then went on to...More  ","tripadvisor_monas_256":"One island that i visit last time was Pramuka island, beside that we re also going to some small island nearer. With some full service from the tour guide, we alreade get some food, some guidance on foot in land, also sea sightseeing and some snorkeling. We live in some cottage also which is get the sea view. We re...More  ","tripadvisor_monas_257":"I really like the sea,the sea is still clear. nice place to visit especially if you want to do snorkeling,you can see so many kind of fishes. But on the way when u went there,some part of the sea is dirty, maybe because of the harbor near fish market.","tripadvisor_monas_258":"we like that it was not too far from Jakarta but there is lot of rubbish covering most of the beaches","tripadvisor_monas_259":"Generally Thousand Islands are lovely and have fantastic snorkeling venues with delightful food and hospitality. One guide, \"Bang Tobing\" on Pramuka I have had a nasty experience with. He regularly changed prices for trips, demanding more money once those traveling with me had arrived on the island, sometimes failing to provide meals previously paid for. On two separate occasions two...More  ","tripadvisor_monas_260":"Depend on how you arrange it!There are thousand (or a bit less) islands to explore, you may reach em expensively fast or super slow cheap.Bring your friends, family and love one and enjoy every scene.rrr...just ignore the sh1tty smelly garbage you found scattered around!","tripadvisor_monas_261":"this island is great but unfortunately there is so much garbage at the sand. the sunset is marvelous, and the local people trying to help you if you need something","tripadvisor_monas_262":"Indonesia is the world’s largest archipelago. Hidden among 17,000 islands are a cluster of little Islands called Pulau Seribu (Thousand Islands).There are only a few tourist attractions around the bustling capital of Jakarta. Most of them, like these 128 small islands, are not well advertised. Information about visiting them or any activities while on the visit is scarce. Tourist...More  ","tripadvisor_monas_263":"We called it heaven due to its charming and surrounding.Since my parent did not know how to dive, they recieved careful direction from the crew.When I dipped into the water, I was so excited. Cool and wonderful!Swimming under water and watching marine life made value to our trip.The very first impression was that water here was...More  ","tripadvisor_monas_264":"Its a good experience on an island worth the money and time spent though it would be good to putri island which is a 90 min drive. we had been to the nearest island which is about...read more ","tripadvisor_monas_265":"Its a good experience on an island worth the money and time spent though it would be good to putri island which is a 90 min drive. we had been to the nearest island which is about 25 mins drive. the log huts are a good romantic stay and zillions of corals washing ashore beautiful place to be.","tripadvisor_monas_266":"We visited Coconut Star and Pricess Island and we never forget this trip. I call it heaven. They have range of palms and many green plants . That makes you feel more sea wind . So cool and comfortable . They give us private fishing boat for hopping and snorkeling. We started our trip after breakfast . The first impressive...More  ","tripadvisor_monas_267":"Thousand Islands mean literally many islands. These islands lie across northern Jakarta, and some of the islands are not inhabited.You can explore the islands by using rented boats provided by locals and stay at local home stay at the inhabited islands. It was great & have stunning view in some island..I have too say this is right place...More  ","tripadvisor_monas_268":"Who says you cant go home.??? /// :-) :-) :-) Have a nice day or more. Becaus we can. Its my life. I'll be there for you. Till we ain't strangers anymore. Disliked : Contdown only 2 das in haeven. /// Goodbye ////","tripadvisor_monas_269":"Super.... Ayer island. Must see. Travelled by ferry from anchol. Reached within 45 minutes. Good super location in the sea, great place to visit!","tripadvisor_monas_270":"If you don't have enough money to visit bali, so thousand islands are the best choice. It takes 1h to go to the port in the early morning. We took a tour to Pramuka island, included snorkeling, BBQ, cycling around the island, .. And I need to mention that 1000 islands are such a beautiful sight seeing with the blue...More  ","tripadvisor_monas_271":"We used a travel organizer for this trip, and paid IDR 850k / pax, which included private speedboat, private fishing boat for island hopping and snorkeling activities, one night aircond accommodation in Harapan Island, 4x meals, plus snorkeling equipment. There were in total 12 persons participating, and I took my eldest son and my nephew along. We departed from Marina...More  ","tripadvisor_monas_272":"we are 16 persons go to hoping islands on thousand islands rent a private yacht, we start from Pantai Mutiara (there are 3 pier Pantai Mutiara, Pantai Ancol, Muara Angke) took some food for lunch at Pramuka island and diving, saw under sea aquarium at Putri Island then snorkling around it, spent our night at Bintang Island (very quiet island...More  ","tripadvisor_monas_273":"These islands are uniquely beautiful. My son and I briefly visited Coconut, Star and Princess Islands, but actually stayed at Tiger Island, a two-hectare heaven, from which you could swim, snorkel or kayak to other islands nearby. The lush green plant life and towering palms,pines and mangroves keep you cool and tranquil. And the wildlife, from tropical gar to monitor...More  ","tripadvisor_monas_274":"i have been coming here since im small, great place for solo, family or couple. i usually hired a boat, fish and then cooked the fish freshly on the near by island. once i do some squid fishing during the night and cooked them freshly with the local spices heavenly.what i love about it the most is every island...More  ","tripadvisor_monas_275":"Cheap package tidung island - Pulau Tidung is an attraction that presents a variety of beauty and white sand beach that stretches wide and several small islands around it are...read more ","tripadvisor_monas_276":"Cheap package tidung island - Pulau Tidung is an attraction that presents a variety of beauty and white sand beach that stretches wide and several small islands around it are still very beautiful. Surely tourist spot this be the regions which is most in demand by local tourists and mencanegara.If you are planning to a vacation go there together...More  ","tripadvisor_monas_277":"A great place to visit when you are visiting Jakarta. Me and my friend from Hyderabad with our wives went to one of the islands in this great archipelago - Pulau Mecan. Hour and a half by speed boat from Jakarta (near Ancol) - exciting ride thru the blue waters of Java Sea. The Island is privately owned. Has 14...More  ","tripadvisor_monas_278":"went there mid June to Pulau Tidung. The water was great, altho the weather didn't turn up to be sunny until the last day, I had a great time with highschool buddies. Took the speed boat ride which only took us 90 mins to get there instead of 3 hrs.The first day we encountered something that money can't buy......More  ","tripadvisor_monas_279":"Went there with my Daughter. Plenty to do as a waterpark but all the other things are a bit of a let down, Food, drinks etc.","tripadvisor_monas_280":"Beach is dirty, insects in room, no hot water, no fishing, food is lousy, island is half deserted, facilities are bad, room service is not answering phonecalls, too expensive, not coming back for sure,","tripadvisor_monas_281":"I went here twice already. Sepa island's beach is the best in the thousand island area. It is pristine, the sand's very soft, not much coral on the beach, clear blue water. There are thousand of beautiful fish swimming near the beach and the pier. I can actually took my 2 years old to hand-fed the fishes in the water...More  ","tripadvisor_monas_282":"The Backpackers idea came out when we see the review to Tidung Island at the internet,It was a Marvelous experience for me and my girl friend. We went there early morning like 6.30 am from Thamrin Area Jakarta,takes taxi to Muara Angke Harbor it costs IDR 49.000 net with Express Taxi. We arrive there at 7.30 am and directly buy...More  ","tripadvisor_monas_283":"Thousand Island Archipelago consists of many small islands which are exotic and romantic. The beauty of Kepulauan Seribu marine resort is the beauty of unspoiled nature. As far as your eyes can see, you can enjoy, blue and emerald green water, natural white sand beaches. The surrounding reefs are a home to a wide variety of colorful fishes and corals, making...More  ","tripadvisor_monas_284":"The pros.....a quick and cheap weekend escape from Jakarta insanity and if you go far enough you may find good islands...the cons......close in islands are full of Jakarta trash and the waters are unclean!I did my open water scuba diving test in this area....no trash....but lots of dead coral and not that many fish....Choose island wisely and it...More  ","tripadvisor_monas_285":"We have a one day trip to Pari island, as one of the closest island from jakarta after Ayer island. Everything will be good if someone taking care of the waste management. Almost every corner of the beach have waste over exposure. And it seems that no one care and still enjoy that kind of condition. What do you expect...More  ","tripadvisor_monas_286":"Once your boat gets past the rubbish floating around the sea like unwanted eyes, truly paradise and great value for money. watch the tour guides, reps though, they will stalk...read more ","tripadvisor_monas_287":"Once your boat gets past the rubbish floating around the sea like unwanted eyes, truly paradise and great value for money. watch the tour guides, reps though, they will stalk whoever they thinks paying the bill [well some of them, creeps] overall, you have to visit, pure ambience.","tripadvisor_monas_288":"Thousand Islands are pretty different from any other islands that I've visited in Indonesia. The surroundings are still calm and quite clean (compared to other local beaches here!). To put it simply, it is a good getaway from the bustling Jakarta. Try to visit Pulau Macan if you're going here.","tripadvisor_monas_289":"In some parts of 1000 thousand island, there are still many garbages floating. But in other parts of the island I found beautiful coral park and fish underwater. This area is good also for diving lesson.","tripadvisor_monas_290":"I went from Muara Karang harbour with a small boat to Tidung Island. It's about 2-3 hours ride. After I reach there, I found lots of quite okay food in some canteen there. The place to stay itself so marvelous. You don't have to book some bungalow for stay there unless it's weekend. There's no other transportation, but bicycle only....More  ","tripadvisor_monas_291":"If you want to visit Thousand Islands, go north, because the northern side of it hasn't been so commercial to both domestic and international tourists. To stay in Harapan Island would be the best choice because it is not as crowded as the other islands, such as Kelapa Island. And it's better to pay for a tour organizer so the...More  ","tripadvisor_monas_292":"Surely you really need to prepare before, but a holiday, weather permitting very pleasant forwarded in a fascinating nature.","tripadvisor_monas_293":"Jakarta is a very crowded city, mainly for business destination, but who would have guess, travel by a boat in 1-1.5 hour, you can reach a peaceful sanctuary - thousand islands, clean water, beautiful view, relaxing atmosphere, you can dive, snorkeling, canoeing.At that time I visited Pulau Sepa and enjoyed it so much. But must be honest the water...More  ","tripadvisor_monas_294":"When you have a chance to transit in Jakarta, try to go to one of the islands here, like Harapan Island. It takes only some hours in a boat and it will be a nice little getaway.","tripadvisor_monas_295":"Maybe my idea came closest to the southern islands indonesia, I can say that they are ugly, but they could be better organized","tripadvisor_monas_296":"last time i went here to celebrate our 4th years anniversary w my boy friend. Tidung island is the right place to choose. snorkeling and banana boat then back to jakarta. haha, really short vacation but more than enough cause we did it on special day","tripadvisor_monas_297":"You would not believe that it is just next door to the polluted chaotic city, Jakarta. Kepulauan Seribu is placed on the north of Jakarta. It consists of some little islands...read more ","tripadvisor_monas_298":"We took a Speed boat from Ancol to go to an Island in thousand Islands. First we go to Putri Island & stayed their in a vacation rental house. We changed our dress to get ready for snorkeling. After that by a small fishing boat, we roam around the area for some time. The guide took us to another small...More  ","tripadvisor_monas_299":"just got boat trip from jakarta ancol to goto thousand island, it was nice trip with the group, we enjoy the trip visiting thuosand island,,","tripadvisor_monas_300":"I've been there during the new years celebratrion 2012. Nice beach, nice snorkling, nice event been there.","tripadvisor_monas_301":"You would not believe that it is just next door to the polluted chaotic city, Jakarta. Kepulauan Seribu is placed on the north of Jakarta. It consists of some little islands formed like a chain of pearl. I have been to some of them and here is the review:Pulau Tidung - It was booming in 2010-2011 as a cheap...More  ","tripadvisor_monas_302":"So many Islands, been to Pramuka Island, many suburbans, water is dirty. Applies the same with Tidung Island, but you can rent a bicycle to go around. Pulau Air is the most often spot for snorkeling. Sepa Island is the best from those i visited. cleaner sea, rent a boat to snorkeled at a better spot (u have to bargain)....More  ","tripadvisor_monas_303":"My weekend getaway! I've been to some islands with my traveller friends and snorkeling! There are many islands in Thousand islands, different islands different stories. Islands that i love most are Macan island & Putri island. These islands are my fave islands to rest and relax because the islands has cozy resorts (yes more expensive than other islands) but it's...More  ","tripadvisor_monas_304":"Great weekend gateway. The boat leaves early in the morning from Jakarta so be sure to allow plenty of time to get to the jetty (traffic in Jakarta can be horrid even early in the morning), if you miss the boat there is no other boat going out to the island that day. Well worth the two hour boat ride....More  ","tripadvisor_monas_305":"If you like quite and beautiful beach and you happen around in Jakarta, feel free to go there. Lots choice of islands which will make you happy.HOW TO GO THERE;There are 3 routes to take.FIRST, by \"Muara Angke Harbor\". Its takes longer because of the slow Ferry boat, and cheaper($5-$10,depend on which island u want to go)....More  ","tripadvisor_monas_306":"Went here with few of my friends for only 2nights.Wrong timing because it was a school holiday,so it looks almost the same with the jakarta city,too crowded.Went to Pramuka Island and did some snorkling and diving,wasn't that good.But some friends told me to go further from the island,it gets better condition.My advice,pick your holiday timing..","tripadvisor_monas_307":"One of the best escape I've ever had! The place where you can find great beach with amazing sand, and the best part is it just 1-2 hour from Jakarta by boat.","tripadvisor_monas_308":"Get bored with office in weekdays? No budget to go to Bali? Well, Thousand Island is the answer. You don't need a plane to go there. All you need is Saturday, Sunday, and a boat...read more ","tripadvisor_monas_309":"you'll find more than 1 island to be visited, but most of them have average scenery. I've been to pramuka island, tidung island and tiger island. From all three, tiger island was the best holiday I had! Since it's a small private island, the owner will restrict the number of visitors. So you'll have your private moment to enjoy. When...More  ","tripadvisor_monas_310":"Get bored with office in weekdays? No budget to go to Bali? Well, Thousand Island is the answer. You don't need a plane to go there. All you need is Saturday, Sunday, and a boat! There are a lot of vacation packages offered by many small or big tourist agents. A perfect escape for weekend. You should try Pramuka island,...More  ","tripadvisor_monas_311":"This trip was very eye opening for my 15 year old son who was extramely alarmed at the condition of the harbour and the first hour of the boat trip. There is no garbage controll in Indonesia, and in fact at the old harbour one cannot see any part of the Ocean. All that is visable is garbage and more...More  ","tripadvisor_monas_312":"It's a low cost back packer / home stay trip if you go to Pulau Tidung. Fun to go on a traditional fishing ship to the snorkeling spot nearby the Island. Water activities like banana boat, jet ski are available for rent. A nice beach on the island is easy to get there by bike. No cars are allowed on...More  ","tripadvisor_monas_313":"I have visited my son an we have had very relaxing days. There are very quietly landscape an friendly people, also staff and guests.","tripadvisor_monas_314":"Okay, it's the nearest travel destination from Jakarta for a day. The sand, the sunshine, the mangrove, we have the same scenery in other islands in Indonesia. So it's not very special for me, lets say it average.","tripadvisor_monas_315":"No much people know 'bout Payung Island. But for me since i was young i've been there with my dad. it has beautifull sands, view, so private and relax. all people there is like a family. very quite @ nite. We can fishing from the bridge facing to the sea. swimming like our island. ^0^","tripadvisor_monas_316":"Want to taste an island life a bit but not to far away from Jakarta? Thousand Island is your next destination.Group of tiny island in the northern side of Jakarta are in deed one of a refreshing gate away from the hustle and busy work life of Jakarta.In some Islands there are traditional 'kampung' village and so the...More  ","tripadvisor_monas_317":"Thousand Islands, like its name, consists of many islands. Each island can give you different opinions. If you go to Pramuka Island for example, there's not much you can do there except blending in with the locals, whereas in Tidung Island, there are many beach attractions from swimming with sharks to snorkeling. Best thing to do is to charter a...More  ","tripadvisor_monas_318":"We rent a tender from a owner nearby and sailing around the island. It was totally fabulous, we loved sailing once staying somewhere. This Thousands Islands was a nice place, the water was absolutely pure, the atmosphere here was quite nice, good environment as well.","tripadvisor_monas_319":"it was like gilis.. but it's not it.. it's a way out from the very stressful city on earth. but they still have to put a lot efforts.. but I like the sea.. blue ocean...","tripadvisor_monas_320":"Visited Tidung Island in middle of September. A good month for sailing there from Jakarta [Muara Angke port]; weather was clear, and sea was calm. The farther we left Jakarta, the sea gets cleaner and clearer. We arrived within 2 ½ hours. The island is consisted of big Tidung and small Tidung, joined by a long bridge. The walk across...More  ","tripadvisor_monas_321":"I'd been snorkeling in Nusa Lembongan and Pulau Penyu already and Thousand Island (Pramuka Island) is a way much better for than the Penyu Island. The coral, sand and water is amazing pure. Only the island itself very bad. The sewage from the houses are directly to the small river on the beach. I talk with the officer from Ministry...More  ","tripadvisor_monas_322":"Avoid going at the beginning of the wet season after Jakarta's first 'flush' after the dry season. We stayed at an island some way out of Jakarta, Tiger Island. Sea was full of rubbish.","tripadvisor_monas_323":"We hired a boat from Ancol, and travelled to Pulau Sepa and Pulau Putri. We did enjoy Pulau Sepa the most - great beach and the kids enjoyed snorkeling for the whole day. Its a hidden gem - right outside the city","tripadvisor_monas_324":"Used to be pristine and exotic, but now polluted and overcrowded. Especially on the more popular islands. Essentially, the further away the island from Jakarta and the tourist crowd, the more probable that it is cleaner.","tripadvisor_monas_325":"it was like gilis.. but it's not it.. it's a way out from the very stressful city on earth. but they still have to put a lot efforts.. but I like the sea.. blue ocean...","tripadvisor_monas_326":"We went to the island known as Pramaku. People say it is the best island for snorkeling, but don't take their word for that. There is no guidance at all throughout the time u are left there. The prices are quite steep. It is normally 400'000 but we bargained down till 315'000 which was good, per person mind you.u...More  ","tripadvisor_monas_327":"Need to enter Ancol marina with a payment of IR 15,000 per person and head off to either the ticket offices or to where the islanders take the ferry which is 10 times less than the ride on the speed boats. We paid IR 315,000 per person from Ancol (pronounced Anchol) to Pramuka which is 1hour and 10mins from marina...More  ","tripadvisor_monas_328":"I had my first time snorkeling experience at here. Beautiful, unspoiled and quiet island. Sometimes I had a bit sad when still saw garbage in some places. Island quite rare freshwater in the dry season. Good places to go diving: live corals, many colorful fishes, turtles... Appropriate for a romantic weekend get away from crowded Jakarta.","tripadvisor_monas_329":"We been to Pulau Sape, and it was very pretty. I just did a day trip, having only 2 days in jakarta I decided to have one on the beach and one in the city. The island was small, crystalline water and few people. I must say there was an aggravated fish that kept biting me and my boyfriend. I'm...More  ","tripadvisor_monas_330":"If weather allows, this is the place to go. visit the northern part of the islands and you'll get a clean, quite private getaway beaches and islands. Tidung and Macan are just a...read more ","tripadvisor_monas_331":"The island in general still looks good, however there are some accommodations still need to be improved in term of facilities and services.","tripadvisor_monas_332":"Pulau Tidung, one of the island in Pulau Seribu is located very far away, I travel there with Ferry from Muara Angke and it takes 2 hours and a half. Quite crazy... But worth it because the sea is so so so blue! It's best in Snorkelling because there are still so many fish and coral, they are all beautifull....More  ","tripadvisor_monas_333":"If weather allows, this is the place to go. visit the northern part of the islands and you'll get a clean, quite private getaway beaches and islands. Tidung and Macan are just a few of the islands you could visit. take one or few friends with you, and you'll have a memorable trip to these islands.","tripadvisor_monas_334":"I came to Pulau Ayer, the nearest island among thousand islands, with my colleagues last year. Fortunately, I was an office gathering so I hadn’t had to pay it by myself. It’s a bit expensive. It was around IDR 1 million for one people for staying one night. But we don’t have to pay anything else. They said we were...More  ","tripadvisor_monas_335":"some are tranquil, some still pristine, and some others are packing with local tourist. be an island hopper to witness their own nature beauty, upside and down side.","tripadvisor_monas_336":"I have only stayed on one of the seribu islands so far, but I hear that the further you go from Jakarta, the better the islands are. Pulau Sepa was an excellent island to stay on.It had a relaxed atmosphere, busier on the weekend and quiet on weekdays. The staff were friendly and the food was excellent and plentiful....More  ","tripadvisor_monas_337":"We took a fast boat and in two hours arrived at a charming little (tiny) island with a bike trail around it and a boardwalk to another quieter island. The water is full of junk, so I would not venture out into it, especially barefoot, but is is nice to rent a bike and spend the day with a picnic...More  ","tripadvisor_monas_338":"great for island hopping, only 2 hours sail from Muara angke / ancol. Avoid weekend though since it will be swarmed by tourists","tripadvisor_monas_339":"If you are live in jakarta and want to go to an island i think pramuka is one of the best option. Its not to far(2 hours) and its cheap. My fav is Villa delima, located in the main beach not far from the harbour. And usualy im diving wit Elang Ekowisata run by Komeng.","tripadvisor_monas_340":"This is just a very nice, quiet and slow place to enjoy to get out of the city. Just beautiful.","tripadvisor_monas_341":"This island is one of the biggest island in Pulau Seribu,Pulau Pramuka is not so far from Jakarta (It takes around 1 and a half hour from Anchol,Jakarta) ,Good view ocean...read more ","tripadvisor_monas_342":"This island is one of the biggest island in Pulau Seribu,Pulau Pramuka is not so far from Jakarta (It takes around 1 and a half hour from Anchol,Jakarta) ,Good view ocean , kindly people , many turtles ... You can visit pulau pramuka on 1 day trip.If you live in Jakarta , You might ought to go...More  ","tripadvisor_monas_343":"P.1000 is nothing compared to Bali etc, but when time doesn't permit divers to travel far, it could be a good enough short weekend getaway, perfect for open water exercise as well. Better environment than 10 years ago, one can easily meet turtles and even skeleton shrimps on a nite dive!","tripadvisor_monas_344":"if u r visiting jakarta, this is a good for a quick beach / diving experience","tripadvisor_monas_345":"Depends on which area are you in. More Far from Jakarta it's getting better","tripadvisor_monas_346":"Went out on dive trip with a company called Bubbles. Fantastic coral within easy snorkelling distance, thousands of fish. Did a discovery scuba dive - blown away. Nearby are many other places to dive, sand mounds, wrecks - it's gorgeous.","tripadvisor_monas_347":"my partner and I decide an escape to visit Kepulauan Seribu and we choose the one that have accommodation on the water. I believed it was called Bidadari. The wave bit rough on the way to the island and the hotel room was great. The island is just fine and little too much of rubbish scattered around, the sand is...More  ","tripadvisor_monas_348":"its recomend island,i was visit tidung island and for the first time i saw the white beach and clear blue water, and its very difrent from Jakarta city.","tripadvisor_monas_349":"It was great & have stunning view in some island. My last visit for photo session in Tidung Island. Great view & photo spot. Especially for prewedding session.","tripadvisor_monas_350":"calm people, calm place, beutifull beach,..so natural...hehe...you have to visit this island ....good","tripadvisor_monas_351":"Pulau Bintang (aka Pulau Melintang) is located 1.5 hours sail from Pulau Pramuka. It is actually privately owned, but organized like hotel. There are cottages you can rent (up to 10 people in 1 cottage) and the view is great even if you don't rent a boat to go island hopping.There's a sandy beach for your kids to play,...More  ","tripadvisor_monas_352":"best news is that you have no clue how close to JKT this islands are. The air clean, the reefs way better than most degraded coastal reefs, the feeling give you \"vacation mood...read more ","tripadvisor_monas_353":"best news is that you have no clue how close to JKT this islands are. The air clean, the reefs way better than most degraded coastal reefs, the feeling give you \"vacation mood\"; even if the costs are Bali-like. keep expectations low and you'll depart smiling.","tripadvisor_monas_354":"So the beaches are ok, the water is ok, its well... ok. If you want to go to the beach and are stuck in Jakarta, this is a good way to go on a short schedule and a small budget.","tripadvisor_monas_355":"Noit enough has been done to conserve the enviroment of these (used to be) good marine bioversity.","tripadvisor_monas_356":"nice clean sandy beaches, try on rust island you can see old dutch fort","tripadvisor_monas_357":"Cool...funtastic..great...!!! totally nice place to enjoy the beach, sunshine, sunset, water sport, snorkeling, etc.....if you like water adventure..its a M U S T!!!!!","tripadvisor_monas_358":"easy to reach, cheap, but it's unforgettable !the sun shines so beautiful","tripadvisor_monas_359":"The name speaks for itself. Thousand Islands mean literally many islands. These islands lie across northern Jakarta, and some of the islands are not inhabited. You can explore the islands by using rented boats provided by locals and stay at local home stay at the inhabited islands. You can camp at some not-inhabited islands as well. Some islands are privately...More  ","tripadvisor_monas_360":"Since thousand islands consist of several hundreds island, most of it without inhabitant, I will specifically review Pulau Macan (Tiger Island) that we went recently.This island is operated by a foreigner and keep its nature by using as minimum as possible electrical, freshwater from rain, and no air conditioner. This is a bit unusual for the price, but the...More  ","tripadvisor_monas_361":"Simply one of the best riff. the place itself is nothing of exceptional, but as soon you start to dive... Very GOOD!!!","tripadvisor_monas_362":"Pretty beaches. Can be prettier without the rubbish, though. Seriously, people here need to learn to appreciate their home more.And there's a shortage of fresh water in dry seasons.","tripadvisor_monas_363":"Unforgettable delightful island resorts with luxurious traditional style cottages. The right place for relaxing, refreshing, set in a clear blue sea, filled with myriad of...read more ","tripadvisor_monas_364":"There are literally almost a thousand small islands accessible from Jakarta (via Ancol pier) by boat. The trip from the marina averages 2 hours depending on which island you choose to go to. Pulau Macan is among the highly recommended islands to spend the weekend.","tripadvisor_monas_365":"Unforgettable delightful island resorts with luxurious traditional style cottages. The right place for relaxing, refreshing, set in a clear blue sea, filled with myriad of tropical fish among multi color corrals","tripadvisor_monas_366":"Travel by boat only 90 mins from ancol pier. You can dive snorkling spent 1 day and go back to jakarta.There also many hotels. the name Thousand Islands mean many Islands you can choose for accomodation. From the private one (P Sepa, P Macan, P Ayer) to standard (P Pramuka)","tripadvisor_monas_367":"You can do snorkeling, and diving, or even just playing and hear the wave","tripadvisor_monas_368":"Nice place to stay on the weekend, good place to take a rest or do some seasports. But the water not always as clear as expected and some infrastructures are not in a good shape. The good ones are just too pricey to me","tripadvisor_monas_369":"Pulau seribu has alot of island with different segmentation, so please pick your island to spent with wisely. I my self went to Ayer Island, it's a nice well maintained island for family vacation.","tripadvisor_monas_370":"located quite near from jakarta so that mean it would be easy to access, the nearer island from jakarta is polluted, while the farther means expensive","tripadvisor_monas_371":"We visited Pramuka Island for an overnight stay as part of a diving course that we did through Ody Dive in Jakarta. The boat left from Ancol Marina and took about one hour to get there. The return trip took slightly longer since the seas were rough. If you suffer from seasickness you will need to take something before the...More  ","tripadvisor_monas_372":"Last year me and 9 of my friend rented a yacht for a day for fishing and snorkeling, it cost around USD 1000 for the whole day trip with the crew. We prepare our own lunch in the yacht and then stop by to a small island to ate our lunch and enjoy the panorama. we did fishing and snorkeling,...More  ","tripadvisor_monas_373":"Great places to go diving: live corals, many colorful fishes, turtles...","tripadvisor_monas_374":"pulau seribu is near from jakarta, its quiet since many island is so remote. some place are good for diving and for snorkeling.","tripadvisor_monas_375":"pulau seribu is near from jakarta, its quiet since many island is so remote. some place are good for diving and for snorkeling.","tripadvisor_monas_376":"Though the weather made me sweaty, I enjoyed the view so much. This place is great for someone who like beaches and salty air. I would go back 101%!","tripadvisor_monas_377":"As I live in Jakarta I some times go diving in Palau Seribu. Its close and cheap. The diving is not very good, nor are most of the Indonesian divers, but at least it's wet. Stayed in Sepa Island resort one weekend, neither the accommodation nor the food was anything great. Perfer to do one day trips. Like I said...More  ","tripadvisor_monas_378":"Well it is not Bali but you can get a quiet island and beach at one hour away from Jakarta, priceless!","tripadvisor_monas_379":"some islands are owned by resorts for the upmarket travellers with full facilities. the other islands are perkampungan/villages.. where the people live from fishings. for budget travelles you can stay in villagers homestays. many of these homestays are airconditioned. try to go there in the weekdays.. cause weekends are full and packed with people.in pramuka, i can recommend you...More  ","tripadvisor_monas_380":"I was not expecting a good snorkling area so close to Jakarta. But when I went to Pulau Pramuka and its surrounding islands, they corals and the sea life there are quite good.We started off in the morning to Muara Angke fish market. There's a boat that leaves to Pramuka at a mere cost of Rp. 30,000. The boat...More  "}