{"tripadvisor_monas_0":"Galeri Nasional Indonesia is an art gallery located in jalan Medan Merdeka Timur at the opposite of Gambir Train Station, so it is very easy place to reach using public...read more ","tripadvisor_monas_1":"Went Here on 18th of September 2016.We visited the 3 sections(buildings) where a lot of paintings located.If you are an painters/love paint art then this will be a heaven for you.Too bad the cafe is closed.Not many things to do here other than stare at the paintings.Some sections will explain to you about Indonesians artists,...More  ","tripadvisor_monas_2":"Galeri Nasional Indonesia is an art gallery located in jalan Medan Merdeka Timur at the opposite of Gambir Train Station, so it is very easy place to reach using public transportation . For visitors using their own transportation ,the parking area is quite spacious. it is a Magnificent old Dutch building . They have 2 kind of exhibitions. Permanent and...More  ","tripadvisor_monas_3":"We came here because of the \"17:71\" special exhibition, but we also visited the main gallery. The gallery collections are way better that what I expected, so does the layout & setting. It is well maintained and comfortable to explore.The special exhibition was fascinating and worth the 2-hour queue, but the main gallery alone is worth a visit, too.","tripadvisor_monas_4":"This Gallery located near Museum Nasional Indonesia and Monas, so if by anyways you visited those places you might as well visited Galeri Nasional Indonesia. There are 2 sections in this Gallery, one with permanent collection and contemporary exhibits. Contemporary exhibits might held different kind of art such as painting, statue or many else.If you visited in the weekend,...More  ","tripadvisor_monas_5":"Well curated exhibitions and permanent collection.Recently went to the 17|71: exhibit showing the paintings of the presidential palace and it was awe inspiring. Masterpieces by Raden Saleh, Afandi, Bonet and Walter Spies among others.Highly recommended to get a glimpse of Indonesian modern art.","tripadvisor_monas_6":"The 17:71 exhibition is a celebration of the anniversary of independence of the Republic of Indonesia, and the Presidential Palace of the Republic of Indonesia staged the exhibition of a number of collections of paintings and photographs of the Presidency. This is the first exhibition of this presidential collection of paintings since the independence of Indonesia and was the first...More  ","tripadvisor_monas_7":"We came on a Sunday to especially visit the Temporary Exhibit that celebrated the 71st Indonesian Independence day. The temporary exhibit featured the collection of selected paintings from Indonesian Presidential House. We enjoyed the paintings and the stories behind them. The tour also provides substantial amount of interesting information regarding to Indonesian art history and its connection to the independence...More  ","tripadvisor_monas_8":"After months finally we came here, at the same time there's painting exhibition from President's Palace collection called \"Goresan Juang Kemerdekaan\" 17:71.Entry ticket is free but we have to register first (because its a very valuable collection). I dont understand painting much, but I highly aprreciate those masterpiece.","tripadvisor_monas_9":"First time to visit because of the promoted temporary exhibition of paintings from the collection of the presidential palace, never before shown. Building is well kept, air conditioned, good lighting. Peaceful atmosphere as visitors have to register first and are admitted in turns so as not to make the rooms crowded. There is also a permanent exhibition of art at...More  ","tripadvisor_monas_10":"With a very interesting exposition about 71 years of Indonesian independence, it surprise me to see some of local artists works and the history behind","tripadvisor_monas_11":"Indonesian art gallery at its finest. Although there are not too many pieces to see (compared with other national galleries in the region, esp. in Singapore), it is always great...read more ","tripadvisor_monas_12":"Indonesian art gallery at its finest. Although there are not too many pieces to see (compared with other national galleries in the region, esp. in Singapore), it is always great to see contemporary works of art, plus the pieces from world war 2 and colonial eras. Great exhibition plus the touchscreens that would give you more details about the pieces...More  ","tripadvisor_monas_13":"The gallery is well planned, permanent exhibitions show the evolution of social and political themes in Indonesian art. Spacious and well lit, cool and admission is free. The other section housed a great exhibition when we were there too : Social Design for Social Living. Polish and Indonesian artists collaborated and interacted to produce cinema, music, photography, design integrated with...More  ","tripadvisor_monas_14":"The National Gallery of Indonesia is well worth a visit albeit the collection is relatively small. It is well laid out and has an excellent interactive machine in each room with a commentary on each work of art on display.Meraba Diri by Ivan Sagita was the first work that caught my eye. Not surprisingly as it's the first on...More  ","tripadvisor_monas_15":"My first step in Galeri Nasional for a temporary exhibition it was good. Beautiful places, big spaces where big contemporary pieces of arts are well valorized and (wow!) well illuminated!...not so easy in Jakarta to find some like this.The only regreat is that this beautiful place has not a bookshop!!!! it was closed and I wonder if only under...More  ","tripadvisor_monas_16":"The place is easy to find near Central Jakarta, very friendly staff and clean compared to the streets outside. Upon entering you'll feel like you're entering one of the centers in Europe. But then during summer it gets really humid outside as there are not many trees  cell phone signals are hard to find :)","tripadvisor_monas_17":"With the original building being constructed in 1817 as Indies Residence, the National Gallery has been used as a cultural institution since 1999.Today the gallery holds a lot of exibitions bat also showcases works by famous Indonesian artist.","tripadvisor_monas_18":"This semi-open plan of a site features a great (free!) permanent exhibition. It's located on the left building. If you're really into art history (like me), a hired guide (last time it was with Mr.Aola) will really help out in comprehending the why when what how's of each piece and how it fits into the national political/social/psychological state of an...More  ","tripadvisor_monas_19":"the staffs are really friendly and helpful, the place is really easy to find, the facilities are good and very clean.","tripadvisor_monas_20":"Ok I was not expecting much from this gallery, albeit it's on the smaller side, the historical works within the gallery itself and the modern and contemporary works in the other galleries in the grounds are quite good.It was well set up, well lit, clean, and the flow was ok. I didn't feel like I was in a maze...More  ","tripadvisor_monas_21":"This is a lovely museum with some interesting Indonesian art. It is not nearly a complete collection and the layout is kind of odd but it is free and a good way to spend an afternoon. It's also close to Monas if you want to wander over there afterward.","tripadvisor_monas_22":"this place is most poplar in student or tenager in jakarta, at galeru nasional you can take a photo but you dont to be touch the art. the art was very great and very famous. you...read more ","tripadvisor_monas_23":"this place is most poplar in student or tenager in jakarta, at galeru nasional you can take a photo but you dont to be touch the art. the art was very great and very famous. you must go here to know how about indonesia art and culture","tripadvisor_monas_24":"Yes it's not a world-class art museum, but for Jakarta standards it's great, and it's improved a lot since the last time I visited several years ago.It's free, decent lighting, good collection of Indonesian art (even if it's missing significant contributions by the most famous Indonesian artists). For an Indonesian museum I found the labelling to be rather good,...More  ","tripadvisor_monas_25":"I have visited Galeri Nasional several times during public exhibitions. It's really an interesting place where I can learn about arts as well to appreciate the artist's work.Nowadays Galeri Nasional has renovated the buildings to become more attractive and function better to their visitors, not only domestic but also foreigners.As I go abroad occasionally, I usually take a...More  ","tripadvisor_monas_26":"First time i visit this place because my friend work here. He took me around it at that time there was no exhibiton held. Second time i visited it when there was Japanese Anime Exbition that held by Japan Foundation. It was good display. So,i recommend you if you want to visit it in good condition,visit when there is an...More  ","tripadvisor_monas_27":"The name \"National\" is a bit misleading as there are quite few halls and not very many artists exhibited. Yet, the exhibition is changing in time and has also some international artists presented.","tripadvisor_monas_28":"I love art, that's why every time I came to this gallery I feel sad. Compared t other galleries overseas, galleries in Indonesia are poorly managed. Even though the buildings are clean and in good condition, but they lack improvisation and technology in displaying the artworks. This one is the main national gallery, so I hope the government will take...More  ","tripadvisor_monas_29":"The only bad, bad thing about this place is, why it has to be closed so early at 6 PM? Lol. Anyway, prepare yourself if you're visiting Galeri Nasional on weekend, there will be lots of teens with DSLR camera finding cute spots for updating their instagram feeds. Although it's nice to see teens' interests on art are increasing, sometimes...More  ","tripadvisor_monas_30":"Galeri Nasional Indonesia is one of the gallery in Jakarta which have great collection of art, various exhibition, and yet they were all free.Visit their website to look up the schedule (http://galeri-nasional.or.id/halaman/178-jadwal_pameran_temporer_2014). Fortunately, the website are pretty up to date.Their parking space is pretty large too, and it's located in front of Gambir Stasion and near to the...More  "}