{"tripadvisor_monas_0":"this museum was built by one of the minister of Indonesia who love culture homegrown, especially kite Indonesia, unfortunately only students first level are frequently visited...read more ","tripadvisor_monas_1":"this museum was built by one of the minister of Indonesia who love culture homegrown, especially kite Indonesia, unfortunately only students first level are frequently visited, for the middle and upper levels are very rarely, even though the purpose of this museum is how we orng Indonesia in love with its own culture, sometimes there show how to make kites...More  ","tripadvisor_monas_2":"THe Meseum with many bite from another culture. We can learn how to mkae a stylish bite. For children can learn how to make kite and can play with another child. Good for olders too .","tripadvisor_monas_3":"Getting to the museum is a bit tricky on a work day as you will have to deal with traffic along jalan Fatmawati, but once you get there its worth it. The building it self is a traditional Javanese compound with lots of trees really nice for kids to run around. For a price of only a bit more than...More  ","tripadvisor_monas_4":"It is interesting place where you can get to know more about the country and its culture. It's good for a Sunday afternoon. There are activities such as making pottery and painting shirts. It is a good place to take your kid.","tripadvisor_monas_5":"the museum surrounding by big trees. first the guide will take us to a room to watch a film about kite history. After that the guide will show us around and inform the history behind each kites. It was interesting stories. I never knew before that Indonesia having so much kind of kites. Each region or province have their own...More  ","tripadvisor_monas_6":"Interesting place to visit and learn how to make the kites as well. They also offers a short class for making ceramics, painting and other activity. Recommended for kids and family.","tripadvisor_monas_7":"Museum Layang-Layang is a lovely little kite museum near Fatmawati in Jakarta. It is located on a backstreet though is signposted from the main road. It can be hard to miss but on Jl H Kamang the sign is pretty large.The buildings of the museum are in a Balinese/Hindu style. This speaks to the Bali-focus of much of the...More  ","tripadvisor_monas_8":"The museum is privately owned by a kite lover. By paying IDR 15.000 per person (above 3 years old) including making and coloring kite.First step we watch movie about kite. Duration is 15 minutes and surprisingly my son got so excited watched it until finish. The movie quality itself is not too good but overall entertaining.Then we go...More  ","tripadvisor_monas_9":"You won't have seen kites like this anywhere. Endang Ernawati built her museum in 2003 after 40 years of kite collecting hundreds of kites. A kite construction expert, she developed her interest partly because kites were then the provence of men. Her collection includes batik kites, Chinese kites smaller than butterflies, enormous Balinese kites, kites made of leaves, kites used...More  ","tripadvisor_monas_10":"located in the middle of a quiet neighborhood, it is pretty spacious and nice once inside.The owners and manager are really kind and helpful and offer free tours around the place. after looking at the kites and javanese- post colonial architecture, children get to join in activities such as kite making, paper umbrella painting and clay making. i think...More  ","tripadvisor_monas_11":"This was a great place to take a field trip. The kids watched a video about the history of kites and they got to paint their own kite.The one piece I did not enjoy was the...read more ","tripadvisor_monas_12":"So, we went here accidentally since the way to national museum was closed due to Jakarta Marathon, and it's only about 5 km from home. My son often plays kite with his friends at home, and when we talked about this museum, he's so excited mo to make a kite himself.When we got there: They were very polite a...More  ","tripadvisor_monas_13":"This was a great place to take a field trip. The kids watched a video about the history of kites and they got to paint their own kite.The one piece I did not enjoy was the museum. The tour guide was to slow for grade 1 students.","tripadvisor_monas_14":"This place is really near with my home haha so one day I bring my friends to go hereFirst, we have to buy a ticket (Rp 10.000/tickets) and watch about history of the kite on big TV. Then we go to the showroom, they have so many kite! I love the big dragonfly and butterfly, the guide will explain...More  ","tripadvisor_monas_15":"Okey its nice park but not huge comparing to others but at least Jakarta has one better than nothing.Better to get the FAST TRAX better than waiting in long ques with hot weather.","tripadvisor_monas_16":"Traditional building, lovely people to show us how to make kites from scratch after first showing us around their amazing kite museum. The kids then had a chance to run around the grounds flying their kites!","tripadvisor_monas_17":"Kites have been used for all different purposes in many countries. They also come in different sizes from the tiniest one (mere 2 cm) to the gigantic ones. Some kites were made for purpose of science such as creating aircrafts or attracting lightning, some were made for cultural celebrations and traditions, and some were made purely for joy. It is...More  ","tripadvisor_monas_18":"I went there with my friends from US, which was really excited to know all about batik in the museum. it covers historical message very well.. worth visit","tripadvisor_monas_19":"We had been to the museum with our kids. Firstly , the place was a little difficult to find. The entrance tickets are just about 10 /15 thousand rp . They made us watch a video which the kids weren't too interested about. We then went inside and watched the display of kites of various kinds... this was really interesting....More  ","tripadvisor_monas_20":"The museum houses a private collection of kites, mainly from Indonesia but from other parts of the world as well. We had a tour from a personal guide, as well as a craft activity & watched a video about kite flying, & met Mrs Puspoyo, who owns the collection & is passionate about kites & batik. Some very, very beautiful,...More  ","tripadvisor_monas_21":"It's a kite museum but you can do a lot of activities here. From learning to make a simple kite itself, making pottery, painting batik, painting wayang.When you arrive at the museum, they will ask you watch a video showing about kites from other countries and kites competition. They ask you to do so, because they need a little...More  ","tripadvisor_monas_22":"We'd heard about the importance of kites in this area of the world, and one of the best parts of this museum was the video they showed of kites in the Bali Kite Festival. Kites...read more ","tripadvisor_monas_23":"We'd heard about the importance of kites in this area of the world, and one of the best parts of this museum was the video they showed of kites in the Bali Kite Festival. Kites of 100m long needing to be hoisted by 60 people have to be seen to be believed. The museum part displays a wide array of...More  ","tripadvisor_monas_24":"While some areas of this place are a bit dusty, the kite museum is a lovely quiet place to spend a couple of hours away from Jakarta craziness. Kites big and small - and I'm talking very big and very small - every shape, size and material. Incredible to see the history of these kites and how they have developed...More  ","tripadvisor_monas_25":"Although the museum was a little hard to find for our taxi driver we were very glad that we made the one hour drive in Jakarta's crazy traffic to get there!We were greeted by an extremely friendly museum guide who gave us a private tour through the place. The museum has some spectatular kites on display. You can tell...More  ","tripadvisor_monas_26":"This museum is unique and has a variety of kites from around the world...from very large kites to miniature kites...the kites are made of different materials like dry leaves,batik cloth,etc...also kites that can make music...kids will enjoy the kite workshop where they can make their own colorful kites....they show a short video about the kite festival that happens every year...More  ","tripadvisor_monas_27":"An amazing place. As a family we enjoyed the museum by observing the kites from across the Indonesia and the world. Peaceful environment and you could make your own kite. I would recommend to all travellers and to all those living in Jakarta to visit this place atleast once.","tripadvisor_monas_28":"Several rooms filled with multiple kites - some entered in competitions. It was fun to see the designs and designers. In a city with limited museums, it was enjoyable to visit a museum with a different twist!","tripadvisor_monas_29":"it is amazing to see whats inside this museum. I recommend to tourist no to miss this place. Beautiful kites from all over is displayed here.","tripadvisor_monas_30":"I went here with my family and a few colombian kids that we were hosting. The kites were beautiful, the people there were very friendly and it was fun when I tried to create my own kite! This place is definitely a must go to!","tripadvisor_monas_31":"I found this place from tripadvisor while i was in jakarta with my kids & decided to pay a visit.I found it puzzling that most of my indo friends rate 'the mall' as their top destination.This kite museum is definitely one of those place that can leave you (& your kids) fascinated for hours, while learning a thing...More  ","tripadvisor_monas_32":"Kite museum is really a cool theme museum to visit. Here we can learn to make kite and to decorate it, and we can also learn to paint t-shirt and make ceramics. Recommended for family visit.","tripadvisor_monas_33":"Museum Layang-layang / Kite MuseumJl H. Kamang No. 38, Pondok Labu, South JakartaOpen every day from 9am to 5 pm except national holidayTicket: Rp. 10.000Before going...read more ","tripadvisor_monas_34":"Museum Layang-layang / Kite MuseumJl H. Kamang No. 38, Pondok Labu, South JakartaOpen every day from 9am to 5 pm except national holidayTicket: Rp. 10.000Before going here, you would need to have a clear direction on how to get here as it's located in the residences area.The area of the museum itself is not very...More  "}