{"tripadvisor_monas_0":"I love this place. They have a small garden at the center and have many good restaurants and cafe(s).Which I love the most? Pancious! love their earl grey milk tea.","tripadvisor_monas_1":"On a recent business trip i stayed at the hotel Pullman attached to the mall. that was very convenient as I had some down time and needed something close. The mall is new and pleasant to shop and eat in. It has a large range of shops to look through at decent prices. It also has places for eating and...More  ","tripadvisor_monas_2":"It is my favorite place all over Jakarta. one thing that I love the most is the park! been there soooo many times and still coming back. The place is so good just to walk around the park, look over the koi and just sight seeing. They hold a fountain dance every night and it is just amazing","tripadvisor_monas_3":"I've to admitted that Central Park is a mall that care so much for its garden or park and the fish ponds, because all the parks in here are well maintained. Good to see those plants, grasses and flowers are being properly take care by the mall. And it's a dog friendly establishment too, which's good for dog lovers because...More  ","tripadvisor_monas_4":"I love this place. They have a small garden at the center and have many good restaurants and cafe(s).Which I love the most? Pancious! love their earl grey milk tea.","tripadvisor_monas_5":"Been there so many times, easier & cheaper access by Transjakarta. The outdoor architecture are amazing a few restaurants & multiple food courts are all in the same place. For someone who loves fish, fish pond located in the middle park might just be an option which is full of attractive big fishes, etc.","tripadvisor_monas_6":"the newest attraction in central park, eco skybridge that connecting central park mall and neo soho. the bridge lights in the night that so cool to take a photo.","tripadvisor_monas_7":"Pretty high end mall, in terms of the stores. Plenty of restaurants and cafes. There's a nice outdoor park and looks quite good during night time.","tripadvisor_monas_8":"I love this mall. Placed in West Jakarta, easy to reach by toll road. This mall typically for family, luxury mall with friendly atmosphere. And the best part of it is TRIBECA. Yes, it is a park beside the mall. With lights and attractive fountain this mall highly recommend for family. A lot of restaurants local and international, stores and...More  ","tripadvisor_monas_9":"Before going to airport, we stop by for refreshing and eat some dinner before we go back to Semarang.","tripadvisor_monas_10":"The place is nice for family shopping, many restaurants and cafe. The newest extension Soho not ready yet though.","tripadvisor_monas_11":"Located next to another shopping mall doesn't make this place less superior. With relatively new building, and attached with office tower, Central Park will always be crowded...read more ","tripadvisor_monas_12":"More than enough things to do in this mall. There are places to shop as well as various Asian cuisine. There is also a cinema. Prices are very low to moderate though there are more expensive options available.","tripadvisor_monas_13":"Located next to another shopping mall doesn't make this place less superior. With relatively new building, and attached with office tower, Central Park will always be crowded everyday. Shops, restaurants, cinema are there to provide your needs in one place. The outside area also have a good atmosphere if you want to enjoy a cup of coffee in the afternoon.","tripadvisor_monas_14":"Ever traveled in a group and always yourselves caught up between what to do amoungst the group? This place should be the solution for people who want to relax and take a stroll to ponder about the days happenings and also a good place for those who just don's want to think too much and just shop the stress away.","tripadvisor_monas_15":"Central Park is one of the mall which avoided by me. I don't really enjoy spending time in this mall because this mall is very crowded in most of the time.Beside of that the parking lot in this mall is very ridiculous because we need to pay 1 hour parking fee if we couldn't find any parking spot in...More  ","tripadvisor_monas_16":"I believe this mall targeting middle to upper class people. They have complete choices for things and restaurants . What i love most is their park. You can just sit there, relaxing, and see lot of pet dog walking around.","tripadvisor_monas_17":"this park is so cozy and sometimes have an event in center park. This place had so many food. u can buy it and sit at stone bench. They have fishpond too.","tripadvisor_monas_18":"The mall good for shopping, eat, movies, hangout, but for packing is very full weekend , recommended is come with family and friends.....","tripadvisor_monas_19":"This mall is situated near major crossroads. Set up on high ground. Security personnel direct and manage vehicles coming in and leaving. Orderly and friendly service.Inside the mall spacious and brightly lighted shops or every kind are located. Staff are courteous and helpful. No touting is seen.However the approach roads to this mall is not too good. Jam...More  ","tripadvisor_monas_20":"one stop shopping mall with a nice concept - there is a park called \"tribeca\" in the middle of mall, and its not just a small park, its huge! nice for refreshing and shopping too. there is a great book store nicely managed called gramedia, different with other gramedia in all Indonesia outlet, better to visit.","tripadvisor_monas_21":"Wonderfully designed shopping area. Lots of greenery and a big koi pond. Numerous cafe and restaurants nearby.","tripadvisor_monas_22":"This mall is quite complete. You can find anything here, restaurant, barbershop, supermarket, bookstore, cinema and else. This is perfect for family or with friends to just take a...read more ","tripadvisor_monas_23":"This mall is quite complete. You can find anything here, restaurant, barbershop, supermarket, bookstore, cinema and else. This is perfect for family or with friends to just take a look around or spending your free time. But there's one problem with the parking area, it's kinda hard to find because sometimes it's too packed. But overall it's good.","tripadvisor_monas_24":"This is one of the best mall to visit. It has a hidden oasis park next to the mall which is nice to walk around if you need a break from shopping. The place is well maintain and has a lot of shops to offer. It's cooler to walk around the park before sunset.","tripadvisor_monas_25":"Nice place to visit every thing here is clean , and looks high secured shopping center ! Planning to visit it one more with family :)Enjoy guys","tripadvisor_monas_26":"As it was my first time in Jakarta I wanted to make sure I visit as many places as possible. We decided to take a bus as we wanted the bus experience too.Central Park shopping centre being one of them. It is SO big, you won't miss it. I must say it was extremely clean probably one of reasons...More  ","tripadvisor_monas_27":"I love the interior which is nice and not confusing. It somehow doesn't make me feel tired when walking around the mall, unlike some of other big malls in Jakarta. I really really love the park. It is not common to have a big park for you to stroll around WITH your pet in this kind of mall. When it's...More  ","tripadvisor_monas_28":"Very complex and nice! Many foodsssss and crowded. Need to widen the parking space, its hard to find one. Strategic location and nice to hang out in.","tripadvisor_monas_29":"central park is one of the best shopping mall in between West and Central of Jakarta.you can find a lot of shop from middle to high end such as : H&M, Topshop, Topman, Zara, Lacoste, Hugo Boss, TUMI, Charles & Keith, Lasenza, Victoria Secret, etc.there's also Carrefour, Ace Hardware, CGV cinema, and lots of food choices from Asian,...More  ","tripadvisor_monas_30":"Sarinah being known for one stop centre in Jakarta. Central location and easy to reach and provide you with many choice from all kind of fashion, restaurant, taylor and money changer as well as ATM facilitate you better. In certain period they have special offer price for branded item","tripadvisor_monas_31":"This mall has everything from low to mid-range stores. a couple branded stores near the main lobby and Pullman hotel right next to it. has everything you would expect in a mall. cinema, foodcourt, restaurants, etc.","tripadvisor_monas_32":"It's a very good mall, with many shopping options, variety of clothing stores, toys, many restaurants, clean bathrooms, helpful staff and well kept. Has a Sogo store, huge gramedia (book store), and a Carrefour. It's right next to another mall (Taman angrek), it's connected to the Pullman Hotel.","tripadvisor_monas_33":"Really nice new mall. Easy to navigate around, all the big (and small) brands and a lovely garden area to sit outside. Quite enjoyed wandering around this mall.","tripadvisor_monas_34":"Really nice new mall. Easy to navigate around, all the big (and small) brands and a lovely garden area to sit outside. Quite enjoyed wandering around this mall.","tripadvisor_monas_35":"Central Park mall is next to Taman Anggrek, so it is just a five minute walk away. At Central Park is the Pullman Hotel so if you are staying at the hotel you can just go downstairs to all the shops, restaurants and cafes.There are a few upmarket stores here so if you are looking for something different then...More  ","tripadvisor_monas_36":"As far as I know this place is the first dog-friendly mall in Jakarta. So congratulation for you the pet lover, you could bring your dog here! Inside the mall you have to carry them but outside the mall you can let walk freely.","tripadvisor_monas_37":"One of the mall with best layout design at jakarta - central park is one of the mall which equipped with mostly high end stores. Clean and very cozy to stroll upon, ease to find toilets and friendly staff (which is a plus in Jakarta - trust me!)However CP tend to be VERY CROWDED at times, so keep this...More  ","tripadvisor_monas_38":"Central park is like my second home . Near to Tarumanegara university and Trisakti University . Also connected with Mediterania Garden apartment . Central park have a very big park in the centre of this mall.... So many interesting shop , delicious food ,cinema, great place for shopping and hang out with friends and family .","tripadvisor_monas_39":"The mall itself is very nice. Very wide selection of stores and restaurants. However i am not sure how a mall this big and luxurious could have its air conditioning system not working for about a week.","tripadvisor_monas_40":"This is the newest mall at West Jakarta, crowded place to go for family, good spot for meeting place or business meeting. They also have Pullman Hotel and also Apartement. They have plenty of choice of restaurant here.","tripadvisor_monas_41":"My wife and I have been to Indonesia many times, I visited Central Park Mall last year and this time we visited with 4 Indonesian friends. This mall is bigger than most and has more levels. You will need a map to check it all out. I was quite impressed with all the restaurants and the different types of foods/drinks...More  ","tripadvisor_monas_42":"Average shopping mall. Nothing much to shop. A couple of nice restaurant to dine. Also a handful of eateries and a supermarket in basement.","tripadvisor_monas_43":"This mall is good for family with young children.They have meet and great with mickey mouse and the last one i attend is frozen theme.. my daughter sooo excited..","tripadvisor_monas_44":"I visited Central Park while my friend attending a business meeting in APL Tower. What a huge mall but it was so quiet. Personally I hate place with crowded ambience. I like the...read more ","tripadvisor_monas_45":"I visited Central Park while my friend attending a business meeting in APL Tower. What a huge mall but it was so quiet. Personally I hate place with crowded ambience. I like the lift hahaha If the theres no security inside, probably I might continously use it tsktsk","tripadvisor_monas_46":"The mall is very large and nice decoration, also has many restaurants and shops. I went there in December and I saw the big Christmas tree too.","tripadvisor_monas_47":"for me this one is better than grand indonesia, the mall have many varaities in shops and brands, there is an outdoor place where you can find good restaurants to eat.","tripadvisor_monas_48":"A mall with nice park. They have an attraction at tribeca park sometimes on weekend. And the park is full of beatiful lighting during festive season","tripadvisor_monas_49":"Was ok...i liked it better than grand indonesia but still just a mall. Had some mid to high cost shops and was a great place for a meal.","tripadvisor_monas_50":"This mall is quite good with the park outside, there was some place for shopping, eat, play and watch movie. They always have new decoration every season, that's why I just like to go here. Anytime","tripadvisor_monas_51":"Living close by I'm visiting everyday twice at leas for coffee and lunch/dinner.Its a good mall compared to other Jakarta Malls but it has a serious problem. Noise pollution from loud music on weekends and especially on Sundays.Couple of days ago tried to have a lunch on a weekday at the newly built TGI Fridays sitting outside and...More  ","tripadvisor_monas_52":"Love it, many restaurants and cafe, and especially the park at the morning. The park is suitable to eat ice cream or drink coffee","tripadvisor_monas_53":"We have been to jakarta for a short trip where we planned for some good amount of shopping , When we asked locals of jakarta about the place where can we buy all the stuff , they suggested the central park mall . And we went there , where we found lot of branded stores inside the mall and a...More  ","tripadvisor_monas_54":"When I crossed the park indoor is very nice, lot of restaurant that making like europe area.And I saw some atraction in night time n sometime have music on the stage.","tripadvisor_monas_55":"This seemingly petite mall is embedded in between an Accor hotel, a university, and a busy road. Inside are stylish stores, each of them large and tall. To me, it feels more like...read more ","tripadvisor_monas_56":"This seemingly petite mall is embedded in between an Accor hotel, a university, and a busy road. Inside are stylish stores, each of them large and tall. To me, it feels more like Singapore rather than Jakarta. Compared to nearby Mall Taman Anggrek, Central Park seems empty, while in fact it is spacious and airy, especially the lower ground floor....More  ","tripadvisor_monas_57":"It is a high end mall with lots of shops and restaurants, including cafés. The mall also has outdoor garden & pond for you to enjoy just in case you are bored being inside. The mall also has fast food area in the ruko side that opens until around 1 am.","tripadvisor_monas_58":"my family love this mall coz it has a nice park and my kids love the fish pond.they also has funworld and big gramedia so it's great for kids.i often go there with my kids just for new experience.the only mall which has a big park.","tripadvisor_monas_59":"Although their mall design can make us like missing road, but they have many brands that only available in Indonesia and Singapore, like Stroberi, girlish souvenir shop like S&J, that same quality, but the price is cheaper than in Malaysia and KOI Cafe, cafe shop like Chatime with better taste. I also very like their Carrefour, huge but neat, price...More  ","tripadvisor_monas_60":"Located on west Jakarta, this mall has all things that a mall required to have in Jakarta ( restaurant, cafe, cinema, shops, etc.). One of the unique thing is that this mall had open space which is not Common in Jakarta malls.","tripadvisor_monas_61":"Excellent experience at this mall and very convenient as we were staying at Pullman. Great choice of F&B outlets and shopping.","tripadvisor_monas_62":"While our stay in Jakarta, we were put up in the Pullman Jakarta Central Park. The Central Park mall is adjacent to that hotel. In fact the hotel members have a easy and direct access to the mall via a private hotel only entrance.There are your standard international huge mall regulars like Carrefour, Burger King, et al. However there...More  ","tripadvisor_monas_63":"Very elegant and special mall, so far its the best in Jakarta. Highly recommended...has good outdoor park with many restaurants","tripadvisor_monas_64":"Actually this is a good mall, should score 4 on rating. But i decided to score it 3 due to:1. the mall is very happening, always find function or event on the mall, BUT this also caused the more very crowded and hard to find parking.2. place for rest i found quite limited, even at cafe which for...More  ","tripadvisor_monas_65":"the environment like you visit a mall in Bali... very nice and the decor so cozy.... i always go to pizza birra and seat there have a bottle of nice cold beer there.:: perfectly getaway","tripadvisor_monas_66":"A massive mall, mid to high end and not for the average Indonesian. The plaza next to it, melts into this one, which makes altogether a massive mall. The department store has many...read more ","tripadvisor_monas_67":"A massive mall, mid to high end and not for the average Indonesian. The plaza next to it, melts into this one, which makes altogether a massive mall. The department store has many employees, who seem just to stand there and greets you on entering and every escalator. A bit overpowering. The Central Park mall has many quality restaurants on...More  ","tripadvisor_monas_68":"Good place to shop and excellent in Dinning , cause it has the Pennang Restaurant, I liked it very much , ... we ( my family and me ) had the meal of our life ... you remember your parents by dinning in this restaurant ...","tripadvisor_monas_69":"A great mall to enjoy and explore. It offers an enjoyable walk for any shopper's delight. It provide a total eye candy of store and boutiques so you better hold on to your wallets (or credit cards). However what I love was the outdoor dining and park the mall offers. You can ride a bike, scooter and just simply put...More  ","tripadvisor_monas_70":"Central park location very easy to find, very good mall in west jakarta area. Clean, big, green mall in one place. Many coffee shops, variant restaurants, shopping center, book store, music store, furniture store all in one place. When visit jakarta, must see place in west jakarta.","tripadvisor_monas_71":"A very good place to visit. This is one of the most favorite mall in jakarta. Offering green concept of having many parks with some decorations and attractions makes this mall even more interesting. You can find branded goods and some very fine restaurant in this particular mall.","tripadvisor_monas_72":"The mall is big but the layout is confusing, especially the indoor and the parking. Two buildings with very nice outdoor park in between with a lot of cozy restaurants. The outdoor park has huge and nice koi pond(s) with its big and well taken care koi fishes. The indoor is not so appealing though, again, the layout is my...More  ","tripadvisor_monas_73":"I am a business traveler and since 2 years I have been staying at Central Park Hotel Pullman regularly. I find the Central Park Mall is a decent shopping centre with all brands of boutiques and restaurants. Anggrek Mall is just less than 5 minutes walk which is adjuscent too and one could enjoy the ambiance of both the malls.","tripadvisor_monas_74":"I love to visit this Mall, a lot of food to try and the mall is located at the central of west jakarta.","tripadvisor_monas_75":"Central Park Mall has it all whether you want designer shops like Boss/Tommy/Gucci or more down to earth like Zara/Topman you will find it caters for everyone. An abundance of food outlets and even a cinema at amazing prices ! I loved my many visits here and even helped with free wifi throughout :)","tripadvisor_monas_76":"Our first time here we were excited because looking at friend's pics the mall has a beautiful garden.Parking lot, although it's very big but so confusing. We got space (finally) at P9. When we entered the mall, it's just like any other mall. It seems big from outside but apparently it's not. Very very crowded mall (came on Sunday...More  ","tripadvisor_monas_77":"The place was quite far away. I walked from Ciputra Mall to there. It would be better to take a bajal, the local three wheels vehicle there. The place was really huge with mostly...read more ","tripadvisor_monas_78":"The place was quite far away. I walked from Ciputra Mall to there. It would be better to take a bajal, the local three wheels vehicle there. The place was really huge with mostly the young and trendy. Only the rich can afford to shop here as you can find a lot of designer brands here.","tripadvisor_monas_79":"Today, I visited Central Park to meet someone in Starbucks. I parked my car at 9.30 a.m. in P7. The security doesn't bug when I enter the mall using customer's entrance. When I arrived in GF, a security said that I'm not allowed to enter the GF floor and I must enter inside. But he didn't direct me which way...More  ","tripadvisor_monas_80":"This a kinda new build Mall in Jakarta with new concept wide open area and place to relax for visitors who just want to take a walkOn Sunday usually there will be dogs meet upAnd if you like to take pictures try to come here at night they have cool and romantic place atmosphereA lot of variety...More  ","tripadvisor_monas_81":"It's one of the newly built mall in Jakarta and I have to say it's the best mall in Jakarta. It's big, offers many amenities such as luxury brands and also affordable brands, many place to eat, and they always have something going on on the weekends on their tribecca park (whether it's fashion shows, singing, or fireworks). The luxury...More  ","tripadvisor_monas_82":"Good place for visiting and shopping but sometimes this place is very crowded especially in Tribeca Park","tripadvisor_monas_83":"Jakarta is a big city with a lot of great malls and buildings, but less park. Central Park is one of a great huge mall, with almost any brand u can find it here, and a lot of foods and snacks in LG areas, and the park inside of the mall. I called it a bonus! ;) the park is...More  ","tripadvisor_monas_84":"Feel ok but nothing impressive in this also . Very formal one . Activities are very less indeed. Foods of different countries are not available. branded shops are not that much available .. Some what boring ..","tripadvisor_monas_85":"Fair and huge mall with a park area in the center of the mall. Ita a family mall.. U can walk round the park area. But honestly the parking area was very hard to catchup.. Ussualy i park from pullman area.. Its hard to find the parking slot in the mall basement..For family with baby they have mom and...More  ","tripadvisor_monas_86":"this is very nice mall and it is very huge mall.... they have cinema....they have many choices of nice restaurant, fast food and also many famous fashion brand.","tripadvisor_monas_87":"So this mall is located just in the middle of west Jakarta, very big and very crowded on the weekends. Hypermarket, convenience store, department store, foods, electronics, shoes, gym, whatever you need.Convenience to have a chat with your friends, shopping, or just a walk in the afternoon. The park in located on the ground floor is also very interesting...More  ","tripadvisor_monas_88":"This is not a very big shopping mall compared to the many big ones in this city. However, it offers the right mix of tenants and includes many eateries that cater to people with...read more ","tripadvisor_monas_89":"Very luxurious and elegan. One of my favourite mall in Jakarta. I really enjoy spending time with my friends here. A lot of good tenants. Very recommended for those people who want to spend time together with friends!","tripadvisor_monas_90":"The mall provided with a bench, and for some reason the bench always full. I wonder if they 've tired walk on this big mall. Escalator always packed! On otherhand this mall have an outdoor cafe or restaurant concept, but parking area can be tricky. Looking taxi at closed time also can be troublesome.","tripadvisor_monas_91":"I love unrban escaping, and this one near to apartment i live.It's really nice, park just outstanding and location in west jakarta.You can find anything here, and if you travelling to bandung, they also have shuttle bus to Bandung.Located near Mall Taman Anggrek, so you can enjoy both of mall in just walking distance.If you seeking...More  ","tripadvisor_monas_92":"This mall is quite famous in its district and very lively all the time because it's close to many famous University. There's a lot of things to see inside the mall such as movie theater, home appliances store, restaurants, fitness center, computer store, bookstore, ktv, etc.And there's Tribeca Park which located in the middle of the mall. Tribeca also...More  ","tripadvisor_monas_93":"This is not a very big shopping mall compared to the many big ones in this city. However, it offers the right mix of tenants and includes many eateries that cater to people with different taste. Sogo Departmental Store and Carrefour Hypermarket are two anchor stores that saw many families shopping for their daily necessities. This mall also caters to...More  ","tripadvisor_monas_94":"Why?Starting with the parking space that is crazy confusing like a maze!!! Lack of easy access from parking space to the mall area. I suggest you use the valet, public transportation, or walk instead.....Lack of baby changing/breasteeding room... Which is quite troublesome for us with baby and toddlers.... not recommended if you want to have a good time...More  ","tripadvisor_monas_95":"this mall have a park called tribeca park in the middle of the mall. It's an outdoor park where every 7PM, they'll perform 10 minutes musical water show on the fountain in the park.","tripadvisor_monas_96":"When you visit Jakarta you will notice the locals spend a lot of time in malls because of the extreme heat outside. Central Park is the biggest and most interesting mall in Jakarta. Lots to shop and eat. Also a lot of events and attractions. You can literally spend an entire day in this mall. Lots of local spots but...More  ","tripadvisor_monas_97":"Bringing a new concept of a new Mall-Shopping Center in Jakarta..Connected with a prestigious hotel chain and in the middle of a great development on West Jakarta..Yes, these development is trying to give the people of one stop live solution..Back to the Mall..The position of TriBeCa Park has already a plus point of the present of...More  ","tripadvisor_monas_98":"It's big enough to spend a day. Directory was clear and you can plan to go to which shops. Many eateries to choose from. The best point was that the ZEN O massage parlour on the LG provided quite good massage at extremely reasonable price. It's sad that we visited this mall on the day before we departed from Jakarta...More  ","tripadvisor_monas_99":"Quite new shopping mall in Jakarta. Big place. Well equipped. Have many branded store. Nice cinema. Many restaurants selection. Can be 1 stop shopping mall when have a short time...read more ","tripadvisor_monas_100":"I am a regular visitor to this mall, i love this mall sooo muc. Complete package! Good gym, a lots varities of restaurant, good cinema, lots good shop and their park such an amazing gateway! U can enjoy ur snack while u watch their water attention at night!","tripadvisor_monas_101":"Quite new shopping mall in Jakarta. Big place. Well equipped. Have many branded store. Nice cinema. Many restaurants selection. Can be 1 stop shopping mall when have a short time in Jakarta because they have almost everything you need","tripadvisor_monas_102":"This mall is part of PODOMORO CITY. Placed right in center of West Jakarta. Amazing, the building is so huge. Separated to 3 areas: Mall, Park, and Tribeca. You can find almost everything in here. Even if you want to bring your pets, you can bring it here. Yet, it's nearby the Hotel and Residences. Awesome!","tripadvisor_monas_103":"Its not just a shopping mall, but also office building and hotel in Central Park. Have a beautiful garden that you can enjoy after shopping.","tripadvisor_monas_104":"You should take your children to this mall to shopping, relaxing, n eating. Every saturday n sunday, you can feed the koi in tribeca park. N starting 7 pm till 9 pm there is fountain show every 1 hour n every day. You can find any food you like, japanese, western, malaysian, indonesian, chinesse food, vegetarian food, etc. You can...More  ","tripadvisor_monas_105":"Comfortable mall to shop with lots of restaurants and cafe. The mall was nicely decorated with Easter eggs when we were there. There is a little park outside of the mall.The big supermarket could only be reached through the basement parking which I thought was a bit odd. A good place to kill a few hours and get away...More  ","tripadvisor_monas_106":"I like this mall. It was spacious and nicely designed. There was big supermarket, department store, many shops and restaurants here. It also have a very nice garden/outdoor area and it gives relaxing vibe. Nice place to hang out with friends and family. However its quite difficult to park there. Parking area was confusing and inconvinient","tripadvisor_monas_107":"Central Park (CP) is a great place to start your travelling adventure in Jakarta. Definitely one of, if not, the best malls I have ever been in. There are a huge range of restaurants to choose from, fast food stalls, bars and cafes, some chains and some private. There is an abundance of shops to meander through, whether you are...More  ","tripadvisor_monas_108":"Lot's and lot's of restaurants, there are varies of international cuisines to choose from, American, Chinese, Indonesian, Italian, Japanese all you can find in there. The shopping mall also includes few banks, money exchange, telephone services, hair salon, and travel agency offices in the ground floor, very convenient for travelers. Not to say those world class fashion brands to match...More  ","tripadvisor_monas_109":"Woooww...This is the most beautiful mall in Jakarta. I like to come n shopping hre n the garden also look nice, i will never forget this mall...","tripadvisor_monas_110":"This is a stylish market. I got a great haircut and shave in the basement floor and there is plenty of food options. Large shops for originals.","tripadvisor_monas_111":"Love this garden very much, it's tranquility. You should go there definitely. Even if you're getting bored, you will always have a relaxation moment in this place.","tripadvisor_monas_112":"Central Park mall is huge and a good place to spend your whole day here. Comparing with other malls in Jakarta, Central Park Mall is a newer shopping icon. There's a hotel right next to the mall, Pullman hotel and a outdoor park with some restaurants & cafe around. It's nice for those who like to have their meals or...More  ","tripadvisor_monas_113":"Central Park Mall offers a complete shopping Experience by Anchor and Flagship International Super Brands which creates Central Park Mall as the Jakarta's New Shopping Icon.Central Park is the premier lifestyle destination for shopping and entertainment. They have SOGO Department Store, ZARA, Furla, Tommy Hilfiger, Armani Jeans, Hugo Boss, Boss Orange, Mango, Aigner, Marks & Spencer, Topshop Topman, Blitzmegaplex...More  ","tripadvisor_monas_114":"This mall is a nice and big mall, with an outdoor park. There are many stores to visit, as well as restaurants. The location is far.... loads of traffic to overcome to get there. When we get there, its massive but fully packed. People walking everywhere in all directions. At least they have an information center, so you can decide...More  ","tripadvisor_monas_115":"This is a stylish market. I got a great haircut and shave in the basement floor and there is plenty of food options. Large shops for originals.","tripadvisor_monas_116":"We went to this mall during the Eid Mubarak festive lately. Thinking to bring my family (husband, 2 kids) here as I thought many places were off at public holidays. Ended up we moved to other places as the mall was so packed that every major attractions (major shops, restaurants, food courts, play land) were full of people! Overall the...More  ","tripadvisor_monas_117":"lots of good shops here, this is classy mall, and worth a trip, good food choices, great brands and even some lesser known brands,really enjoyed this mall","tripadvisor_monas_118":"Every weekends, I usually go to this mall. My home is near behind the mall. I like visiting the mall due to its concept is family entertainment. My daughter can play at open park with her roller blade, or feeding fishes in certain time, meanwhile I can enjoy me time in coffee shop or resto. I admit that the mall...More  ","tripadvisor_monas_119":"Shopping & Entertainment.....Its a place to spend time with family & friends...many retail shops,park, dining and more....","tripadvisor_monas_120":"It is a great mall, but over time, I think it is gaining beyond too much people. The number doubles during the weekend. There are high-end brand shops such as Zara, Starbucks, etc., but the amount of people hampers your experience.Definitely not recommended to visit during weekends.","tripadvisor_monas_121":"It's a great upper-middle scale mall.Huge mall with a lot of shops, but hardly any high end shops.Great food selection, especially in the B1.A lot of varieties of shops, from...read more ","tripadvisor_monas_122":"It's a great upper-middle scale mall.Huge mall with a lot of shops, but hardly any high end shops.Great food selection, especially in the B1.A lot of varieties of shops, from clothing, to accessories, to beauty salons.Great gathering/meeting place just outside of the mall as well.A few cafes and a great open square to meet up...More  ","tripadvisor_monas_123":"The central park is not as big as i imagine it, but it has a nice atmosphere to it. In fact sometime you have live music played.","tripadvisor_monas_124":"I stayed in hotel Pullman Central Park Jakarta and the mall was just steps from hotel entrance with a lot of good stores and some great restaurant that match everyone taste and budget a long with Hyper market , Sogo , M&S and etc.you can find anything you want there , not too much crowed so its good to...More  "}