{"tripadvisor_monas_0":"It's placed center of ministrial house's area, in front of ministrial PPN/bappenas. It's so nice and quite place, surrounded by high and lush trees. The place is deserted on...read more ","tripadvisor_monas_1":"A great place to just chill out, in a small green park in the middle of the city.Not a huge amount to do, but there are normally great street food vendors with tasty local food. I think on Sundays they have a music event, where you can come along and play violin.A good place for couples who just...More  ","tripadvisor_monas_2":"If you're a tourist, there is not much reason to visit here. It is just a small park near couple of Embassy, Government Office and some Indonesia's Elite house.","tripadvisor_monas_3":"While you in Menteng Area (Centre Jakarta) one evening take a walk to this Park. People jogging, young people play music, there are some creative attractions by young people.Nice to see.Enjoy Indonesia !","tripadvisor_monas_4":"It's placed center of ministrial house's area, in front of ministrial PPN/bappenas. It's so nice and quite place, surrounded by high and lush trees. The place is deserted on weekdays but crowded on weekend or holidays. There are stones seats, pigeons, entertainment like fortune-teller, yoga attraction, and also equiped with wifi facility.You must tried to visit this nice place.","tripadvisor_monas_5":"Unless you live nearby, there is no reason to visit. If you're there enjoy the shade of a big tree. There's paved paths, some grass and benches. Surrounded by roads it's not very unique.","tripadvisor_monas_6":"Taman Suropati is one of Jakarta's cleanest park and located in the heart of the city. It is a great place to exercise (jog, taichi, etc), find street food, or as simple as hanging out with friends.I personally like to visit Taman Suropati at night because it is lively and breezy. One of the street food stalls, named Nasi...More  ","tripadvisor_monas_7":"Really nice with lots of shade! On Sunday's there are violin lessons, you can just enrol your children and get them to learn with the teachers on different ages and levels. Great initiative!!!","tripadvisor_monas_8":"I came to this park with a couple of friends, doing nothing. Just sitting there, lurking around what does people do there. Lol. You can jog or doing some yoga, or bring your lunch box here. At the evening some street singer is around.","tripadvisor_monas_9":"I visited this park with my kids and only spend couple minutes. because not many thing to see and to explore. some garbage and food stall made it worst","tripadvisor_monas_10":"a lot of activities (Outdoor) you can do here... with kids you can play run, catch and throw. and enjoying stay in park. its quite hot so mineral water all the time is a must, but there is a lot of street food around anyway. fun on sunday a lot of art and community come and do a lot activities.,...More  ","tripadvisor_monas_11":"This lovely park comes alive on Sundays with artists and musicians hanging out playing and drawing. This area has a number of parks, a very pleasant walking afternoon in central...read more ","tripadvisor_monas_12":"One of my favourite park in jakartaI frequently come here to doing yoga exercise every sunday morning with komunitas yoga gembira","tripadvisor_monas_13":"This lovely park comes alive on Sundays with artists and musicians hanging out playing and drawing. This area has a number of parks, a very pleasant walking afternoon in central Jakarta.","tripadvisor_monas_14":"Went to see some classical street musicians play there and had a really fun time. The park itself is tiny and not much to see but it has some shade for a hot day and some people hanging out...","tripadvisor_monas_15":"This park is located in the center of the city's prestigious expensive area of Menteng as the resident of the US Ambassador in Indonesia just around the corner and the resident of the former President of Indonesia, Megawati, is just at the other block of the area. This is an old park where you can refresh and relax with your...More  ","tripadvisor_monas_16":"You can relax at taman suropati, you can take your child come here, because they have a little playground. you can heard people sing, you can just relax with friends, family","tripadvisor_monas_17":"Suropati Garden is located near the heart of Jakarta City. This place is a perfect place for you to enjoy green Jakarta.You can have a picnic or just enjoying the sight of pigeons fly around this place.Don't forget to bring your mineral water and don't litter!","tripadvisor_monas_18":"Probably this would have been the last place to visit in jakarta, should i have not been taken by my friends (with children). There are many attractions, architectonic representations of traditional villas from all parts of indonesia, a lake with islands representing the country, an aquapark, air and navy museums and many more things to entertain people. One of the...More  ","tripadvisor_monas_19":"Taman Suropati is a mini-park in central Jakarta with many leafy trees providing shade in the Jakarta heat.The park is divided into two halves with water fountains in each half.The thing I love the most about the park is the atmosphere on a Sunday afternoon.You find clusters of musicians aged from about 5 years to adults all...More  ","tripadvisor_monas_20":"Taman Suropati or Suropati Park is always be one of my favorite place to get fresh air and inspiration, green scenery, dove bird feeding also enjoy some art statues in the park.","tripadvisor_monas_21":"One of nice park located in the middle of Jakarta, the park is clean and surrounding area has a lot of tree. Nice place to do jogging in the noon or early morning. Don't buy food from street vendor, the price not worth. If you lucky, you can find live music around the park. Visit Taman Menteng too near this...More  ","tripadvisor_monas_22":"This Suropati Garden is one of the Good Garden in Jakarta. This garden has very good location with good arrangement of the park. Mostly at Sunday Morning so many people come...read more ","tripadvisor_monas_23":"this is very good place for running and other public activity, in the heart of jakarta and also near to may home.. perfect!!","tripadvisor_monas_24":"This Suropati Garden is one of the Good Garden in Jakarta. This garden has very good location with good arrangement of the park. Mostly at Sunday Morning so many people come here to do excercise of to enjoy the freshness of the air, because at this park they have so many tree and also big tree. Near to the One...More  ","tripadvisor_monas_25":"Nice park for people in Jakarta especially who stay around Menteng area. We can do yoga, jogging, gather with friends and family. I saw photography expo by Green Peace with live band performed.","tripadvisor_monas_26":"This nice city park is a breath of fresh air amidst the hustle and bustle of Jakarta. Located in the posh neighborghood of Menteng, Taman Suropati is a great spot to sit back, relax and enjoy the greenery.","tripadvisor_monas_27":"Lovely place, the atmosfer is very kindness. Fresh air with many trees, everybody can hangout, picnic, or just relax with this park.","tripadvisor_monas_28":"Went there when they just launched free internet. Was impressed with it's speed. Nice surrounding and rather safe for Jakarta's standard. If you live in the surrounding neighborhood of Menteng, it's worth going here","tripadvisor_monas_29":"A small city park encircled by busy roads in the center of Jakarta. Definitely worth visiting, if you stay in Jakarta for some time& Best time to visit is Sunday morning. At 7f.v. starts Yoga class for everyone, at about 8 a.m. rock bands start entertaining, at about 10 a.m. kids musical school perform - violin concerts, classical music concerts....More  ","tripadvisor_monas_30":"Located in Central of Jakarta, we can walk there, bike, or only sit under the tree to have relax enjoying coffee from the biker coffee seller. sometimes there is a group of violin doing practice. Cheap enjoyable place to enjoy yourself.","tripadvisor_monas_31":"Clean with great history behind the park. There are many street food around this park. also many musicians play their music here","tripadvisor_monas_32":"We've been to many parks, this one is premiere. We were planning to have a picnic but apparently stepping grass is not allowed in here.A bit dissapointed, especially my son who loves to run on the grass, and more over they have birds houses so there are many birds flew and play along the park (and the grass). We...More  ","tripadvisor_monas_33":"One of a good and popular public places in Jakarta. Early in the morning many people are using it as jogging track as well as in the afternoon. Yet at early evening the place is...read more ","tripadvisor_monas_34":"This is a nice little park to chill and relax admist the busy hustling city. Well maintained and clean and exudes a charm that is unique to itself.","tripadvisor_monas_35":"Nice walks can be done from taman Menteng via Barack obama's old school to taman Suropati and then on to the lily pond in Jl. lembang","tripadvisor_monas_36":"One of a good and popular public places in Jakarta. Early in the morning many people are using it as jogging track as well as in the afternoon. Yet at early evening the place is still visited by many people to sit and chat. Weekends are the most interesting time when we can see many activities going on including e.g...More  ","tripadvisor_monas_37":"This place located in Menteng area, a lot of sport activities took place here in the morning and you can feel the fresh air.","tripadvisor_monas_38":"The place have some place to meet up. And in this place we can found some food truck for dinner with your friends.","tripadvisor_monas_39":"Whenever I need to relieve my stress, I'll hit my bike and enjoy this place. So green, so full of activity. This kind of place is what the government need to create more. A green area which accommodate people to do physical activity, to meet and interact.More park, less mall please.","tripadvisor_monas_40":"Go to the centre of the park & you'll find lots of friendly dogs and owners.. Came here on a Sunday around 4pm to take some photos of my dogs at the park. They won't allow the dogs on the grass but fine on the paths. Most locals are OK & love looking at all the different types of dogs...More  ","tripadvisor_monas_41":"fresh air in central jakarta, so happy to bring the family here. kids can enjoy n fun. need more on taking care of the trash.","tripadvisor_monas_42":"A small park with a circumference of about 400m, located within central Jakarta. Its about 2K run from the Bundaran Jakarta (The main circle in Jakarta bounded by Hotel Pullman, Kempinski and Grand Hyatt. Its a nice shaded park, but really much too small to enjoy very much of - a good pit stop but not a destination.","tripadvisor_monas_43":"Always a pleasure. Musicians out practising. Museum Proklamasi nearby worth a visit. If you can go to Taman Proklamator to see patung of Bung Soekarno dan Hatta","tripadvisor_monas_44":"Location in the middle of Central Jakarta. There's a lot of interesting activities in here. From Yoga, violin music, gathering society, and many others. I think this is the best...read more ","tripadvisor_monas_45":"Location in the middle of Central Jakarta. There's a lot of interesting activities in here. From Yoga, violin music, gathering society, and many others. I think this is the best park in Jakarta. Hopefully there's a many park will be built by government in Jakarta","tripadvisor_monas_46":"I went to visit this park today together with my wife. It was refreshing to spend a couple of hours in this well maintained park with trees all around. Good place for an evening walk/run. Ideal for the kids to play around too in this surprisingly serene park in the middle of the busy city.","tripadvisor_monas_47":"Located in the heart of Jakarta, this is one of (very few) park that is properly build by the goverment. very well mintained, very clean, they have a police station right on the side of the park, just across the official governor's house, so the security here is consider good. On sunday morning til afternoon, Taman Suropati is always packed,...More  ","tripadvisor_monas_48":"my family love this park. i've visited this park fourtimes. the park provides green scenery, trees, fountain pond, bricks statues, and sometimes we can see people practising taekwondo, and also concert rehearsel. many kids like to fly bubble, playing ball and riding bikes.","tripadvisor_monas_49":"a good palce to morning walk, but at night there are alot food corner in this place. one of couple to hangout at night in Jakarta","tripadvisor_monas_50":"Taman Suropati is kind of A rare park at the main of the city. Sometimes it can be a meeting point or an alternative place to do some yoga or just a trail to do the morning/evening run.","tripadvisor_monas_51":"This park is used by many as a jogging park, band rehearsal and many more. Try coming here on a weekend morning and its a jogging track, but try coming here on a Saturday night and its full of artsy people playing music and painting, love it","tripadvisor_monas_52":"Taman Suropati is a landmark park in Jakarta. It is usually bustling in the evenings (especially on weekends) and is a great place to go relax with your friends. There are food vendors, musicians and it becomes quite lively during the evening. On mornings you can also see people do yoga there and jogging. It is one of the best...More  ","tripadvisor_monas_53":"ok...imagine your self to find a well protected and manage park, in the middle surrounds by heavy protected houses and building of Indonesia, america and other country in jakarta.this is not a typical park, since you will be surround by the house of the Vice President of Indonesia, the office of National Planning Board of Indonesia, The Governor of...More  ","tripadvisor_monas_54":"Feel the vibe of tranquility here. Since there are not so many noise can disturb ur day, this is a good place for you. Grab a seat, hear the sound of violin and flute on weekends since there will be an orchestra there and see the iguanas too!But there still some rubbishes you can spot. Grab them and love...More  ","tripadvisor_monas_55":"I love Taman Suropati very much.So many big trees that make the air fresh, there are many bird too in this park. We can jogging or walking or just sitting over there. Some...read more ","tripadvisor_monas_56":"Great place for the family, jogging and food reflexology.The underside is people smoke here. The Indonesian government must ban smoking in public areas.","tripadvisor_monas_57":"I love Taman Suropati very much.So many big trees that make the air fresh, there are many bird too in this park. We can jogging or walking or just sitting over there. Some people doing picnic here and bringing some food n 'tikar'. We come here for free, there is no fee to come here. Some people use this...More  ","tripadvisor_monas_58":"If you like jogging a long the park in the morning you can have a lot of companioon here.at the afternoon there are music activities too. If your time is right you can watch the free mini concert in this park.","tripadvisor_monas_59":"many local use this park as sport avenue and at night for leisure walk, good park for spend only 5 until 10 minutes, if you tight on time management andlooking for better attraction, i suggest you cross out this one","tripadvisor_monas_60":"This is not actually a tourist park but always good to pass by in the Menteng area on Jl. Diponegoro. This is mainly to decorate the main road and giving a green feeling.","tripadvisor_monas_61":"To me, Taman Suropati is the only place that i can call a park in Jakarta.Whenever i am longing for an open area surrounded by trees where i can sit on the grass i would go to this park. Granted it is not a park that is up to compete with parks overseas, Taman Suropati is still the best...More  ","tripadvisor_monas_62":"This place is one of the few parks that exist in Jakarta. Located in Central Jakarta, this place is surrounded by elite region. Although, the visitors are not the people who live around, but most of them from another region. The park itself is actually not really big, but a well spent to take fresh breathe in polluted Jakarta. Please...More  ","tripadvisor_monas_63":"I had never thought Jakarta would be nicer before i met this park. It is so lovely. I could breathe fresh air here. I like the its environment too.It is good place for you to get run around or just to get relax. I hope Jakarta will have more parks like Taman Suropati. After getting relax there, you can visit...More  ","tripadvisor_monas_64":"This beautiful, clean park is a great place to hang out with friends on a Saturday night, or take a free yoga class on Sunday mornings at 7 a.m. There are snacks for sale and musicians in the evenings. A great place to go to see Jakartans enjoying their city somewhere other than an air conditioned shopping mall. Highly recommended!","tripadvisor_monas_65":"Taman Suropati is or family's favourite park in Jakarta. It only takes 15 minutes by car from our house to the park. There are many big trees so the park is very shady and fresh. There also some plants and flowers inside the park. There are pigeon's cage and the pigeons flying around and walking around the park. My daughter...More  ","tripadvisor_monas_66":"Morning and weekends is the best time to visit.Nice place to jogging.At weekends, if you lucky, you can see some communities (music, sport, ect) doing their performance.","tripadvisor_monas_67":"Morning and weekends is the best time to visit.Nice place to jogging.At weekends, if you lucky, you can see some communities (music, sport, ect) doing their performance.","tripadvisor_monas_68":"I love Taman Suropati, because it is located on the heart of Jakarta. It is easy to access, and you can easily to reach other interesting place nearby. Near to this park there is official house of Jakarta Governor.The park very live and active especially after office hour and holiday. You can see artist performed on the park. You...More  ","tripadvisor_monas_69":"I went to try jogging there but not quite impressive. It is a small park and there were smoker along the running way. So I would not turn back for jogging purpose but for relaxing maybe.","tripadvisor_monas_70":"Taman Suropati is located at Prime Resident Area Menteng. It is in front of US Ambassador resident and opposite of Vice President Palace. The Garden is small well managed, but not so much to see.","tripadvisor_monas_71":"taman suropati, is located in central jakarta. one of a good place to hang out and watching life music performance every saturday night.","tripadvisor_monas_72":"Not much to see/do here. It's a lounging spot for after work and on weekends. Always lots of motorbikes parked on the edges of the park. Sometimes there are food and snack vendors on site, just depends on the time. It's about a 10 minute walk to Pasar Surabaya from here.","tripadvisor_monas_73":"It's one of tne nicest park in Jakarta sorounding with big trees and various of flowers. People usually came here in the morning for jogging.","tripadvisor_monas_74":"Size wise it is more a garden than a park but it is interesting and worthwhile to visit on Sundays. Old trees protect you from the sun and heat, a colorful local crowd is presenting a different picture from the cliche and the most amazing thing are the groups of people who take violin lessons there, out in the open....More  ","tripadvisor_monas_75":"Taman Suropati is located in Menteng, not very far from any other attractions in Central Jakarta. It has very fresh air and becomes the best park, especially in Sunday morning. You can see a lot of people exercising and doing Yoga together (7am-8am), even you can join it. Sometimes you may find a group of young people play music (violin,...More  ","tripadvisor_monas_76":"This place used to be often used as favorite place for some people in Jakarta to relax, very crowded at Saturday night. So many big trees makes you comfortable here in the middle of tired and the incessant pollution in big cities such as Jakarta, such as Suropati Park being stabilised. Some time later, there was a live music orchestra...More  ","tripadvisor_monas_77":"This park was build during the Dutch colonial era. The atmosphere has been retained ever since, keeping its illustrious trees and pigeons to it.Located just around a kilo from...read more ","tripadvisor_monas_78":"a park in the center of Jakarta, well arranged right in front of US Ambassador Resident. Not much to see in the afternoon, just an ordinary park, with some water spring, statue and vegetation. But, different stories when you come here at Saturday night, lot of people hang around here. If you are lucky, you will see some group of...More  ","tripadvisor_monas_79":"This little fun spot is in the middle of the Menteng upper district of Jakarta. It is across from the Governors House and the Residence of the American Ambassador. It is small but fun as it displays both Indonesian People and Foreigner Residents or Visitors from all walks of life. Walk around, listen to the live music or just sit...More  ","tripadvisor_monas_80":"It is a very nice garden in the middle of menteng area. The place is clean, surrounded by trees and flowers and suitable for all ages. I love to go there with my family, just walking around or sitting down.","tripadvisor_monas_81":"This park was build during the Dutch colonial era. The atmosphere has been retained ever since, keeping its illustrious trees and pigeons to it.Located just around a kilo from Jakarta's \"Selamat Datang\" statue, it's truely one of the best natural getaway one can enjoy.It's easier to get here by public transportation, as the slots for parking are highly...More  ","tripadvisor_monas_82":"Burgemeester Bisschopplein it was once called, the park is part of Menteng's masterplan for garden suburb of old Batavia and is marketed for the European. Around this part there is plenty of colonial villas, one which is transformed into governor's resident and also modernist colonial church, the best are villas with art deco architecture (which you can notice from the...More  ","tripadvisor_monas_83":"Surrounding Air feel soo fresh!!!!!!!, a lot of trees around. People do activity sometrimes, singing, and also playing instruments. so awesome..... enjoy my lazy time with this place","tripadvisor_monas_84":"This is a splendid park in the leafy Menteng area of upmarket Jakarta. It attracts hordes of street vendors and youth on weekends causing gaiety and traffic jams. It has several interesting statues including one for ASEAN and one of Diponegro astride a horse on a traffic island nearby.It became more famous because of the Governors mansion there which...More  ","tripadvisor_monas_85":"Stumbled upon this park while walking the city one Saturday morning and loved it--one of the prettier places in all of Jakarta, filled with friendly people in a (relatively for Jakarta) clean, well-maintained, and SHADED park.","tripadvisor_monas_86":"Park in Suropati is good place for jogging or fellowshipping with some friends or family. Now it has a stone for foot therapy which is very good. Evening is the best time to visit. Try it!","tripadvisor_monas_87":"perfect place to run around the jogging track in the afternoon as long as clear sky and wonderful weather above the park","tripadvisor_monas_88":"Taman Suropati is probably not worth making a special trip for if you're travelling from more than 6 kilometres (or two hours) away, but it can be the focal point for a really...read more ","tripadvisor_monas_89":"Taman Suropati is probably not worth making a special trip for if you're travelling from more than 6 kilometres (or two hours) away, but it can be the focal point for a really pleasant two or three hour stroll (by Jakarta standards) around the historic area of Menteng. The park itself is green, quiet, well-maintained, and on Sunday afternoons Jakarta's...More  ","tripadvisor_monas_90":"There are not many parks worth visiting in jakarta. But this one is different.It is clean. Green. Safe. The surrounding areas are super elite, high security housing complex. So people without clear motives are not interested in coming here. (I.e. street vendors, beggars, ganks of students carrying weapons)The birds are mild and clean. Kids like to watch them....More  ","tripadvisor_monas_91":"Only if this park had its own parking space, I would've changed my review to 4-5.This park is one of the cleanest and best park around Jakarta to jog around.Some of the TV Stations do their news or interviews with public figure here.","tripadvisor_monas_92":"I jakarta city is quite rare for a pak but somehow here in Menteng area just 10 minutes drive from semanggi there is a quite good pak to do your activities sick as running and just sitting by. Many people come here on Sunday to do their run.To run here is quite safe side this location there is a...More  ","tripadvisor_monas_93":"most Jakartans would told you that the city is a complete concrete jungle, however its not true! just few miles of walking from HI to the neighborhood there this one beautiful relaxing park in the middle of nowhere you would just not imagine","tripadvisor_monas_94":"there is no area for parking your vehiclethere is no toilet or rest roomits only good for joggingthere is no area for parking your vehiclethere is no toilet or rest roomits only good for jogging","tripadvisor_monas_95":"This is a good park, good for walking or even just sit and see the surroundings. Many people come and enjoy this park..","tripadvisor_monas_96":"As there are not many green area in Jakarta, this little Dutch heritage park in the midst of most expensive area in Jakarta is a gems. It is public park with the best public park facilities in the city and most well maintained.","tripadvisor_monas_97":"A fairly broad and circular garden, and well organized. The clean air enable you to do jogging or stretching, or a simple walk can do.","tripadvisor_monas_98":"good place for exercise, either running or jogging. some people would come to do stuff, like art or photography. it's family friendly and the plants are nice.","tripadvisor_monas_99":"Good street food to eat. Different communitites/groups came in together. Saw an iguana lover group. There were some music classes going on too, mainly for violins & keyboards. Not...read more ","tripadvisor_monas_100":"Good street food to eat. Different communitites/groups came in together. Saw an iguana lover group. There were some music classes going on too, mainly for violins & keyboards. Not sure if that had been for free or not. The trees made it cool. Overall, a good place to hang out.","tripadvisor_monas_101":"Menteng is a posh area, where the houses are more like mansions, the streets are tree-lined, clean & quiet & the park is located here, just a stone's throw away from some embassies too.The park is really pretty, very well maintained & has an air of tranquility - hard to imagine that beyond the park is the hustle &...More  ","tripadvisor_monas_102":"We headed here for a bit of a getaway from the 'real' Jakarta and were pleasantly surprised by how relaxing it was. The park is clean and very well kept, frequented by different birds and surrounded on the outside by busy roads and street vendors selling usual Jakarta food fare. The park is not huge, but certainly lovely to have...More  ","tripadvisor_monas_103":"Even in concrete jungle of downtown of Jakarta, you still can find a hideous park. A good place for contemplation. Breathe the air, see the large trees and the birds. Pigeons and doves flocking around plaza. Enjoy the sound of music from teens rehearsing their violins skill. Take a walk and pay more attention to some art work inside the...More  ","tripadvisor_monas_104":"I guess this is the only park in Jakarta that you still can have a walk.","tripadvisor_monas_105":"I love the green of the park, take a sit at the center of the park, try to avoid the sound of the cars and motorbike that racing around it.On weekend, we can hear the park sings. Some musicians play music at the park, very beautiful and silencing the racing around it.","tripadvisor_monas_106":"its like a shelter from the hot jakarta weather, in the afternoon you can find local musician practicing classic n traditional music","tripadvisor_monas_107":"Taman Suropati is in the old money area on Menteng close to the Embassies, and the General's and Politician's mansions, making it one of the few areas in Jakarta that it is possible and pleasant to stroll around (there are pavements/sidewalks!) There are various things to see (the Jln lembang pond, the Cendana Clan's houses, mosques and churches etc). It...More  "}