{"tripadvisor_monas_0":"old town is a few buildings, I'm coming from Sweden are used to such old buildings, so for me it was nothing special","tripadvisor_monas_1":"old town is a few buildings, I'm coming from Sweden are used to such old buildings, so for me it was nothing special","tripadvisor_monas_2":"The people are no doubt helpful and rather friendly. However, the city is terribly polluted. Haze and smoke, not just from the vehicles but the people really smoke a lot! They don't really have separated area or room in restaurant where smoking is not allowed. They smoke even in air-conditioned restaurant. Some cab driver don't even have the courtesy to...More  ","tripadvisor_monas_3":"A complex of old buildings in one corner of Jakarta, an Indonesian state witness could struggle in the era of the struggle and the occupation of the Netherlands and BritonsNice location, but hot because it is near the waterfront jakartaNarrow and limited parking area.The road to the location is also usually jammedIt is advisable to use...More  ","tripadvisor_monas_4":"Jakarta had an Old Town by Holland (VOC) history before freedom, this town was a great building and planology. But it seems a lot of undycipline street seller. So we can found a messy taste here. But it become a must see destination if you go to Jakarta.","tripadvisor_monas_5":"Interesting place for you if you're visiting Jakarta. There are a lot of touristic spot in here, some museums, street arts, street food stalls, etc..","tripadvisor_monas_6":"We went here during holiday and this place was very crowded. Some of them were busy to take pictures. There was Street performance too.If you want to visit this place, we suggest you to use public transport because it was very hard to find a parking space.","tripadvisor_monas_7":"We visited old Jakarta today to visit the museum's and cafe Batavia, unfortunately both museum's were closed so we will be revisiting later in the week.We did go for a stroll and enjoyed the architecture and scenery and a ride in a tut tut.Cafe Batavia was nice but priceyLooking forward to seeing the museum's","tripadvisor_monas_8":"Nice trip .drive around in the coach.. come to get a good feel of local culture and people.also good place to taste local cuisine..went on a holiday so was a bit too much traffic!!","tripadvisor_monas_9":"Few buildings left in a small area, lots of street performers, lots of little museums, cleaner than other areas of Jakarta, traffic around area is a nightmare, toilets which are chargeable are disgusting, ok you can spend an hour here, take a few pictures of crumbling buildings, nothing has been done to attempt to restore anything. Sorry if I'm honest,...More  ","tripadvisor_monas_10":"Once known as Batavia when the Dutch ruled. This is a typical large city plaza in the European style with some grand buildings that have recently been restored. The atmosphere is spoiled by a proliferation of cheap and tacky junk stalls pushing mass produced rubbish products on tourists. The number of luridly painted bikes has also grown out of control...More  ","tripadvisor_monas_11":"If you know your history a bit then this is most definitely the place to visit. The old town / Batavia is the old VOC 'hq' in Dutch India (now Indonesia) and some old remains and...read more ","tripadvisor_monas_12":"Jakarta's Old Town is a small square of the city with a couple of old buildings from the Dutch colonial era. It is a reminder of Batavia from centuries past but there is not much left of it and what is there is not especially attractive. Compared to grand old towns elsewhere in the world this is a fairly limited...More  ","tripadvisor_monas_13":"If you know your history a bit then this is most definitely the place to visit. The old town / Batavia is the old VOC 'hq' in Dutch India (now Indonesia) and some old remains and buildings can still be seen.","tripadvisor_monas_14":"Visited this place for second time. Still encounter good experience. Visited the Fatahilla Museum. Building architecture is impressing tho the maintainance is not very well.But still worth of visit.There are some other museum around that is good e.g museum wayang and museum BI (Bank of Indonesia).Take time to explore this place if you visit jakarta.","tripadvisor_monas_15":"Really liked the vibes and the people...what a difference from other Asian counties...a must especially if visiting Jakarta on a weekend.","tripadvisor_monas_16":"Kota Tua - This place has been painstakingly renovated from shabby and abandon area to abundant place for walking and photographing. attractions are colorful bikes, ac cafe, musems are there. Few attractions only. Despite historical values, the Wayang Museum rather eerie. It may be due to the poorly lit and unpleasant atmosphere. parking is a challenge. Parked at BNI bank...More  ","tripadvisor_monas_17":"Such an enjoyable place on a Sunday- with loads of cafes and bars lining the square to visit. The architecture harkens back to the Dutch era, with verandas to enjoy coffee. Locals and tourists fill the square day and night.","tripadvisor_monas_18":"Here you can see the history of the old town.There are many old buildings made by the Dutch.Don't forget to drink a coffee at the Batavia barAcross the town Hal.","tripadvisor_monas_19":"I've been in Jakarta in this month. If you are a budget traveller or something like backpacker you can get easily and cheaper with public transport, you can go with commuter line train lead to Jakarta Kota station After you are arrived safely, go to exit door and turn left or ask to security where's Gedung Tua or Old Jakarta...More  ","tripadvisor_monas_20":"People in traditional and funky getup. Dutch architeture buildings, different kind of museum's , beg coffee house are few of the things describe this place. It worth a visit atleast. Just reach down to KOTA TUA railway station or use trans jakarta to KOTA TUA.","tripadvisor_monas_21":"i could feel the ambience of old jakarta in this spot. you can find several attraction, and \"cenayang\" who will tell everything we want to know about ourselves in the future. nice spot","tripadvisor_monas_22":"Excellent for people watching and see life go by. Well lit at night makes for interesting picture opportunities.","tripadvisor_monas_23":"Excellent for people watching and see life go by. Well lit at night makes for interesting picture opportunities.","tripadvisor_monas_24":"Just visiting here for a while . Take pictures and enjoy the panorama . You can also rent a bike for getting around there.Hope enjoy !","tripadvisor_monas_25":"It would be nice to spend an afternoon times together with my family members during weekend and then exploring the old town of Jakarta.Jakarta or Fatahilah or Batavia is beautiful city with many facing as representative of Indonesia's capital. We can enjoy the skycrapers in city centre or business district area, the panoramic of the Sunda Kelapa Port and...More  ","tripadvisor_monas_26":"People from developed cities ask sick and tired of going for a tour in yet another metropolitan city. What they need is to relax and indulge in history's natural setting and appreciate the architecture and culture of that time. In Jakarta's old town, you can get the feel of how the colonialist blended their lifestyles and architecture with the locals....More  ","tripadvisor_monas_27":"The old town is fashioned after the former conquerors of Indonesia - the Dutch. There are canals that shouldn't be there as they are filthy. I would skip Chinatown as it too is very crowded and dirty. The square is nice and I learned the area for student protests. The buildings are old and majestic.","tripadvisor_monas_28":"Jakarta has a distinctive colonial past, part of what remains can be viewed in the environs of Jakarta Old Town with small eateries and classical buildings near the water.","tripadvisor_monas_29":"Just spent an hour or so walking round taking some photos. Was quite a buzz there with people milling about. Some nice architecture and buildings, but didn't visit any of the museums. Yeh seemed alright","tripadvisor_monas_30":"this is where you can nostalgy about your past at jakarta, we call it betawi place,, very nice and sight seeing wothy","tripadvisor_monas_31":"Wasn't that good but it was okay 👍🏼 .. But if you enjoy looking at old buildings 😂 then this is the place you're looking for! I do not recommend people to go on weekends! it's super crowded!!","tripadvisor_monas_32":"This area of town exhibits both well maintained and interesting historical building &area AS WELL AS how well THAT can be done with proper attention and effort.A nice former city square kept clean and 99% street seller free, with colorful bike rentals and nice scenery.The square surrounded by interesting museums and the Famous Cafe Batavia, where one can...More  ","tripadvisor_monas_33":"This is basically a big square surrounded by some museums and cafes. It is nice to take a stroll around the square, get some pictures of Dutch colonial buildings, visit the museum...read more ","tripadvisor_monas_34":"Old town site of jakarta bring your old holland emperor memories, and if you visit jakarta be sure not to skip this kind of tourist area. The main visit is a governor kantor in dutch or office in english verse. You can see the activity of colonialism from holand era. it is very inspiring how the dutch first touch in...More  ","tripadvisor_monas_35":"This is basically a big square surrounded by some museums and cafes. It is nice to take a stroll around the square, get some pictures of Dutch colonial buildings, visit the museum (about 0.5 Euro entrance fee) and then enjoy a refreshing juice while watching the many tourists rent a bike and drive around the square. The square itself was...More  ","tripadvisor_monas_36":"Definitely enjoyed going around Kota Tua Jakarta. The place was jampacked with tourists and locals on a Sunday but we had a blast taking pictures of the mascots and people on their colorful costumes. The place is also near to museums and the popular tourist cafe - Cafe Batavia.","tripadvisor_monas_37":"Firstly be prepared for heat and sun burn. This place is for whatever reason hotter than other places in jkt. You can spend maximum two hours to visit the small square and museums nearby. There are also people who volunteer to show you the life of poor people living under bridge, alongside railway, and on the dirty water. However you...More  ","tripadvisor_monas_38":"ahh, another remarkable place that need to be paid attention. Seems like Indonesian need to be more appreciative to their heritage and keep this place clean and more welcoming to the tourists. Like restrooms and parking lots perhaps. The ambiance really took us back to many years ago and there's a restaurant that also embrace the same 'time'. A lovely...More  ","tripadvisor_monas_39":"Jakarta Old town or Kota Tua Jakarta in bahasa is the area of old cities in Jakarta. So many old buildings that most of all are build in Dutch era. More or less you will feel it is a part of Europe country when you walk down there. There are a lot of Cafe and restaurants around that area. For...More  ","tripadvisor_monas_40":"I went to the square in between Fatahillah Museum and Pos Indonesia building and immediately think of it as the 'Place Vendome' of Jakarta. They have some similarities : historic, spacious, and great for those who just want to walk, slowly ride a bicycle (which is available in bright colours for visitors to rent), feel the wind and get some...More  ","tripadvisor_monas_41":"Short visit yet fun and very nice. The okd town is full of person who wanted to spent their time with families or friends in the afternoon. It's quite clean and have a nice view. We ate at one of the restaurant there and it's a pleasant experience. Definitely would love to visit this place again just to get the...More  ","tripadvisor_monas_42":"Jakarta old town has many museum to be visited. Museum fatahillah is I love the most. Museum wayang (puppet museum) is a lil bit spooky I think.","tripadvisor_monas_43":"There's enough interesting things to see in this place, from the museum, to cafes, to the locals who throng the square. Filled with mostly young people who come here to hang out with their friends (and catch a Pokemon or two), it makes the place very vibrant. Street vendors abound with street food, and you can't miss the people in...More  ","tripadvisor_monas_44":"I visited with my husband and two children. Because it is always hot in Indonesia it's a good idea to rent a bicycle from the vendors in the square and then you can travel down to...read more ","tripadvisor_monas_45":"There is quite a lot to see here, plenty of museums, so allow time. It can get very crowded. The architecture is great and the Cafe Batavia is excellent for a meal - a little more expensive than other places in Jakarta.","tripadvisor_monas_46":"I visited with my husband and two children. Because it is always hot in Indonesia it's a good idea to rent a bicycle from the vendors in the square and then you can travel down to see the boats, lighthouse and houses without getting too tired and hot. It gives you the chance to see everything, stop to take photos...More  ","tripadvisor_monas_47":"in my opinion this place is very romantic, eventhough there are a lot of peoples but i still can feels this place as a romantic place.the old cafe with delicious food make this place perfect to go with your loved one.","tripadvisor_monas_48":"If you want to see what the locals eat and the way they spend their weekends you must visit the old town. The street is crowded with many street vendors. Got the opportunity to see the local puppet show. If you truly want to experience Indonesian culture this place is a must visit.","tripadvisor_monas_49":"I liked to go to there! If you go to Jakarta you should go there and cafe Batavia.ジャカルタ旧市街はもしジャカルタに行く機会があったら是非行ってみてください。又その中心部にあるCafe Batavia はお勧めです！","tripadvisor_monas_50":"I went here with local tour called Jakarta Good Guide. If you are foreigner then need not to worry. Jakarta Good Guide will guide and explain everything in English. They will show you the oldest part of Jakarta. The old town has been arranged as a part of tourist attraction so the condition is much better than years ago. But...More  ","tripadvisor_monas_51":"Best time visiting this area is morning or late afternoon. Lots of corners, old Dutch building, local faces and activities will interest you and make your camera busy.","tripadvisor_monas_52":"Old town surrounding used to be the centre of city during dutch before year 1945. It is very crowded and many street vendors within the square. They sell ordinary food such as boiled corn, boiled small crab, beverage, chicken noodle, cireng (fried tapioka starch), etc. I do not suggest you to buy for your snack because cleanliness is question, especially...More  ","tripadvisor_monas_53":"It is very cool to visit. You should check out the guys from GoodGuideJakarta. They definitevily know where to go.","tripadvisor_monas_54":"It was a nice change of pace from the usual hustle and bustle of the rest of Jakarta. I was there on a Wednesday, and did not find it crowded at all. I quite liked the museums, and really enjoyed my lunch at Batavia Cafe, overlooking the square. It was clean, there was no honking, it was good.","tripadvisor_monas_55":"Basically it's a large square surrounded by a Museum and the old Dutch government building. The square is full of tourists and kids riding round on brightly painted bicycles and...read more ","tripadvisor_monas_56":"Basically it's a large square surrounded by a Museum and the old Dutch government building. The square is full of tourists and kids riding round on brightly painted bicycles and wearing matching hats. Many of these people seemed not to have ridden a bicycle for a long time, so much of my time was spent dodging them as they were...More  ","tripadvisor_monas_57":"This place is nice to visit. The panorama is ok. Good for picture taking. Even the people here are most civilized. The security guards can also speak simple English, wow I like it. I will visit more later.","tripadvisor_monas_58":"Alway popular with locals riding bikes and just hanging out, the old Dutch square of Kota Tua is an interesting visit.Remember, its crowded, busy, and often smells quite ripe, but its a must see for a visit. Cafe Batavia on the corner provides a convenient refuge if it gets too much.","tripadvisor_monas_59":"If u want to see jakarta in the past u should come to this place. Before jakarta rebuilt, the picture of jakarta is just like this place.","tripadvisor_monas_60":"messy, decadent, dirty and still interesting to walk through.Plenty of street food and indonesian youngsters having a good time there.Walk thorugh batavia restaurant (or relax while drinking a fresh juice), a nice example of colonial architecture","tripadvisor_monas_61":"There are a lot of buildings from the Dutch colonial era left. These are nice to see but to get to them you have to go to the city which is a pain due to traffic. Apart from the Fatahillah square (old city hall square) it is not worth it. My advise would be to skip this city altogether.","tripadvisor_monas_62":"Jakarta's old town gives you a glimpse of a time when this city was still called Batavia and seen as the Pearl of Southeast Asia...completely the opposite of today's Jakarta...","tripadvisor_monas_63":"I have visited Jakarta many times and every time when I returned to old Jakarta the place was further in decline. However, now it was finally understood that this area is part of the history of the country and restoration has been undertaken. I have been told that the area is going to be a Unesco Heritage Site. This would...More  ","tripadvisor_monas_64":"This place is Jakarta's hidden gem. It is full with historical buildings and bridges.I think this place has tons of potential if the local authorities really pay attention to this place.This place has a museum and lots of street vendors. On the weekend, this place can be too crowded and the worst part is their on-street parking.I...More  ","tripadvisor_monas_65":"a great place for an afternoon with family. The area has huge potential for becoming the No1 Tourist spot for visitors and locals alike. It has charm, history and the right mix of old, local, indi-places and museums. Even the nearby train station is worth a visit.","tripadvisor_monas_66":"I first go to Kota tua when I was 13 and it's really peaceful in this place.. You can walk around and enjoy the feeling of walking back to the past.Now, I think you probably...read more ","tripadvisor_monas_67":"I first go to Kota tua when I was 13 and it's really peaceful in this place.. You can walk around and enjoy the feeling of walking back to the past.Now, I think you probably want to go in weekdays and avoid weekend because it will be full with a lot of people and street vendors.The good thing...More  ","tripadvisor_monas_68":"This is one of the top place you have to visit if you come to Jakarta. There will be an old fashioned sense of building architecture. There's some museums that you can visit. Each museums have a different types of collections.You can try traditional and old style of beverage or food from the seller around the street. There also...More  ","tripadvisor_monas_69":"I love this place because a lot of snack stall and also kindness people , this beautiful place to learn about historical jakarta and also tried a street snack of jakarta dont miss to try kerak telor","tripadvisor_monas_70":"Around this area, you can find old buildings from Dutch colonial time. The best time to start the visit is early in the morning, having breakfast in Pasar Glodok, strolling in the market to see people activity then we can walk to the Museum square and strolling in that area.","tripadvisor_monas_71":"Nice neighbourhood to spend some time. In no more than 2 hours you can see it all. The museums are nothing special but are so cheap that you can just walk in and see a bit. People are very kind everywhere though.","tripadvisor_monas_72":"Kota Pua is a tourist deatination that hasn't seen al possibilities. \"Old\" and \"beginning\" are the important drawing cards for future tourism. Traces of the first settlers and the Dutch are visual, but need more attention from the Jakarta Tourism Board as it is worthwhile to visit, has great stories as it is different from other places in Jakarta. Spend...More  ","tripadvisor_monas_73":"I learned a lot about the Jakarta - back when it was called Batavia - but that is because I hired a local guide to take me around to several of the sites in Old Town. For what all I saw and the distance I rode on the back of a scooter, it was well worth the money I spent.","tripadvisor_monas_74":"I ve been to this place many times. But I just got time to write a review. I visited this place with my boyfriend. It was happened that it was during Ramadhan and just 1 or 2 days prior to the Eid Al Fitr. Therefore Jakarta was so empty and pleasant. We used Transjakarta Busway from Tosari stop and went...More  ","tripadvisor_monas_75":"Nice city with historie to the Netherlands colonial times. Very busy city. Worth visiting are the museums and the old harbour with wooden cargo shipa still in use.Have a coffee at café Batavia.","tripadvisor_monas_76":"After 3 years here my husband finally went here. I went prior to him. I know lots of people love this--and it has potential...but..it's not what tourists are looking for. On the day my husband went it was a public holiday and (of course) all the buildings (Governors mansion) were closed.","tripadvisor_monas_77":"Jakarta Old town known as ''Old Batavia\". You can find Lots of people, Many shops around. good place for shopping","tripadvisor_monas_78":"Jakarta Old town known as ''Old Batavia\". You can find Lots of people, Many shops around. good place for shopping","tripadvisor_monas_79":"Amongst the few historical places in Jakarta, with a big square and old buildings around it, the place is probably amongst the very few things left in Jakarta which has something to look at, since its touristy its quite crowded and be ready for a lot of people.Lots of vendors selling things up and down the sides along with...More  ","tripadvisor_monas_80":"Sometimes we are confused about mean Jakarta old town. If its mean Glodok and the business area then It will good only for shopping. (If you like to buy non imported tax electronics like camera, DVD, etc. illegal market). But it could be mean also Kota which have a museum and old train station and good spot for nightlife. Whatever...More  ","tripadvisor_monas_81":"Jakarta is my hometown. But is so sad. This place is not clean to much garbage. Don not forget to bring your own mineral water from your home/hotel, too many local vendors are scammer! 600cc mineral water for 10 thousand rupiahs ! What a terrible price! There is a good and reasonable price restoran \"Mega Rasa\" near Wayang Museum. If...More  ","tripadvisor_monas_82":"We were visiting here at saturday night. And that was wrong time. Too much people, walking is really annoying. Area is also quite small, not much to see. Really hard to get proper taxi ( Bluebird etc.) when you leave. If you stay at near, it could be worth of visit at daytime. Otherwise you should go somewhere else.","tripadvisor_monas_83":"in my last trip to this old town, I forgot to bring umbrella and caps, the sun makes my sweat fall and my clothes wet! Bring your tumblr to save your money","tripadvisor_monas_84":"Enjoying Jakarta Old Town after Eid Al Fitr Festive and lots of visitors here, love the atmosphere but it was soo unfortunate that most people still put their leftover anywhere.","tripadvisor_monas_85":"This area can be visited if you have the special needs and requirement which are available in the old town area only. This having some cheap shopping and foods. Some of the wholesale stores are also located around Old town.","tripadvisor_monas_86":"We didn't rent a bike because it was raining during our visit. We saw lots of locals and lots of school kids in the area and snapped some original photos during our visit. Enjoyed lunch at a local antique café and had our fist cup of Java while there.","tripadvisor_monas_87":"History of Jakarta is reflected through the attractions, museums and buildings. Only after visiting this area anybody can say they have been in Jakarta.","tripadvisor_monas_88":"In the midst of Malls in jakarta, The Old town provides a nice public recreational area. Main attraction is the Main square, fatahillah square, and Surrounded by buildings from...read more ","tripadvisor_monas_89":"In the midst of Malls in jakarta, The Old town provides a nice public recreational area. Main attraction is the Main square, fatahillah square, and Surrounded by buildings from dutch colonial period which most of it turned to serve as a museum. Notable museums are Fatahillah museum (a former batavia town house), ceramic museum, wayang museum, mandiri museum, and central...More  ","tripadvisor_monas_90":"Nice area to stroll for a couple of hours to get away from the crazy, traffic clogged hustle and bustle of modern Jakarta. A few nice museums, cafes, heritage buildings. The area could use a good sprucing up to make it more tourist friendly - but hey ... this is Indonesia right!Was impressed by the young students all over...More  ","tripadvisor_monas_91":"if you have a few hours you want to kill, this is a nice place to wander. People come here to relax and it is a different side to this otherwise busy city. Do step into the museums, although there is plenty to do just hanging out in the open public areas.","tripadvisor_monas_92":"for tourist who's like photography and old town, this is the best place to go in Jakarta. you can go here by public transportation like busway transjakarta and heading to the stasiun kota terminal. or you can go by angkot. but I dont know exactly what number for the angkot. if I'm not mistaken should be number 08. or you...More  ","tripadvisor_monas_93":"We stayed one night in Jakarta and we went to the old part of the city. We saw some nice buildings from the past. But to be honest: it does not have to offer much. We like history. Within a hour you can see everything. I heard there is a markey on the weekend so maybe that makes it worth...More  ","tripadvisor_monas_94":"Can not really enjoy it since it was almost crowded every weekend. Too many street vendors. Too many street performers. Too many people blocking the view. Too few strict rules.Come here only on weekday, if I may suggest.","tripadvisor_monas_95":"Traditional Indonesian building and the food was pretty good. Good museum nearby. It is a good place to learn history of Indonesia.","tripadvisor_monas_96":"Fine if you are an obsessive history buff, but the dutch and colonial buildings are in disrepair and located next to a canal that looks as bad as it smells... The square is fine and good for a \"people watch\" and a visit to Cafe Batavia is pleasant...","tripadvisor_monas_97":"Walk about around this area you can find all type of street food. It also quite safe around this area.","tripadvisor_monas_98":"This square / place is the place where everything happens. Lots of people! Happy atmosphere. Gorgeous Batavia Cafe","tripadvisor_monas_99":"If you’re keen to see colonial buildings, rent a bicycle from Taman Fatahillah (around 20,000Rp/hr) and pedal the 1.5km to Sunda Kelapa, Jakarta’s historical port, and the...read more ","tripadvisor_monas_100":"If you’re keen to see colonial buildings, rent a bicycle from Taman Fatahillah (around 20,000Rp/hr) and pedal the 1.5km to Sunda Kelapa, Jakarta’s historical port, and the original reason why the city was an international trade hub. Stroll among the rows of traditional Bugis Phinisi Schooner ships anchored on the dock and peruse the stalls of the busy fish market,...More  ","tripadvisor_monas_101":"Going to Jakarta Kota Tua will give us the impression of colonial period of Jakarta. It is straightforward to reach there, take the public transport Transjakarta (fondly known as \"busway\" by the locals), and take corridor 1 bus to \"Kota Tua\". The busway costs only Rp. 3.500. Kota Tua is a must visit place in Jakarta.","tripadvisor_monas_102":"It's a good place to be visited for the people who love to know culture and history. Number of museums are located in this place. Some attraction shows by local people here. You also can rent an old style bike to go around the area.","tripadvisor_monas_103":"The old town or the Kota Tua is the best that a visitor to Jakarta could experience. The old town gives you a window into Jakarta's colonial past and makes you appreciate the progress that the city has made in urban planning. The old town is accessible by public transport and is full of people. This place has to be...More  ","tripadvisor_monas_104":"One of my favorite place in Jakarta is its old town complex. It's located just a minute from central Jakarta. There are several old buildings which has been witnessing the growth of this never sleep city.It can be reached by local train (KRL Commuter Line) directing to Jakarta Kota station. From there you can walk to the Fatahilah Museum...More  ","tripadvisor_monas_105":"Jakarta's Old Town has been around for centuries. It's now full of alleys and side streets. You can wander around, it's worth taking an hour or so to go back in time. Jakarta floods regularly. It it is flooded, it is a good place to stay away from unless you have urgent business.","tripadvisor_monas_106":"The Old city of Jakarta is a must visit site. It has a true reflection of colonial past with its old buildings and nice squares. I truly loved the place and during a stay in Jakarta, it should not be missed if you love history or historical sites. The squares and old buildings remind you of Europe.","tripadvisor_monas_107":"I grow up here. Easy to access. Trafficly bad. Never changes. You can have good food, good trip to old buildings and market in the entire area by walk or by bike. Vegetables and meats at Glodok and Petak Sembilan Market are so fresh that made it hardly to be matched in other areas of the city. You may find...More  ","tripadvisor_monas_108":"A Lot Of Old Building, it can be another way to enjoy the other side of Jakarta. You can visit Museum Fatahillah, Museum Bank Indonesia, Stasiun Kota Tua. Overall i hope goverment can keep the old building.","tripadvisor_monas_109":"We did a tour of Old Jakarta with a private guide (Mr Bram) and it was his local knowledge and experience that made the day. We started at 09.30 looking at the old port, and then took a taxi boat ride amongst the classic Indonesian wooden cargo vessels. We then walked through a neighbouring village of 5000 people where our...More  ","tripadvisor_monas_110":"Good place to explore, but too bad still too many trashes everywhere and stinky air from water polutions closed by this place. Government should do something for this place.","tripadvisor_monas_111":"Good place to explore, but too bad still too many trashes everywhere and stinky air from water polutions closed by this place. Government should do something for this place.","tripadvisor_monas_112":"It's a place to visit just to get an idea of what the place used to be like. Lots of museums It was too hot to linger so we took refuge in a cool cafe.","tripadvisor_monas_113":"Visiting the old town feels like visiting a place from an earlier time, at least some parts of it. There is Cafe Batavia, in an old Dutch style which is brilliant in terms of design and overall feel. The place comes alive in the evening and is also good from some street shopping.","tripadvisor_monas_114":"I visited to my in-laws family when i visited Kota Tua. An amazing place, the old city of Jakarta having lots of fun for children & for couples so many foodies option to go with. We visited around evening & it was perfect time to visit as per climatic condition as afternoon is bit hot with high humidity.","tripadvisor_monas_115":"This should be one the highlights of a visit to Jakarta but nothing has been done to make this more attractive. I do not understand why nothing is done to preserve and maintain these buildings. What a terrible waste.","tripadvisor_monas_116":"We combined a walk around the main square with a visit for lunch to the Cafe Batavia, visits to a few of the several nearby museums, a walk along the nearby main canal, and a walk to the old port. It was an enjoyable way to spend a few hours on another hot day, with a number of distractions, including...More  ","tripadvisor_monas_117":"I really loved old town because it will give chance to learn about history. Jakarta old town is a great place not only to learn but see it by yourself. Sunda Kelapa is also a good place to see and take some picture as it was the old harbor of Jakarta.","tripadvisor_monas_118":"Nothing much to see. always full of students having field trip or something. The square is big but in summer, it's SUPER HOT and no place to get shade. There are some people wearing costumes that you pay to take their photos with. I wonder how they manage with that unbearable heat. If you have a day in Jakarta, and...More  ","tripadvisor_monas_119":"good placevery historical site for jakarta, they called Batavia when Dutch occupied this cityyou can find many museum here like museum fatahilah, museum wayang etcyou also can find many handycraft you can buyand if you lucky you can find soto mie seller its have a good taste for snack time :)","tripadvisor_monas_120":"Probably the best thing to do in Jakarta is to get lost around the streets of old town. Once you arrive to the bustle and hustle it is very easy to get out and see the real deal just a few roads down.","tripadvisor_monas_121":"Not much left of Old Jakarta, but what is there is worth seeing and many of the old Colonial buildings are being restored. Most of it can be done in half a day. Start early to...read more ","tripadvisor_monas_122":"Old town is most beautiful place in jakarta, have to visit. I was there on saturday, lot of celebrations, music, etc. People were really nice","tripadvisor_monas_123":"I took a Holland America cruise (Volendam) and it stopped at Tanjung Priok for the day. If to arrive on a cruise ship and want to see Jakarta book a tour, don't try it on your own. The road to Jakarta from Tanjung Priok (early in the morning) was one big parking lot. It too us almost 2 hours to...More  ","tripadvisor_monas_124":"Not much left of Old Jakarta, but what is there is worth seeing and many of the old Colonial buildings are being restored. Most of it can be done in half a day. Start early to avoid the worst of the traffic and heat.","tripadvisor_monas_125":"If you want to find old part of Jakarta, you should come here.Here a lot of buildings that being build since hundred years ago in Dutch colonized.Here have some museum that for free. But if you need to pay, it's still very cheap.But be careful with your belongings.","tripadvisor_monas_126":"Jakarta is a very chaotic city and lacks in charm to other Asian cities like Bangkok, Singapore or KL. The old city is ok for an evening stroll. A very nice bar/restaurant/jazz club in the middle of the square but forget about the two museums , they are very basic for my taste. What for me is the highlight of...More  ","tripadvisor_monas_127":"Very nice and historical place, many moseum and old bulding in this area. Very beautiful place for take pict on your cameras. Many attractions here! Bike rent all ready here for around old city to pasar ikan.","tripadvisor_monas_128":"So many people come to this place to spend their weekend, so best time to see them are on weekend. If you rather like to see the museums, better go there on weekdays. No Monday museum there, so find another spot to go on that day. I personally recommend you to go to the Pelabuhan.","tripadvisor_monas_129":"This has great potential but really rough now. It is basically an empty square with little to do and see around it. I had a beer in a nearby bar and it was pretty unmemorable. I heard that the city is planning to put some big investment into the area to make it a nicer place. I hope so because...More  ","tripadvisor_monas_130":"Stinks and dirty river, lot of trash if you go around but it gives you idea about the old Batavia. Must see in Jakarta","tripadvisor_monas_131":"The old city is a tourism jakarta to commemorate past downtown Jakarta . The old town comprises several spots of tourist sites namely Bank Mandiri museum , the Museum of Bank Indonesia , Beos Railway Station , Old buildings and other places of business are advised to bring an umbrella because many tourist activities are outdoors.","tripadvisor_monas_132":"Nice place if you want to see the old Jakarta. Every buildings were very nicely built by the dutch architecture. However, do not come on Monday. As usual, all museums are closed...read more ","tripadvisor_monas_133":"For those who is history - archaeology - heritage architecture geeks, this place is a jewel in north Jakarta. Very easy to reach this place. You can come by bus, train, or other public transportation. It has many heritage building from 16/17 until 19 M and several modern building around. For those who just want to chill and relax this...More  ","tripadvisor_monas_134":"Nice place if you want to see the old Jakarta. Every buildings were very nicely built by the dutch architecture. However, do not come on Monday. As usual, all museums are closed on Monday.","tripadvisor_monas_135":"This place have a huge potential but so many to doThat's could be a real nice place for tourists in the future","tripadvisor_monas_136":"I visited Jakarta Old Town on sunday and it is very crowded. I visited the museum (Museum Fatahillah if I am not mistaken), it was interesting but the information was not informative enough.But overall I love the buildings, they are all old and beautiful.","tripadvisor_monas_137":"It's some area which is many attraction in there. Some with many people that act just like statue, some rental bicycle and many seller of traditional food. Building was under some renovation, while the other are not in good condition.","tripadvisor_monas_138":"It's a little flavor of Jakarta's colonial past. The Batavia Cafe is a nice place to look out over the square. There's also a great coffee shop Nusantara. They sell beans from all over the country. My new favorite drink is a ginger latte.","tripadvisor_monas_139":"Having just read Peter Fitzsimmons excellent \"Batavia\" I was anxious to see the colonial heart of Jakarta (much more recent than o,d Batavia of course). It was a fascinating bit of old Dutch influence in the beautiful and now vibrant modern city.","tripadvisor_monas_140":"It really was a quick trip - quaint square area surrounded by museums, colored bikes with matching sun hats waiting to be rented, and an array of children ready to record interviewing you in English for their school assignment. I always think it's worth visiting recommended places when in town but keep your expectations in check.","tripadvisor_monas_141":"Centre piece is Fatahillah Square, which is surrounded by the various Dutch colonial buildings which have now been turned into museums and restaurants. Sadly, a number of buildings just off the square have been left to decay over the years.There are side streets running off the square with people selling various knick knacks as well as some pretty cool...More  ","tripadvisor_monas_142":"I took the time to spend a day in I took the time to spend a day in Jakarta's old downtown. Fortunately for me it was with some photography friends who I had just met and we made a good day of it. Also it was a Chinese holiday and there was a nice procession with lots of activities and...More  ","tripadvisor_monas_143":"Kota tua is worth visiting for the dutch colonial buildings but a couple of hours is more than enough. There are a few museums and restaurants. Bules can expect to be endlessly...read more ","tripadvisor_monas_144":"Kota tua is worth visiting for the dutch colonial buildings but a couple of hours is more than enough. There are a few museums and restaurants. Bules can expect to be endlessly badgered by school kids and teenagers wanting to practice their English!","tripadvisor_monas_145":"Lots of museums and street vendors in old heart of Jakarta. The puppet museum is especially cool. Worth the trip.","tripadvisor_monas_146":"I grew up in Kemayoran during the Dutch colonial days, when life was at leisure and little traffice circa 1948 to 1957. I used to wander the streets of Jakarta with my younger brother Ray, we had many numerous adventures on a daily basis, what a childhood we had, close to Jakarta Old Town. It is just not the same...More  ","tripadvisor_monas_147":"Kota Tua, is a nice place to go for a short stroll into history when the Dutch colonies were still present in Indonesia. There are a few museums there as well as some restaurants incl. Restaurant Batavia. A busy place with lots of activity.","tripadvisor_monas_148":"The old town is really old. Everything is in ruins. The town and the building owners do not care about these buildings.But I think, this is not important for the town and for the local people, because they selling here their food and articles as in other part of the city, except in South Jakarta between the luxory malls...More  ","tripadvisor_monas_149":"Located in North Jakarta, you can go there by train, Trans Jakarta bus or your personal car.old town is a place to see old buildings that ruined and abandoned, usually people go there for pre-wedding photos and seeing museums (wayang, bank Indonesia, maritime, fine art & ceramic, Jakarta history, etc), post office that still operated.You can enjoy around...More  ","tripadvisor_monas_150":"It's good need more care specially for Caffè and restaurants nice to visit that place it's take you to the past","tripadvisor_monas_151":"Very interesting and nice place to visit, there are so many things to learn by looking and studying the area.","tripadvisor_monas_152":"My image of Old Jakarta is still of a not-so-safe, slum part of Jakarta, and a crowded not-so-classy, shopping area. But this has changed a lot in the past few years. It is now clean, relatively safe, nice places to hang out, renovated museums and public areas, with hopes that it will bring back romantic notions of historical Batavia. Public...More  ","tripadvisor_monas_153":"This place reeks of history - It is tightly bound to Australia's - James Cook and William Bligh walked its streets - Buildings and Churches are many hundreds years old - The original harbour in Batavia is still evident where the Bugis sail ships are at anchor - Its all starting to look good now after years of neglect","tripadvisor_monas_154":"As Jakartans and history lover, I come here many times, sometimes a solo traveler, sometimes with my husband, sometimes with my children and my family. I like the old buildings...read more ","tripadvisor_monas_155":"As it is named ,this area represents Jakarta as the old town. For you who are into the historical architectures and landmarks, this place can be the best option. Most buildings were built during the Dutch colonialism so that the Dutch architectures still remain. There are some places of interest that you can visit in this area like the Fine...More  ","tripadvisor_monas_156":"As Jakartans and history lover, I come here many times, sometimes a solo traveler, sometimes with my husband, sometimes with my children and my family. I like the old buildings here. There are Fatahillah Museum, Puppet Museum, Art Museum, Kota Railway Station, and banks.","tripadvisor_monas_157":"If you love (colonial) history, Jakarta's Old Town is a must visit! Surrounding the main square, are many old Dutch colonial buildings. The buildings weren't in a great condition, but interesting to see nonetheless. There were many cute places around to have food and a drink. You can also rent bikes and explore the Old Town by bike!","tripadvisor_monas_158":"As a Jakartan, I can tell you that I am boring to visit Jakarta Old Town when I don't have much time but want to go a picnic. But, Jakarta Old Town is one of my favorite place to go in Jakarta. I always enjoy the architecture of the old building around and imagine what kind of life happened in...More  ","tripadvisor_monas_159":"I went here with my friends last week and it has a great ambience. At night you could enjoy the festivity there,lots of food,and attractions. It is free. There are museums around like Museum of Bank of Indonesia, museum fatahillah. You should take a look for those two museums,entrance fee each is 5000 rupiah. You should try kerak telor,it is...More  ","tripadvisor_monas_160":"I was excited to go to Old Town, we went on a Sunday and it was so crowded. There was not much to learn about and felt more like a tourist trap than a historical landmark.","tripadvisor_monas_161":"Quite interesting place to see and meet local people especially in the afternoon/early evening. Many food stalls right on the street that sell Indonesioan food that looks interesting but hygene is not the thing you should look at here.The main square is in good shape and you may see local performances and people doing their workout.Be careful as...More  ","tripadvisor_monas_162":"Walk across the old town, feel the colonial era scenery.This place is a great place to take pictures and knowing more about Jakarta history.","tripadvisor_monas_163":"If you wanna learn the history of Jakarta long time a go then you should come here. You can rent a bike (with the rider) and get the whole complete story from him. The area was so old fashioned, yet it brings back the memories from hundreds years ago.","tripadvisor_monas_164":"My friends and I visited Kota Tua on a weekday and there were quite a lot of people.There were some singers and clowns, and also people dressing up as ghosts (Indonesian traditional ghosts) at night.","tripadvisor_monas_165":"Located nearby chinatown/glodok area, this is paradise for photography enthusiast. Quite dirty but an interesting spot to visit. The city government is trying hard to rebuild and...read more ","tripadvisor_monas_166":"this place is so crowded!!!!!!!!!!! even cant take a good picture in it.too dirty, smelly, just no.i dont like it herei will never visit here again.","tripadvisor_monas_167":"Located nearby chinatown/glodok area, this is paradise for photography enthusiast. Quite dirty but an interesting spot to visit. The city government is trying hard to rebuild and revive this. Years from now, probably this would be a favourite spot for locals and tourist","tripadvisor_monas_168":"Jakarta old town is soaked in history from the Dutch, Japanese, English, Portuguese and a couple of others! No wonder the elders can speak all these languages. ...they went through being ruled by them all and came through the other side! Take a bike ride around the old square!","tripadvisor_monas_169":"If you have 1-2 days for Jakarta, then this is the landmark known as must visit places. There are 5 museums and a lot of hundreds years of buildings n bridges around this area. This is the best place to know about Jakarta history. Photographers may need longer time to compose your pictures as there are tons of people and...More  ","tripadvisor_monas_170":"If you're in Jakarta, definitely make time to visit the old town. This was the most interesting part of the city, the best architecture, culture, street food, and people watching.","tripadvisor_monas_171":"Spent 2-3 hours wandering around looking at squalor and abandoned buildings next to high end hotels and boutiques, the street stalls are amazing and the locals were friendly it was a great way to spend a overcast morning, just try and ignore the smell!!!","tripadvisor_monas_172":"Well.. this site is one of the authentic place in Jakarta. We can see many old building in this area. The heritage building from Netherlands Government a long time ago while they having occupation at Jakarta, Indonesia.In this area you can also see a lot of hotspot. Like cafe, restaurant, museum, public park, hotels, and this area ussualy used...More  ","tripadvisor_monas_173":"Old jakarta is one of Indonesia's most wasted asserts. Its hard to even imagine the series of rules and regulations and lack of management planning that have led to this wanton waste of world heritage.The old town is or should I say could be a charming area or world heritage class colonial era buildings, if ut wasn't for:-The...More  ","tripadvisor_monas_174":"Nice place, very crowded and cars driving all the time. I would recommend not spending more then one day in Jakarta.","tripadvisor_monas_175":"A driving and walking trip through the Old Town brings back a mixture of memories of Penang, Singapore in the 70s and KL in the 80s. Parts have been refurbished really well and look pleasant and clean, while other parts remain virtually untouched and run-down. It is close to the historic railway station and is surrounded by busy roads, so...More  ","tripadvisor_monas_176":"I visited back in 2013 and was not impressed, as I wrote in my first review. My most recent visit was in November of 2015. After having been trapped on the island of Lombok during...read more ","tripadvisor_monas_177":"a time capsule on display for all the world to behold. A truly great experience for all. VERY well preserved.","tripadvisor_monas_178":"I visited back in 2013 and was not impressed, as I wrote in my first review. My most recent visit was in November of 2015. After having been trapped on the island of Lombok during a volcanic eruption, and taking a boat to Bali and then managing to catch a flight to Jakarta before leaving Indonesia for Macau, I had...More  ","tripadvisor_monas_179":"We went there about 12:00 am an it was very crowded and hot . Some folkloric ceremony at the square and some handicrafts in the street .","tripadvisor_monas_180":"The old town is interesting because it reminds of and partly remains what it was. There apparently is a plan to renovate and restore to what it actually looked in better times. Like the buildings, the canal is badly in need of a clean up, but still the town has a charm all its own.","tripadvisor_monas_181":"They old town is a nice place but there are so many buildings that need to be renovated. It is a shame how the historic heart of Jakarta is slowly decaying. Unfortunately there is garbage everywhere.","tripadvisor_monas_182":"Central plaza peopled by colorful characters...for evening hanging out surrounded by abandoned & restored colonial buildings","tripadvisor_monas_183":"Kota Tua (Old Batavia) boasts a set of fine colonial buildings surrounding a traditional European central square. They need some touch-up, but if you go on a weekend day you'll have fun looking at the buskers doing human statues--a metal man, a bride, some macabre skull people. The best was the man sitting on air. I still can't figure out...More  ","tripadvisor_monas_184":"Kota Tua (\"Old Town\") is coming to life, with a UNESCO heritage listing likely. This is the heart of the old Batavia, as the Dutch colonialists called Jakarta. Part of Kota Tua is the Taman Fatahillah, housing the Jakarta History Museum. It's a fascinating area. Watch for the cannon in front of the Museum. The cannon is said to be...More  ","tripadvisor_monas_185":"The square with the colonial buildings around is very nice including the museums around. once you move a bit far from the center you hit lots of trash and polluted river.","tripadvisor_monas_186":"Go to jakarta old town (kota tua) to see many museums, including museum bank indonesia. Went here alone and watched wayang show. Took pics with men who acted like a statue, if you want to get a pic, don't forget to give em money","tripadvisor_monas_187":"I was expecting much more from this place... Nothing particular a dirty area with no historical interest","tripadvisor_monas_188":"Gives good idea about history of indonesia in Colonial periode. Busy but clean and representative. Worthwhile to visit.","tripadvisor_monas_189":"Maybe because rainy day but not worth leaving the car when in neighbourhood. And sure not worth especially going there. Too many downgraded buildings. Too much traffic.","tripadvisor_monas_190":"We stayed away from the busier business districts, and chose to wander the neighborhoods instead. We were immediately welcomed by extremely friendly people excited to practice their English, and a variety of yummy food vendors. I was a little saddened by the amount of trash that was polluting the local \"river\", but I'm thinking sewage is an issue that is...More  ","tripadvisor_monas_191":"I was expecting much more from this place... Nothing particular a dirty area with no historical interest","tripadvisor_monas_192":"I visited this place with my wife and daughter and we stayed for the longest 5 minutes of our lives. This place could have been very beautiful if regulated. People are a swarm here it's like going in the middle of the slums.","tripadvisor_monas_193":"If you want to learn about Indonesia's history during the colonial times, you can visit this old town....officially called Kota Tua....or Old Batavia. There's even a cafe named after it, Batavia Cafe. It's filled with costumed street performers who will pose for you for a few thousand rupiahs (which is actually loose change). There are several museums around the area...More  ","tripadvisor_monas_194":"Jakarta is one of the busiest cities in Indonesia ,and with a huge population you can imagine the traffic . The traffic reminded me of the horns people use on some of the Indian roads to bypass others. In that sense the traffic in Jakarta is still better controlled. The old town has some of the Dutch colonies still prevalent...More  ","tripadvisor_monas_195":"I love to see the surrounding of the city that still look as though it was way back in the early eighty.the old building,the road,the daily activity money changing hands business going round and the peoples not even a single complaint came out from their mouth.they live their life what being given by almighty god.i love these simple life and...More  ","tripadvisor_monas_196":"Since the Pemprov DKI try to manage and fix this old town place,now its very crowded place compare several years ago.You can go this place by day or night(more crowded by youngsters during night) but i suggest you go in the afternoon because you may visit several museums (like museum BI,museum wayang etc) in surrounding area and its only open...More  ","tripadvisor_monas_197":"Some of the buildings are now mudeum. The wayan museum, the national bank museum, the old townhouse, all are interesting","tripadvisor_monas_198":"The main square was super crowded when we went for a walk on friday night, you could hardly move through the thousands of locals heading towatds the Batavia cafe. Not sure if...read more ","tripadvisor_monas_199":"The main square was super crowded when we went for a walk on friday night, you could hardly move through the thousands of locals heading towatds the Batavia cafe. Not sure if there was any special event or happening but locals were sitting everywhere at the square having tea etc..very nice. During the day loads of students and kids asked...More  ","tripadvisor_monas_200":"people recommend to go here at night because of different atmosphere & more happening activities happened at night. which i agree. but we went during the day but it wasn't bad at all. u can rent a bike (colorful bike) but i think it's a little bit pricey & to me its a touristy trap. u can just walk around...More  ","tripadvisor_monas_201":"When I went first time on July 2014 it's look horrible lots of rubbish everywhere but now it's look more beautiful cozz it's clean and tidy and the old houses since war until now still there without any roof","tripadvisor_monas_202":"The Dutch settled Jakarta here and it has many interesting old buildings as well as museums. On Mondays, it's deserted as the museums are closed. Plenty of students and tourists other days to activate the plaza. When you're there be sure and eat in Cafe Batavia - its a must visit in an historic building - charm plus!","tripadvisor_monas_203":"I'd highly recommend it for visitors to Jakarta. There are beautiful old buildings (some in better shape than the others) and interesting museums to see. Museum wise, please manage your expectations and do not apply international standards. Indonesia still have a lot to catch up in this regard.Nowadays, you can also rent a bike to tour the Old Town.","tripadvisor_monas_204":"Old town Jakarta was established from early time of Dutch occupation. The buildings are colonial style architecture. There is also water canal like in Amsterdam but no boat ride. Part of the area is under renovation.","tripadvisor_monas_205":"like people space @ old version Jakarta, you can see old jakarta building, some of them been there since Holland build it, many people use costumes so you can take photos with them, you also can rent sepeda onthel - old type of bicycle, my sons like to ride it.there's also some cafe just to hang out, talk, or...More  ","tripadvisor_monas_206":"When you are in Jakarta, Kota - the old town is a must see. Currently partially under renovation, this area harbors some magnificent buildings and musea from the colonial era. Spacious, neat and lots of sightseeings.","tripadvisor_monas_207":"The history dating back to the Dutch East India company times the contrast of the surrounding areas to downtown Jakarta is stark. People live simply here alongside significant historical artefacts. Get out and walk around as there is much to see.","tripadvisor_monas_208":"I really hoped seeing something of old Jakarta. But what I did was actually not so worthy of time. Few old buildings of Dutch colonial times. They are upon restoration under Unesco flags. Visit just for curtesy, but don't allocate more time than 1h.","tripadvisor_monas_209":"The instrumental word in the name of this attraction is 'old'. It is old -- and it has been a long time since anyone put money into its upkeep. However, it is possible to sense...read more ","tripadvisor_monas_210":"The instrumental word in the name of this attraction is 'old'. It is old -- and it has been a long time since anyone put money into its upkeep. However, it is possible to sense its former grandeur -- and it is quite interesting to see how people are living their lives there.If you come here thinking to see...More  ","tripadvisor_monas_211":"2 museums to look atMake sure you see the puppet showMany buskers again to have fun withI enjoyed itStay for lunch at the old Batavia","tripadvisor_monas_212":"Visiting Kota Tua or the old Batavia was disappointing, it is not well taken care of, actually very run-down, but the place has a lot of potential.On the square we as Dutch were the biggest attraction, lots of children asking questions and taking pictures. All very friendly and charming.We had a some food and drinks at Cafe Batavia,...More  ","tripadvisor_monas_213":"Old and classic atmosphere. Historical building and avenue from Netherlands collonial era di Indonesia. Explaining the history of Jakarta city.","tripadvisor_monas_214":"Old city...traffic chaotic... OK .... basic... not really my cup of tea...Imagine I spent average of 4 hours on the road and that's on a bike. Good luck to those to wanna travel in a car...","tripadvisor_monas_215":"The old town is a mix of colonial Dutch architecture and some really nice Art Deco buildings. There are a few museums as well, the Wayang, Ceramics and Central Bank museums being the most prominent. If you go on a weekend, there is a LOT of local color with street performers, food stalls and locals picnicking which I really liked....More  ","tripadvisor_monas_216":"If you like bit of history or taking photo then this is it. There are many old historical buildings from the 18th - 19th century. The most famous sites are maritime museum, syahbandar tower, Jakarta history museum and its famous Fatahillah square. Expect many people in this square during weekend. Also worth to see are the post office, train station...More  ","tripadvisor_monas_217":"İt is the old centre of jakarta with the impressions of holland, when you arrived there you can feel like you are in an european city, pandomims and street artists are wonderfull, drink and eat also visit the little bazar next to it","tripadvisor_monas_218":"There are a lot of old Dutch buildings which looks amazingly unique but the square is kinda crowded and hot.","tripadvisor_monas_219":"No matter how long you stay in chaotic Jakarta, a walk thru the historic old town is a must. Wear closed shoes to protect your feet from muck, chicken manure and just plain dirt. Here you've entered an atmospheric zone. Very photogenic. Read up before you go or hire a local guide.","tripadvisor_monas_220":"Even those with the shortest time to spend in Jakarta should try and include a trip to Kota, or Batavia. It is easy to get to by taxi or buy the J1 bus which terminates at Kota...read more ","tripadvisor_monas_221":"I had never adventured this side of Jakarta, because somehow in this area was too crowded too visit. And the traffic jams sometime was driving us crazy in exhaustment. so we have to calculate the time carefully. Or better we choose a nice accomodation near this side of attraction. so we can take a walk there, or using flexible public...More  ","tripadvisor_monas_222":"Even those with the shortest time to spend in Jakarta should try and include a trip to Kota, or Batavia. It is easy to get to by taxi or buy the J1 bus which terminates at Kota, opposite the bank Museum. From there walk to the many sights but if you want to go to the watch tower and the...More  ","tripadvisor_monas_223":"This is an area around the main old square. One for the architecture fanatics. Whilst there is not a lot there are some gems. You can find colonial, deco and seccessionist buildings. Many in decay. I like to walk along the adjacent canal, but hold your nose!","tripadvisor_monas_224":"Jakarta Old Town, also known as Kota or Het Oude Batavia is a real nice place to spend the day. Coming from the Kota Train Station its a nice walk to the old city square. Me and my girlfriend had a drink at Cafe Batavia, expensive compared to Indonesian standards but still really affordable. The place still breathes the colonial...More  ","tripadvisor_monas_225":"Love it.I think its better to do it by car. Because of the busy places in old jakarta.Saw it by car...","tripadvisor_monas_226":"The earliest recorded mention of Jakarta is as a port of origin that can be traced to a Hindu settlement as early as the 4th century. The Jakarta area was part of the fourth century Indianized kingdom of Tarumanagara. In AD 397, King Purnawarman established Sunda Pura as a new capital city for the kingdom, located at the northern coast...More  ","tripadvisor_monas_227":"If you are in Jakarta it is worth checking out, but it is not well taken care of, and if you walk a few blocks off the main square it is especially run down. There are several museums to check out, some are not bad. However over all, it symbolizes the main reason Jakarta is so frustrating, so much potential...More  ","tripadvisor_monas_228":"Must see in Jakarta. Many remaining historical buildings and architecture of former Batavia. I recommend to walk the route through the old center and make a stop with the Batavia cafe and the old port.","tripadvisor_monas_229":"Local hang out here, really nice if you want to blend in and get away from the touristy stuff. But that's about it.","tripadvisor_monas_230":"we were there on a Saturday. All day in the public square on Saturday people dressed in costumes 'pose'/'busk' and have photos taken with the many people ambling around the square very interesting","tripadvisor_monas_231":"Old Jakarta possesses some gems from the past if you use your imagination. The old colonial buildings can still be seen even if many are dilapidated. Fortunately some...read more ","tripadvisor_monas_232":"Is very happening places here. especially when weekend (liburan) and at night, got a night market selling craft arts and have a show sometimes..some people wearing costume and u can take d picture but have to pay minimum mybe 5000rp. here is a center nearest all the museum. very busy place wih local people. but for sure u can enjoy...More  ","tripadvisor_monas_233":"There is a small old cafe and that's it , I really didn't get what was all about its old town . It's indeed old , breaking apart buildings etc but that's allThere is nothing that can be called attraction in this placeI would advice not to waste your time there","tripadvisor_monas_234":"Old Jakarta possesses some gems from the past if you use your imagination. The old colonial buildings can still be seen even if many are dilapidated. Fortunately some restoration is beginning to take hold and improve the look of the place. There are many interesting sites if you know who to show you around and has an appreciation of the...More  ","tripadvisor_monas_235":"An good place to see the impact of the Dutch East Indies period. Architecture is very interesting. Within walking distance of the old harbour and a drawbridge from the english settlement period from roughly 1500's. Plenty of cafe/restaurants to choose from but be warned on two counts, firstly the area around is a working area, which i personally enjoyed but...More  ","tripadvisor_monas_236":"Being in the midst of the concrete jungle it's like finding a golden nugget. It a great way to spend the afternoon and take a glimpse of the past. Most of the more renowned building are undergoing major renovations so I suggest if you can spare the time wait until the great reveal.I think the best time to visit...More  ","tripadvisor_monas_237":"this is a great place , specialy at night , you can find so many attraction here, for you young people , this is a good place to visit, maybe with your friend or with your girl/boyfriend.. nice place to stay there and spend time just for talking or meeting old friend..","tripadvisor_monas_238":"This area of the City gets wild on Sunday evening, Full of people with some good fun people dressed as the latest characters for you to stand with and take pictures. The square gets very crowded with families and everyone will to get involved and be part of the fun. Some interesting architecture and builds to look at too.","tripadvisor_monas_239":"This old town has deep authentic Dutch colonialism. I saw the infrastructure guidence there is good. It's easy my friend and I explore it and there are many historical museums there. Fully recommended to take photography.","tripadvisor_monas_240":"Great destination for your family even friends, there's so many cafè nearby with great taste of food. Sometimes it's super hot and it hasn't many place to take a shelter outside so don't forget to bring your sunblock (except you're going to café or minimarket).","tripadvisor_monas_241":"The Dutch architecture and influence can be seen in Old Town. There are also a number of street performers, vendors and sights even as a poorer, third world country.","tripadvisor_monas_242":"Visited with a group of friends. Recommended trip to make when you're in Jakarta. We had a walk around the square, learned a bit of Jakarta's history, saw the old train tracks.","tripadvisor_monas_243":"Visited with a group of friends. Recommended trip to make when you're in Jakarta. We had a walk around the square, learned a bit of Jakarta's history, saw the old train tracks.","tripadvisor_monas_244":"Don't go on monday, the museums are closed. Nice for taking pictures. Take a look inside the trainstation the kantor Pos and cafe Batavia.","tripadvisor_monas_245":"Admire the Buildings, sit and enjoy a coffee, meal whatever. Hire a fancy bike (multi colored), evenings the best","tripadvisor_monas_246":"Jakarta Old Town cover very large area from the Monas Area/National Monument up to the Sunda Kelapa Harbour, where you can find the street that in the old time Dutch people store the spices.Still you can see many old beautifull Building which Great Architecture but a lot of these are unfortunalely abandoned.Easily you can get also the first...More  ","tripadvisor_monas_247":"it has old building and a good place to take photo for prewedding, there are also alot of streetfood and other enrtentaiment","tripadvisor_monas_248":"The DKI Province has, under the leadership of its first Chinese Ethnic origin Governor, basuki Tajahaj Purnama (popularly known as \"Ahok\") done quite a lot to preserve the old town of Jakarta City, predominantly located on the Northern part of Jakarta. Areas recommended to visit : Pelabuhan Sunda Kelapa, Jl Roa Malaka area, Jl. Kalibesar Timur ( where among others...More  ","tripadvisor_monas_249":"kota tua is located in west jakarta, it's near from kota station, you can walk to go there. the place is about old building from colonial era and the museum. there are many street food sellers in there, and if you go on the weekend, the place will be crowded.","tripadvisor_monas_250":"We stayed mostly in this area because we wanted to appreciate Indonesian culture at its best. The town may not be clean but the Indonesian culture is really felt here. But the traffic jam was terrible and the river was dirty (even looked black with lots of rubbish). I hope they can clean this place because there are several cultural...More  ","tripadvisor_monas_251":"Old City of Jakarta was full of heritage buildings from the Dutch period. It is always a delight to see the heritage building that is preserved until now. Some has modern touch but still keep the original architecture.","tripadvisor_monas_252":"Don't miss Cafe Batavia, right across the square from the old Dutch Governor's bldg. The big baranda with the wooden shutters, the decor, the cocktail bar, and I can go on and on.Real colonial flavor, very classy, good food and very affordable prices. Service as almost everywhere in Indo, is superb.","tripadvisor_monas_253":"After awhile we came here to attend some young creative event. Happy to see lots of old-abandon yet beautiful building is being reconstructed (as government policy).You can...read more ","tripadvisor_monas_254":"After awhile we came here to attend some young creative event. Happy to see lots of old-abandon yet beautiful building is being reconstructed (as government policy).You can visited many museums in this area. Museum Fatahillah, Museum Wayang (puppet museum) & Museum seni rupa (art museum) are most popular. If you are interested to watch Indonesian puppet show, you can...More  ","tripadvisor_monas_255":"We went to the old town the first time at midday with no expectations at all and enjoyed the experience. It isn't a mall and is, therefore, about the only thing to do in Jakarta that doesn't involve shopping. Actually the life in and around the square is good fun - there is a real innocence and naivety about young...More  ","tripadvisor_monas_256":"I like this area because it evoke a sense of nostalgia. There are few museums around that you can explore. Been here twice, all stays the same tho.I love Batavia Cafe near Museum wayang.","tripadvisor_monas_257":"Prior to my visit, I was told that it was a good place to take pictures and to cycle around -- recommendations that made the place seem like a nice, serene place to spend an afternoon in with friends while learning about Indonesia's history. The former part is more or less true; it is quite a picturesque place, even with...More  ","tripadvisor_monas_258":"Took my students for a photography competition (it was my first time to actually landed my feet at Kota Tua) and it was such a blast. I had fun, they had fun, we had fun. Be careful of the muggy weather and pickpocketters.This place is always full-packed esp. at weekends so better come a bit early if you don't...More  ","tripadvisor_monas_259":"Jakarta Old Town actually Cover very large area. But Mostly People know it only arround the Fattahillah Square and Surrounding. But Old Town it self cover from the Monas Area/National Monument until the Sunda Kelapa Harbour, which is we can find the street that in the old time to keep spices. For example there are Coffee Street, Nutmeg Street, Pepper...More  ","tripadvisor_monas_260":"With a lot of historical buildings and colonial buildings from the dutch colony around the area, this old town is actually charming and could be beautiful, however it is so unfortunate that it is not well maintained, it s dirty, too many vendors on the sidewalks.The government must pay more attention thomclean this area up and i could see...More  ","tripadvisor_monas_261":"Lovely place with many activities, and restaurants, if you are in Jakarta, you must go to this place for sure.","tripadvisor_monas_262":"This city has a long way to catch up to the rest of Asia.Its hard to find a good meal at a western standard. on an asian standard its an expensive place to shop, hard to find a decent super market, Carrfour super market is a joke unless your looking for isles full of noodles, Ranch supermarket is extreamly...More  ","tripadvisor_monas_263":"The colonial history of Jakarta can be seen here both in some well preserved museums and in some ruins.Its got the Fatahilla museum, the wayang and ceramic museums and a vast plaza with fairs and entertainers. Worth a visit","tripadvisor_monas_264":"One of the world's greatest megalopolises, Jakarta is a dynamic city of daunting extremes that's developing at a pace that throws up challenges, Jakarta is the biggest city in...read more ","tripadvisor_monas_265":"One of the world's greatest megalopolises, Jakarta is a dynamic city of daunting extremes that's developing at a pace that throws up challenges, Jakarta is the biggest city in Indonesia with a role as the capital of Indonesia as well as the government center of Indonesia.","tripadvisor_monas_266":"Kota Tua or Jakarta's Old Town is a very nice place to tour. It is comprised of the national museums and fatahilah square. It is surely a must see place!","tripadvisor_monas_267":"There is simply not enough of it. Too many seriously run down houses that could have a lot more done with them. The place is basically a square with Batavia Cafe at one corner, the puppet museum and a few other buildings. I think you'd be stuck to spend more than an hour here other than eating at the cafe....More  ","tripadvisor_monas_268":"When you need a change from skyscrapers and mall. I go there early morning for a walk around.Small streets, vendors and things that you may find there to take as a souvenirs.","tripadvisor_monas_269":"i love this plqce it s full of history. i visit the musuem really nice. The train station Kota is just amazing. It only need to be a bit more clean than i ll be the perfect place for travelling. I really recommend it to people travelling to Jakarta.","tripadvisor_monas_270":"Unlike the name suggests, there is little history in Old Town Jakarta, the buildings are delapadated, and there are plenty of people on the streets to sell you useless junk. You might want to go to check it off your list, but don't plan to stay long, and I wouldn't bother bringing your kids along.","tripadvisor_monas_271":"The old city is nice, and old fashin dutch. But to arrive there you have to breath so much pollution and to face a flow of cars ...It was our first day in Indonesia and we had to stay in Jakarta. So ok. I would not advise to pla a special trip to Jakarta. If you need to stay...More  ","tripadvisor_monas_272":"We truelly enjoyed the tour of Ikan pasar, the harbour, the musea and the Batavia square but our first experience local guide negotiations was very bed (luckilly it was only bed one on Java). He talks Dutch ( which was great for our sun) but when the payment time was there he wasn't honest and trippeled the original price we...More  ","tripadvisor_monas_273":"A reasonable attempt is being made to update and restore this area. The historical significance would be much better understood with a guide service. Museum curation does not appear to be a strong point in Jakarta but the places on display were interesting. Beware if you are a \"bule\" (white skinned), you will likely be asked to appear in many...More  ","tripadvisor_monas_274":"Awfull. Not much to see. What is there is poorly maintained with little regard for history. Couple of Dutch colonial buildings there but only a handfull. Some good coffee and grub to be had here but for a high price. We had some local but modern food on hip plates in a cool setting. Not much else to do. Took...More  ","tripadvisor_monas_275":"i was last time at night to old town. Its really crowded than before. Our old town is now living again after so many years they leave it behind. Since 2009 Jakarta renovate old...read more ","tripadvisor_monas_276":"i was last time at night to old town. Its really crowded than before. Our old town is now living again after so many years they leave it behind. Since 2009 Jakarta renovate old town and now you can go there at night and feeling safety with nice atmosphere from various people who visit the old town (especially Museum Fatahilah)","tripadvisor_monas_277":"As a Dutch person it is of course mandatory to go here. For 13 years I have been visiting this place regularly and it is getting better with every visit. Roads turned into walkways, finally some renovations going on, etc.You can still see disrepair, which in its own adds atmosphere (trees growing through roofs and walls look awesome). At...More  ","tripadvisor_monas_278":"There are a couple of interesting places to see here, but most of it is not properly maintained. Beware not to come here on the weekend it will be jam packed with street vendors","tripadvisor_monas_279":"This park need to more managed from cleanliness of garbage, the seller of souvenirs, food court. In the shellnut well recommended to see history of Jakarta and good educational monuments.","tripadvisor_monas_280":"Never mind the traffic jam and the crowds. Just take care of your belongings. Here the buildings had seen better days but with a good touch of colonial character. Must visit if time permits.","tripadvisor_monas_281":"Jakarta, compared to Singapore, KL, and cities like Hog Kong, has a limited offering within the City itself. (But the scenery and landscape around Jakarta and indeed throughout Indonesia are truly amazing. Java is a beautiful island.Anyway, Jakarta is not awash or renowned as a tourist city, but the people make up for that. The Old Town has lots...More  ","tripadvisor_monas_282":"Actually there is not many thing to see in Jakarta.So this place might be the best to visit to feel history.The old colonial buildings surround centro park like European City.Unfortunately, some of old buildings are burn / broken down.And little dirty here.But most of Indonesian places are dirtier than here.They need to revival this...More  ","tripadvisor_monas_283":"Old ten of Jakarta Its Dutch time col I'll place with beautifulHouses Dutch left Dutch named as Batavia. Old colonial bldgs reminds of Dutch rule. Oll town square must is vet pleasin place. Old Batavia cafe in same style. Must go therefor coffee Oldunicipal bldg now iOS museum should not beossed worth a visit t","tripadvisor_monas_284":"If you are a museum person,you should not miss this place.In addition,it could be an option to stay away from Jakarta hustle and bustle.Strategically located near Jakarta Kota Bus Stop (JKBS).After getting out from JKBS,you will see Museum Mandiri on your left.Walk North for about 100 meters.Cross the road and keep walking to the North.You will see some souvernir and...More  ","tripadvisor_monas_285":"With plenty of markets and food stalls its well worth a wander around. I suggest you do it at night as it's fun with all the lights and food smells.","tripadvisor_monas_286":"I go here relatively often, especially when i want to show friends (from within and from outside of the country) a unique side of the city.There are many attractions around the...read more ","tripadvisor_monas_287":"I go here relatively often, especially when i want to show friends (from within and from outside of the country) a unique side of the city.There are many attractions around the area, such as but not limited to: The Fatahillah Museum, historical architectures and Pelabuhan sunda kelapa (old port). There are even places to rent bikes (complete with complementary...More  ","tripadvisor_monas_288":"accompanying a friend going around Jakarta, we end up at Kota Tua Jakarta. it's a nice place roaming around getting off from terrible traffic of Jakarta; and it is a good place to have historical nuance of colonizations in Indonesia. there some good restaurants nearby, and museums.","tripadvisor_monas_289":"Kota Tua Jakarta is one of my fave. I never been bored to visit it. Taking pictures in front of Museum Sejarah Jakarta or watching attraction there or just window shopping around it. One of my fave is buying traditional food like es potong or pecel. Hahaha...","tripadvisor_monas_290":"We went there with my wife and everyone tried and some succeeded to rip us off. Terrible place and like whole Jakarta and I would say whole Indonesia very disappointing. People are very unfriendly and everyone want to take advantage of every white girl they see... Don't go to Indonesia is my best advise...","tripadvisor_monas_291":"I came to visit from a friend recomendation, but I didin't find it so great, I'm not a musseum person, and the colonial buildings not so big, nor so artistics. Sorry, but I just cant help but think, there's nothing so spesial about this place. If you like art, there's an art gallery.","tripadvisor_monas_292":"Of course you're curious. Where is the nice part? This is, after all, the Old Town. So you keep on walking past colonial era facades glommed up over the years with a patchwork of inexpert renovations, tiny impromptu restaurants huddled around a stinking portable burner, and clutches of local dudes squatting in the doorways, glowering at you. The gutters are...More  ","tripadvisor_monas_293":"From some of the reviews / comments from other travellers I expected to be walking into Amsterdam. It isn't really like this though. Many of the beautiful old buildings have fallen into disrepair and some are clearly about to collapse. I guess it's in no one's interest to move in or repair them.Also if you don't know what to...More  ","tripadvisor_monas_294":"Wandering around Jakarta old town makes you feel a new atmosphere of Jakarta else than skyscraper, malls, and apartments.So many beautiful colonial architectures that is still well preserved (although a few of its are not, which is too bad). Good place to make a photo session.","tripadvisor_monas_295":"This are really should be renovated. There are plans and I hope they will do it. Because it's an important part of the history of Jakarta and it has a real big potential.","tripadvisor_monas_296":"if you are happen to be in jakarta town, it is worth it to take a short visit to Jakarta Old Town or Kota Tua. you can take public transport/TransJakarta, it is quite convenient and easy. Just take TransJakarta bus from Blok M bus terminal, the trip will take around 45-60 minutes to Kota bus stop.","tripadvisor_monas_297":"Both the museum and areas surrounding it offers a good insight into the city: past and present. Fascinating.","tripadvisor_monas_298":"Both the museum and areas surrounding it offers a good insight into the city: past and present. Fascinating.","tripadvisor_monas_299":"Because we came here on weekend, all the building were close to public. The only thing we could do here is taking picture and sightseeing... Nothin more....","tripadvisor_monas_300":"Went here today.So crowded!Not so much attraction, just people taking pictures.We cant take good pictures because too many people there, lil bit dirty and smelly.No. Just good anymore.","tripadvisor_monas_301":"The only remaining buildings are the Batavia café and the museum. The old town of Jakarta is mostly in ruins, especially those building by the canal. The plan to renew the canal area is very promising but unlikely, mostly due to the stench of the canal. Some old buildings are literally on the verge of crumbling and beyond recovery. Yet,...More  ","tripadvisor_monas_302":"I started to walk from fatahilla square then get a glimpse of cafe batavia. Walk along the road and old building to Dutch bridge. This walking route is interesting to try once : http://www.everytrail.com/guide/when-jakarta-was-batavia.","tripadvisor_monas_303":"Nice place to visit, bit difficult if you using your own transportasion. It more nice if you use transjakarta or known as busway. You can enjoy the sightseen to old town. You can also use train (commuterline). The authorities still working on manage this place became more nicer. In weekend many people goes there and lot of souvenir street stall...More  ","tripadvisor_monas_304":"Not as good as I hoped, very old derelict buildings. And it's the only place in Indonesia so far that I have been that smells. Nice restaurants in the area though. Don't go on Monday, all museums are closed","tripadvisor_monas_305":"One can review and rewind while with resident , they would tell amazing stories from time it has been shaped and changed to its present time.","tripadvisor_monas_306":"The pulse of a city is best felt in it's historic \"old town\" area. We visited Old Town because Old town was all that existed when my father in law grew up in Jakarta. It has more character and personality than most of Jakarta and is worth seeing. We enjoyed the experience of reconnecting with the past. If you enjoy...More  ","tripadvisor_monas_307":"Kota or Old Town, is legitimately one of the best and few interesting places to visit in Jakarta. The square is vibrant and there are many museums in the area.That said, aside from Cafe Batavia, a highly overpriced, tourist restaurant with abysmal service at best, the buildings are in serious disrepair and are absolutely neglected. Last year, in an...More  ","tripadvisor_monas_308":"If You interested on Culture and wanted to get to see The history of Indonesia This is the right place for You.","tripadvisor_monas_309":"If You interested on Culture and wanted to get to see The history of Indonesia This is the right place for You.","tripadvisor_monas_310":"While most travelers in south east Asia try to avoid spending too much time in Jakarta which evidently serves as hub for further travel, there are some places in the city which are worth a visit. While you either chose to stay here or you were stuck for VISA and passport issues. The old city can fill your afternoon and...More  ","tripadvisor_monas_311":"As I went there on weekend,so many people around old city..and I came there a bit late so it was hot in the afternoon.dont forget to bring umbrella.not many shelter there","tripadvisor_monas_312":"The center of Kota Tua is Fatahillah Museum. If you come on Saturday or Sunday, you will find lots of people gathering here, kids, young people, old people. Some are running across the big yard of the museum, some cycling (you can rent bike here), some just sit, some doing selfie, lots of activity. There are people come from their...More  ","tripadvisor_monas_313":"for one used to the square of most european cities, this is rather dull and has really nothing to attract the visitor","tripadvisor_monas_314":"It was a unique experience going around an area full of old colonial architectures. However, moving around Jakarta itself was a very suffocating experience. The traffic is always congested, the streets are crowded and the air is polluted. The positive is, the taxis there are quite cheap. As advised by my Indonesian friend, make sure the taxi you take is...More  ","tripadvisor_monas_315":"Our friend and her daughter took us here on our first day in Jakarta, a Sunday. There were many vendors, exhibits, musicians and a lot of interesting things to see. It was very crowded with tourists as well as local residents. We were told that it was always crowded on Sundays since people were out with their families and friends....More  ","tripadvisor_monas_316":"Even if you are in Jakarta for a few days, if you want to see the real Jakarta, see it's history, feel it's culture and meet the locals there is no where else!!!There are so many sights to see within the old town you would need to be there first thing in the morning and be prepared to leave...More  ","tripadvisor_monas_317":"The whole square is travel in time to the old Dutch era. The buildings are colonial. The central square has many visitors and is a place full of life and energyYou can buy trinkets, cycle on their colourful cycles, have coffee in the iconic Cafe Batavia. In shot can spend a whole day","tripadvisor_monas_318":"there is nothing of interest here. Don't battle the weekend traffic to come here. Very disappointing","tripadvisor_monas_319":"It pains me to say this - spend your time someplace else and you won't miss a thing. The traffic is worse than you could ever imagine. Filthy. The river is absolutely full of...read more ","tripadvisor_monas_320":"It pains me to say this - spend your time someplace else and you won't miss a thing. The traffic is worse than you could ever imagine. Filthy. The river is absolutely full of trash and it is just plain nasty. I wanted to love Jakarta and I felt like a jilted lover instead.","tripadvisor_monas_321":"The Old Town is Jakarta. It's heart and soul. I've always stayed there, as real life is at your doorstep. And safe...if worried. Lovely people.","tripadvisor_monas_322":"You never choose to visit Jakarta.I was in Jakarta for business, as many people. The only reason you would go to the Old Jakarta is because you don't want to stay in the hotel ! And when you arrive - as usual after boring traffic jam - you immediately regret your confortable hotel :(So forget. If you have...More  ","tripadvisor_monas_323":"in this location u can find cafe batavia, museum fatahilah, meseum wayang, museum keramik, and also in weekend because there are car free day, u can relax to walking this area, and don't afraid u can find nothing, in this area there are so many mercandise and food offer, but beware to ask and bargain first before u buy","tripadvisor_monas_324":"The Jakarta old town or Museum Fatahilah areas is one of tourist must visit while stay in jakarta, experience the history of old Jakarta, meet local people and get some pictures. along the area so many old buildings and museums such as Ceramic Museum, Mandiri Museum, Wayang Museum, Bank Indonsia Museum and dont miss the old Kota Intan Brige from...More  ","tripadvisor_monas_325":"visiting this old town prefer on eveningtake a great photo and hunting the culinary aroundits more to history journey and architectural","tripadvisor_monas_326":"The old town part of Jakarta is situated in area that are overly crowded. The streets are not too wide, and the traffic is just hectic. If you're a photographer traveler then this spot is probably one of the must go place in Jakarta (other than Prasasti Museum). You'll find many interesting spots to shoot at, especially on sunset with...More  ","tripadvisor_monas_327":"Potentially very nice, but still not enough happening and too many old house falling apart, So a low ranking to ensure finally some action will be taken to save this piece of heritage.","tripadvisor_monas_328":"Nice and quite place to visit especially in the evening, this is the old city of Jakarta!Nice small place with a shopping area and old buildings!","tripadvisor_monas_329":"The visit here is a great photo opportunity....but sadly the buildings are dilapidated and decaying. There is some effort to refurbish the main Fatahillah Square but many beautiful building are unused and not looked after...we saw some amazing stain glass windows in some of the bank buildings and if not one takes care the walls will fall taking the stained...More  ","tripadvisor_monas_330":"The old city of Jakarta was called Batavia. This is definitely a place to visit. Nice old buildings, bars & restaurants as well as some museums. It is a peaceful area and you must...read more ","tripadvisor_monas_331":"Probably one of the crowdiest, dirtiest and most uncommon places on earth - so you should deffinitely go there!!! I personally know this kind of \"town\" only from guided tours in Rio if you know what I mean... but with a bit of common sense you'll feel safe (at daylight!!!) and experience a piece of old, genuine Jakarta. A masterpiece...More  ","tripadvisor_monas_332":"The old city of Jakarta was called Batavia. This is definitely a place to visit. Nice old buildings, bars & restaurants as well as some museums. It is a peaceful area and you must vist Cafe Batavia and have a drink/ mea while you are there. Highly recommended!","tripadvisor_monas_333":"Very nice in the evening. And is a little more quiet than the rest of Jakarta. Cute shopping area and has a very cool 'old' restaurant called Batavia, where you can eat Dutch treats such as bitterballen.","tripadvisor_monas_334":"The old town in Jakarta is a good place to spend a couple of hours while visiting the city, but not much more. There are a few nice bars and restaurants (like the old Batavia) and is possible to visit the old Municipality, now a museum.There are some reminiscences of the Dutch colonisation which makes the visit worth it!","tripadvisor_monas_335":"This place has been elevated to a new level now, differ from 5-7 years ago, this place is now renovated, more attractive, sophisticated and popular. You can see museums, take a local tour with rented bicycles, take a 'groufies' (group selfies) with \"the Stone Men\"; a group of people who body painted themselves as indonesian soldiers fought for our independence,...More  ","tripadvisor_monas_336":"Well it was not really Jakarta Old Town like it used to be concider to its name. Its just some old abandoned area that people come for taking pictures or watch some unatractive show... I came here with my mom and my little brother and did not enjoy anything. Just people cycling and taking pictures of the \"old\" build.. For...More  ","tripadvisor_monas_337":"It's really easily to reach by train from many place. We go early morning from our city using diesel train to stasiun Kota. After we're by walking to the Kota Tua (Old City). It's arround 5 mins to walk. There's a lot of attraction such as a human statue of soldier, cartoon figure, and seller. Some people was serve rental...More  ","tripadvisor_monas_338":"This was the highlight of my visit to Jakarta. I loved wondering around the old town and the jetty village. The people are so friendly. I take pictures of people for my website, and the people here never objected to having their photos taken, in fact they mainly enjoyed it, and it was a good way of connecting with them....More  ","tripadvisor_monas_339":"Croudy place especially in the evenings. The are several museums there not quite interesting ones. The most interesting is Wayang Museum. Also at the old town is famous futuristic cafe - Batavia - not worth going their - expensive and not tasty. There you should always be very careful as in this place there a lot of pocket thieves.","tripadvisor_monas_340":"The colonial buildings are there...but that is it..some museums nearby and a small street market...of you have been in old latin american cities it doesn't worth the visit","tripadvisor_monas_341":"This place is the remaining part of history of Jakarta. You can see the remains of glamorous building that transform to the vintage, rustic, and uniqueness. This place is the...read more ","tripadvisor_monas_342":"Very little to see here. A few dozen stalls selling the same rubbish. Very little charm in the buildings. Overall an underwhelming experience.","tripadvisor_monas_343":"This place is the remaining part of history of Jakarta. You can see the remains of glamorous building that transform to the vintage, rustic, and uniqueness. This place is the symbol of the glory of Jakarta at that time. If you visit Jakarta, do not miss to visit this place.","tripadvisor_monas_344":"My first visit to Jakarta was during Ramadan a few years ago and I went to the Kota area on a weekday (a Monday I think when many museums are closed) when it was pretty dead. However and on my last trip, I went on the weekend and while the square was half closed off for restoration, there were thongs...More  ","tripadvisor_monas_345":"It's a pity that this place was not maintained properly. It's a must see in Jakarta as there are limited places to visit in this city. Not a touristic city but worth seeing the bustling capital culture. Its the last of remaining dutch colonial architectures. Good for photography.Note: Keep yourself guarded at all times. Be vigilant not only to...More  ","tripadvisor_monas_346":"Visiting Jakarta first time? I think this \"old city\" must in your agenda. I like this \"old city\" in the evening or early in the morning. I only visiting this place for visiting museum, there some museums in the area. I love this place for taking pictures. Visit this place in the evening or early morning, and avoid to visit...More  ","tripadvisor_monas_347":"Colonial splendour not to be missed. The only architecture in the whole city which could be considered beautiful. Pleasant open square with vibrant activity and nightlife. Batavia Café is a must.","tripadvisor_monas_348":"Cultural attraction, mystical, old town architecture, nice place for photograph activities, mostly outdoor activity (prepare for umbrella or Glasses with UV protection), has a shop/market selling traditional snack. Can rent a classic bicycle, i'ts very cheap. Has a cafe, toilet, parking area, easy to access by public transportation. Has a museum and others attraction/even will be fulfilled you journey","tripadvisor_monas_349":"Kota Tua and Sunda Kelapa ..how would I Say about this place? It's an heritage which Jakarta must proud of, but as everyone can see it's still lack of infrastructure for visitor to go there. Not a clean place, Kali Besar it's dark and dirty. As the information The Jakarta Government will make a huge chance to make Kota Tua...More  ","tripadvisor_monas_350":"We all need to preserve and maintain the historical and cultural value of Jakarta, especially this Icon of the Jakarta heritage","tripadvisor_monas_351":"Batavia or old city of Jakarta provides many historical buildings.I visited this place many times, since it was a mess and dirty, until now an improvement seen on going there.I finally visited all museum at the last visit.I juts realized that Old city has many great museums there. Not forget to mention puppet museum, handycraft museum and...More  ","tripadvisor_monas_352":"I love Kota Tua, you can find any interesting place in this area. You can find a good museum like Bank Indonesia Museum, Cafe Batavia, Kota Intan Bridge. But somehow i don't like...read more ","tripadvisor_monas_353":"sunda kelapa is a must see... traffic is very dense, tiring. view from the old watchtower is pretty good.","tripadvisor_monas_354":"I love Kota Tua, you can find any interesting place in this area. You can find a good museum like Bank Indonesia Museum, Cafe Batavia, Kota Intan Bridge. But somehow i don't like the atmosphere in this area. Totally chaos, i mean you can see many people and sometimes it's very dirty.If the government pay attention how kool this...More  ","tripadvisor_monas_355":"Most Asian cities has take a big turnaround turning into high rise buildings, smart buildings and what not.Some Asian ciites do maintain some past or colonial buildings as heritage.Where to look for when you are in Jakarta? There you are. This is the place. You have to walk around to look what you are looking for. Don't give...More  ","tripadvisor_monas_356":"First visit to this place last month, I found some great buildings from the ancient colonial, Lot of museums surrounding, Culinary places & Interesting biking thru the site by \"Traditional sepeda onthel\" :). Unfortunately, the museums are not open daily?","tripadvisor_monas_357":"I have been to jakarta many times but this is my first visit to kota tua. I must say it is a site worth visiting. With all Jakarta's malls, finally a flavour of old Batavia is found here. I wish the buildings were maintained better, it has so much potential.","tripadvisor_monas_358":"The former site of Dutch East Indies' very first settlement in Java, it is hard to imagine that the current surviving old town is all of the city during the first era of this humongous city. The VOC company razed the old settlement of Jayakarta before founding a very new city on its site, the formerly walled area which is...More  ","tripadvisor_monas_359":"I love this part of the city .. hopefully government will preserve this many colonial building style and restore them ..","tripadvisor_monas_360":"lots off attractions,Batavia cafe great,tasty food stalls,bike hire to enjoy the surrounds,free museums and many children just being friendly and inquisitive of tourists,spent an afternoon enjoyed every minute.","tripadvisor_monas_361":"The old town is charming but not much to see. It's relatively small but worth the visit if you have a free afternoon.","tripadvisor_monas_362":"Went on a Saturday. Visited the Wayang museum and the beautiful old Dutch hotel for lunch. The square is well worth a visit. Bicycles are coloured for hire with matching hats. Many children enjoying the day. We were besieged by them to practice their English. There were many street theatre acts and plenty of food. A small street nearby offered...More  ","tripadvisor_monas_363":"These charming old town will bring you back to the days where the Dutch empire rules this land. You will find many fascinating attraction that makes the time passed so quickly...read more ","tripadvisor_monas_364":"These charming old town will bring you back to the days where the Dutch empire rules this land. You will find many fascinating attraction that makes the time passed so quickly. Trust me... you will never feel boring.","tripadvisor_monas_365":"Impressive architecture to be seen everywhere you turn, couple that with a truly lively atmosphere where artists come and express themselves and you have a very good place to spend a late afternoon. Spent some time there with some friends just taking it all in","tripadvisor_monas_366":"The Jakarta old town is one of the most interesting part of the city. It is occupied by many historical buildings, although some houses museums and shops, most are neglected.It is perfectly safe to walk around the area (as long as you don't show off your gold plated iPhone).In general, it is a good place to explore and...More  ","tripadvisor_monas_367":"here, you can find dutch colonial heritage..also,you can learn some history of colonial in indonesia... its a good spot for photos.. getting here is very easy with transjakarta(bus).. you can rent old fashion bike,and dont worry..they can speak english... you can find the famous \"es Potong\" here in kota tua...but beware of pickpocket..please be careful..... overall 3/5.. worth to try....More  ","tripadvisor_monas_368":"The Old Batavia town center, used to be the city's old town center until it was moved to Weltvedrenen... it was however revived a little by the Dutch later as business center of the city while government offices and elite residential all are in Weltvedrenen. The area becomes one of the poorest part of Batavia and that continues until today......More  ","tripadvisor_monas_369":"Wanna see Jakarta in the old times? Then go to the old town Jakarta. You may find many things there beside the oldiest buildings, such as culinaries (street foods and cafes) and buying cheap goods (clothes, computer and accessories, etc). Good place to visit for the whole day.....","tripadvisor_monas_370":"We recently visited the Old Town and harbour, what an interesting day, yes the harbour is dirty, bustling and busy but such a treat to see people going about their daily business without the glitz of tourism. A walk along the pier to watch the boats loading and unloading was interesting and also the skills associated with keeping these boats...More  ","tripadvisor_monas_371":"I always like to visit the old dutch houses in Indonesia for it architecture and its silent beauty. Visiting the old city of Batavia was an exprience.Am glad to learn that there are some restoration work taking place , but many old buildings are yet to get that touch.This place has so much history to tell of the...More  ","tripadvisor_monas_372":"Jakarta old town known as beos in local people. Hystorical landscape of 18 century consist of building, cafe (wellknown batavia cafe) ruins shopping centre, bridge.nowdays local,fomestic andforeign tourist came to this place. I think not because of to see this hystorical site but many local and authenyic indonesia perfomance and really indonesia street foodtook place there.beos site also aside...More  ","tripadvisor_monas_373":"We arrived to view Jakarta old town on Labour day so unfortunately the museums were closed. We did visist the Puppet makers which was facinating and also went to the Sunda Kelapa harbour and the old Dutch bridge finished off our tour with a trip to Cafe Batavia very enjoyable","tripadvisor_monas_374":"I like the buildings here and take some time to the cafe around n enjoy the old city life.The wayang kulit (paper puppet) museum is a must to visit. The entrance is very...read more ","tripadvisor_monas_375":"I am really sad with this place. Just another unmanaged interesting place in Jakarta. Historical place with poor information and poor maintenance. Not much you can do in this place.But if you are in Jakarta you must visit this place, buy a history book about Jakarta before come down here.","tripadvisor_monas_376":"I like the buildings here and take some time to the cafe around n enjoy the old city life.The wayang kulit (paper puppet) museum is a must to visit. The entrance is very reasonable.","tripadvisor_monas_377":"Jakarta I can say is the place with 'thousand' shopping malls, at one point we all get bored with just going to malls, if you're looking for a new place to visit, going to the old town gives a different experience, there are cultural museums you can visit (old bank, wayang, etc). At this side of the city you can...More  ","tripadvisor_monas_378":"historical place and buildings are here, all the buildings here is a cagar budaya. old town is a one of first area we can called jayakarta. before the town bigger like know","tripadvisor_monas_379":"If you want to delve into the past of Jakarta, head to Kota, specifically Fatahillah Square. This is the centre of the old Dutch settlement of Batavia. The square is bounded by the oldest buildings in Jakarta, the most impressive being the City Hall from 1707. This was the headquarters of the Dutch East India Company. Other areas of the...More  ","tripadvisor_monas_380":"We stopped in the Old Town when we took the ''Hidden Jakarta Tour '' and we found this part of the city to be quite characteristic of Jakarta : a mix of the best and the worst ! There are some buildings which are very beautiful and well kept while others are in a really poor condition and one wonders...More  ","tripadvisor_monas_381":"There are many fine buildings to admire whilst exploring Kota. Some have been restored whilst others have been very neglected. However the unloved ones still offer much to be appreciated as they tell a tale of the past. It is also a good place to people watch and just take in the vibe that is Jakarta. Stop off at Cafe...More  ","tripadvisor_monas_382":"To see the old and classic place is never made us felt bored. We always excited to explore a old place to see what we never seen before. Just beautiful old town with very friendly local people.","tripadvisor_monas_383":"It is quite old and run down, and the poverty can be a bit depressing, but it is certainly worth visiting! You can see parts of Jakarta that are not part of the new modern city. I highly recommend a guide to maximize your experience.","tripadvisor_monas_384":"History is relative and the Indonesians have no great love for their colonial past under Dutch rule. That being said, this heart of old Batavia, the forerunner of modern Jakarta, has been left to rot. The buildings are literally falling down. There is one old Dutch drawbridge. The Town Hall and history museum were under renovation while I was there,...More  ","tripadvisor_monas_385":"We booked a city tour from www.krakatauholiday.com and our guide and driver were waiting at the port when our cruise ship docked. They were both delightful and gave us a good...read more ","tripadvisor_monas_386":"We booked a city tour from www.krakatauholiday.com and our guide and driver were waiting at the port when our cruise ship docked. They were both delightful and gave us a good tour of the city (albeit there is really not much of worth to see). It was a Sunday and so the traffic was much less than the usual chaos....More  ","tripadvisor_monas_387":"The most interesting part of Jakarta, a lot of museums and old houses, but can also be a little discomforting for more sensible people, with smells and sights that are not manicured for tourists. It is real, can be a little rough ( but is very safe ), but is he hart and the real Jakarta, must see if you...More  ","tripadvisor_monas_388":"First time I've been to this place. Honestly it's not like what I expected. It's almost like slum. I wont venture here after dark. Most of the craft sold here is not unique. You can find them elsewhere, and cheaper too. The only things worth seeing is some of the old building. I saw couple taking their wedding pictures in...More  ","tripadvisor_monas_389":"This was a huge let down for us. There aren't many foreign tourists around but plenty of locals sightseeing. There were no signs, lots of litter and the place has huge potential for tourists to spend in the area and keep coming back. We had a coffee off the main square on one day out of our 4 days in...More  ","tripadvisor_monas_390":"Streets are lined with very old, but well kept buildings. The place shows the origins of Jakarta as a city. Not many places to visit or eat, just walk around and snap pictures along the way.","tripadvisor_monas_391":"Great service. Bought two men's suits and a pair of tailored slacks for my daughter. Delivered on time and even drove one item to our hotel on the other side of Jakarta so we could get our flight without having to fight traffic. Best quality for the money. I'll be back","tripadvisor_monas_392":"This is a place for city tour. This is the face of jakarta behind the modern. Beside traffic jam, Jakarta still have a potential beauty. Its more about people that love the city, but the city not love them ... lol. But now, Jakarta is changing. And you will see this place become beautifull and romantic is some way.","tripadvisor_monas_393":"I had quite a nice few moments enjoying the Old Town of Jakarta. I believe it would be nicer if the government improved its cleanliness and gave more protection of the place.","tripadvisor_monas_394":"Popularly known as Kota Tua, you can find few iconic museums around and has some unique buildings since Dutch colonial era. There are many vendors, traditional gifts stalls and food stalls. The overall ambience make you feel as if time had stopped at a few decades ago. Ideal for those who like to experience the local culture.","tripadvisor_monas_395":"Kota tua has some fantastic buildings from the Dutch colonial era. I quite enjoyed walking around the square seeing the street performances outside and popping into the museums. Cafe Bavaria is a must if you're after a good coffee. The bad thing is all the other crumpling buildings you'll see if you head outside of the square. Also the canals...More  ","tripadvisor_monas_396":"When you get off the train the first thing you notice is how busy this station is. People every where and horendous traffic all around the station. Walking around is ok but the...read more ","tripadvisor_monas_397":"When you get off the train the first thing you notice is how busy this station is. People every where and horendous traffic all around the station. Walking around is ok but the traffic is intense. Not such a calming experience. The odd beautful building or historic point of interest but all in all not worth going out of your...More  ","tripadvisor_monas_398":"It was an experience as we took the train from Gondangdia to Stasiun Jakartakota; too see the huge differences/separation gap between the rich and the poor.As we got off and took a walk around the area; we saw a lot of Buildings which was falling apart.The place itself is interesting as there are many people around the area...More  ","tripadvisor_monas_399":"It's good place to go and take a picture of old Jakarta. It was the town of Jakarta back then. Now, most likely its a museum. I also had experience to go there in the night and there were a band and lots of people. There were also shock market with mat selling drinks like coffee and place to sit...More  ","tripadvisor_monas_400":"Firstly, put your sun block on. Park near the area, expect to pay parking of Rp 5K unlimited. You can walk within distance to Wayang Museum, Underground Dungeon (Penjara Bawah Tanah) and enjoy the museum Fatahilah itself. There will be no fee, if there's a fee it will be less than Rp 15 K guaranteed per person. Food if you...More  ","tripadvisor_monas_401":"The easiest way to go there is by taking a bus. It will only cost 3,500 rupiah.I was a bit disappointed when I got there. The place was not properly maintained. Water under the bridge smells bad and there were litters everywhere. The good side is you can see lots of work of art.","tripadvisor_monas_402":"There's an interesting street scene in Kota Tua. Old American cars line the streets with people selling all sorts of trinkets. And there are a number of food carts, as well.It's definitely worth a visit to check out one of the museums and walk around. I did it in about 1 or 2 hours, in addition to the time...More  ","tripadvisor_monas_403":"It seems to be an evidence of Dutch to rule Indonesia. I hate the colonialism. The place remain much of ancient dutch buildings.","tripadvisor_monas_404":"The place could be stunning but its totally run down and falling apart except for some selected buildings. Fatahila Place has a nice and busy atmosphere at night and there is very genuine street life. Old town is not an attraction that will mesmerize you, unless you like carelessness and decay. Such a shame. Also beware of traffic. Getting there...More  ","tripadvisor_monas_405":"Jakarta Old Town is where the city born. Despite the frustrating traffic, smelly river & dirty streets, you will treasure hundreds of years beautifully designed buildings. Only few in Asia still have those luxury and the cheapest to savor them is in Jakarta.Find any literature for buildings & sites reference before you go to really 'feel' the city. Dont...More  ","tripadvisor_monas_406":"The old town of Jakarta isn't very nice,safe,clean or convenient some buildings are just a little interesting but do not have high expectations as what you see in pictures are very different. The old town is very dirty, the traffic is always so bad and it would take you a while to reach there and on top of all that...More  ","tripadvisor_monas_407":"The centre of Old Batavia could do with some more renovation works. A lot of it has been done already, but if the government would just put little extra money and effort into it...read more ","tripadvisor_monas_408":"The centre of Old Batavia could do with some more renovation works. A lot of it has been done already, but if the government would just put little extra money and effort into it, this could be a magical tourist attraction, with beautiful restaurant/bars/terraces outside. Make sure to visit Sunda Kelapa (old port) and have lunch or diner at Cafe...More  ","tripadvisor_monas_409":"You won't find much of the original in Jakarta, but this area has at least a bit left. The old port area of Sunda Kelapa is fascinating for a stroll along the wharf where the traditional wooden phinisi boats are being loaded for their journeys amongst Indonesia's 17,000+ islands. Take a walk around the square lined with Dutch-era buildings, visit...More  ","tripadvisor_monas_410":"This would be a very interesting tourist sites to experience old days of jakarta, but if and only if the site are well maintained by the local government.The place now is full of abandoned old buildings with half ruined or even completely ruined parts. Yes if you look really closely and carefully you can see how the building were...More  ","tripadvisor_monas_411":"I was lucky that my indonesia friend bring me around..is better that u walk rather that take teksi..the traffic jam is terrible there..we manage to find Kota Intan Bridge..just walking distance from Kota Tua..Walk around n see some of the old building here n there..We left to Museum Bahari after that..","tripadvisor_monas_412":"Me and my boyf kinda boring visiting mall all over Jakarta, we visited there by transjakarta , a public bus which is well maintained for Jakarta's standard. Anyway, I love to eat, so I eat a lot in around museum haha. An afternoon visit will be great, since it's not too hot. Take a bicycle rent for fun, going round...More  ","tripadvisor_monas_413":"Yes, do come here, it's very unique and full of exciting things to explore! This place is perfect on a Sunday for nice walks. To understand more the culture and history of Indonesia, this place is definitely not to be missed.","tripadvisor_monas_414":"I acrually visited Jakarta Tua-- the Old City twice with some Indoneisan friends this year. First time was in the early evening when the Plaza was busy with families eating and playing futbal, as well as tourists-- Got a chace to some fotos of the old buildings and of course, the cannon and just enjoyed walking around.Second time we...More  ","tripadvisor_monas_415":"There are some laments that the buildings in this square are not being cared for properly, but I applaud the increasingly ramshackle nature of the colonial area, since it is a photographers' dream. While we were busy snapping away with our small mirrorless cameras we saw several more professional groups in action, placing amateur models in front of broken windows...More  ","tripadvisor_monas_416":"I loved spending time here to enjoy the ancient atmosphere.Luckily they still remained this beauty and kept this place rather well maintained.This was an old part of tge city, with old architectures.Too crowded to totally enjoy. This place was beautiful so it was not so amazed when it was crowded. But I recommend you go with a...More  ","tripadvisor_monas_417":"Just one word to fully describing this tourist attraction: CROWDED. The Old Town or Kota Tua really is an old part of the city, with many building retains its colonialism era architecture with their high ceiling and arching doors. Sadly most of the building wasn't well maintained for them becoming no more than an old ruins of an old days....More  ","tripadvisor_monas_418":"As a tourist from another country, this square display great daily life of Jakartans, and there are so many activities and shows here that you could actually enjoy. Food is also...read more ","tripadvisor_monas_419":"As a tourist from another country, this square display great daily life of Jakartans, and there are so many activities and shows here that you could actually enjoy. Food is also available everywhere and were great, from snack stalls to a restaurant called Cafe Batavia (quiet pricey). Museum actually overwhelm this place so i actually spent hours by just going...More  ","tripadvisor_monas_420":"Don't go alone make sure your with some locals to show you a good time and also so you do not get lost in the maze of streets and alleyways, also they can show you the very best places to eat.","tripadvisor_monas_421":"I always love to pay a visit to Jakarta old town. it keeps many hidden beauties which needs to be explored. Not only the fatahillah area, but areas like petak 9, sunda kelapa and the surrounding area are a must visit places","tripadvisor_monas_422":"Beautiful place with lot of old buildings that's been rarely seen in Jakarta, which will bring you new nice atmosphere in the crowded and hectic Jakarta. You can take lot of great pics with it as the background. Actually it will be a great historical/cultural landmark, IF the government want to give this place their concern to develope its potential...More  ","tripadvisor_monas_423":"Sad to see the condition of this place now. Lot of bulding are abandoned and ruins. Need to renovate to it's glory. It will be a superb tourim object if the gov and local community together pull back the economy activities to this area, beating the modern malls that too many around Jakarta. But still this place is good for...More  ","tripadvisor_monas_424":"It didn't live up to my expectations actually. Almost everything was written in Indonesia (barely some were written in English) so I hardly understood anything there (Luckily I did read the books before going). However, what I liked most was the Puppets' Museum! The owner was really nice and he introduced us to some of his artworks which were really...More  ","tripadvisor_monas_425":"Old Town is definitely one of the most interesting places you can go to while you're in Jakarta. The view will bring you back to probably those times when the Dutch was still reigning Batavia. The inconvenient part is its lack of cleanliness. The old buildings are also badly maintained. But still, I'd say you're missing a lot if you...More  ","tripadvisor_monas_426":"an extremely interesting part of jakarta housing many colonial buildings now converted into museums, local eateries.we found that this area of Jakarta was not heavily visited by foreigners ( possibly due to hot weather). it is common to find the traditional sectors of the cities teeming with tourists but the scene seemed to somewhat subdued here.there were several...More  ","tripadvisor_monas_427":"Jakarta is often suffocated under a wealth of negative publicity. Often disregarded by many who are unable to spare the time and patience to discover and understand the real city it lies redundant on many a travellers itinerary. Despite the thick smog that lingers low over the city and the heavily congested traffic that clog the capitals side streets it...More  ","tripadvisor_monas_428":"The market at the evening is nice, but the water in the river is so dirty.If you walk near the water you smell the sewerage and that's how it looks like as well.The buildings aren't well maintained and there ain't much to see.","tripadvisor_monas_429":"U can go kindly in the morning till noon if U like to take the picture here, because if night the light not friendly with U.The historical place but good space perfectly...read more ","tripadvisor_monas_430":"When you visited Jakarta, do not miss to visit the old railway station. This railway station was built in 1927 by the Dutch Colonial. It was a grandeur station with the european architecture and it has 8 lines for trains. The station was closed from 1980's to 2006. Now it's being renewed and open for public to visit. How do...More  ","tripadvisor_monas_431":"U can go kindly in the morning till noon if U like to take the picture here, because if night the light not friendly with U.The historical place but good space perfectly presentedin Jakarta Kota, U can take Ur meals here in Batavia Cafe....","tripadvisor_monas_432":"Old Town of Jakarta is an interesting place to see. People will see old colonial buildings in this area. Unfortunately some of the buildings are ruined. There are a few museums around. The Fatahillah Museum supposed to be a museum where we can learn about Jakarta and its history but the display is so boring and there are very little...More  ","tripadvisor_monas_433":"If you go to Jakarta, this place is a good spot for you to find great view from old town that still exist in Jakarta. Lot of snacks easy to find in here, but always be careful to eat in here, because some times it contain hazardous substances that can't be consume. One tip for new traveler, if you want...More  ","tripadvisor_monas_434":"Someone said in one of the previous reviews that Jakarta is a very \"uninspiring\" capital city and I tend to agree. But since you are there, please do see it all! After showing us the most \"inspiring\" areas: the National Museum, the National Monument, the Parliament and the Presidential Palace, Mr. Marcel, our guide from East Timor, took us to...More  ","tripadvisor_monas_435":"Bring you hats, shades, towel and cold tea... You can do Museum hopping to good ones like Museum Bank Indonesia, Bank Mandiri, Historical Museum, Wayang, Keramik are in this area. Or browse to old chinatown at Gloria and Petak Sembilan. Don't forget to visit Toko Merah, Jembatan Intan and Pelabuhan Sunda Kelapa and Museum Bahari for the full historical flashback....More  ","tripadvisor_monas_436":"Jakarta is old city which is changed its face under pressure growing population, but it is problem all Java. I visited centre of old Jakarta and on the small place you can see faded glory colonial world. In old harbor there is the same hard work as in the past and China town offers same fruit and next produce as...More  ","tripadvisor_monas_437":"old town here does not refer to rich in history, ait merely means run down, derelict and dilapidatedtraffic very bad too, in and out of old town","tripadvisor_monas_438":"\"Kota\" is one of the more noteworthy spots in this otherwise rather uninspiring capital city. If it were properly cared for and developed, it would be a real magnet for people who are looking for a colonial/historical backdrop. Unfortunately it is not (as yet). But it is anyway worth a visit when combined with a stop-over at Cafe Batavia.","tripadvisor_monas_439":"Try to walk around the Jakarta old town, and you'll be enchanted. Museum of Jakarta History (Fatahillah museum) which was the court during the colonial time as its epicentre will tell you about the life during colonial era . You might also enjoy ceramics and art museum and wayang (puppet museum). If you're starving, satisfy your appetite in Batavia cafe,...More  ","tripadvisor_monas_440":"Visiting the jakarta old town just bring you a lot of fun and excited experience. You will find a lot of skills here and its very simple though. You're just amazed that actually...read more ","tripadvisor_monas_441":"Seeking story and what left behinds those walls and buildings.. almost could not believe such a beautiful building was a prison long time ago. And all the museums also shows how rich indonesia are, on a place not bigger than times square. Always good for sightseeing and photo's object..","tripadvisor_monas_442":"Visiting the jakarta old town just bring you a lot of fun and excited experience. You will find a lot of skills here and its very simple though. You're just amazed that actually Jakarta culture is very rich indeed. You will find someone who psint all his body with black metallic paint and using Indonesia old military costume complete with...More  ","tripadvisor_monas_443":"It could be fantastic but instead it's rotting, decaying and the smell from the canal is pretty nauseous. However it does give you a sense of how it once was - it just needs a UNESCO listing to get the renovation moving.","tripadvisor_monas_444":"+ A very interesting part of Jakarta or Batavia people need to come and enjoy+ Old looking buildings are surrounded the main free hall+ Museum are right in front of the main hall+ In the main hall, traditional street foods are everywhere+ Live performances of music and arts are also everywhere to be found, including the...More  ","tripadvisor_monas_445":"Compared to the last time i visited the place it was much much better than what i would have anticipated! the square is isn't chaotic as it used to be, its cleaner and i would just never be bored if i had to go there again!","tripadvisor_monas_446":"The old Kota quarter is fun: 3 museums on the public square , very interesting . You reach the square by public Trans Jakarta bus korridor 1. You also can rent bikes on the square . I did not appreciate the walk to Sunda Kelapa , too much traffic, and very poor area where I didn´t feel safe.","tripadvisor_monas_447":"I agree with many of the reviewers below - this place is truly in need of some sort of rejuvenation. I went to Kota on a Sunday and it was extremely packed, with many Jakartans crowded in the square to watch some street performances and the like. Many street vendors selling all sorts of knick-knacks were also there. Cafe Batavia...More  ","tripadvisor_monas_448":"Nice view, keep the clean environment so everyone can enjoy the surrounding.. have an example from our neighbor Singapore for Clark Quey.. it can be a cozy and favorite place to go..","tripadvisor_monas_449":"Actually, I visited Old Town in June 2009, but there is no choice to the time that far. I found the place is interesting at the beginning, but besides the museum of Fatahillah and Cafe Batavia, only the buildings structure that interested me. The park condition was poor and too crowded. The museum interior itself was good and you would...More  ","tripadvisor_monas_450":"I love to visit this place. I feel the nuances so oldie but alive. I can feel that i'm in the middle of history (between yesterday and present). Dutch in Indonesia so much influence the Indo's history and heritage. But what I most like is that Batavia become the icon of the Oldie Djakarta!","tripadvisor_monas_451":"the Old Town Jakarta is largely the area surrounding the square old town center. I was there on a weekend when the street performers and vendors are at their most active. the...read more ","tripadvisor_monas_452":"the Old Town Jakarta is largely the area surrounding the square old town center. I was there on a weekend when the street performers and vendors are at their most active. the marionette museum off the side of the square is the best $0.50 you'll ever spend--air conditioned, great puppets and marionettes and a free punch and judy show. wander...More  ","tripadvisor_monas_453":"The buildings and history are great! When I was there I missed the puppet museum; the sepeda onthel (rental bikes) are iconic and worth about 15 min of entertainment ;) And at the post office, when the queue was long, the security guards organised chairs for everyone to sit down in :)Maybe go down to Pasar Mangga Dua afterwards...More  ","tripadvisor_monas_454":"Since kicking out the Dutch the Indos have pretty much condemned the city’s heritage like pretty much everything else, to ruin & decay. Incompetence is no way a skill but Indos seem to thrive at it, witness as Kota, once the magnificent city of Batavia literally falls apart before your eyes.Walking around the streets of Batavia’s Kota Tua area,...More  ","tripadvisor_monas_455":"nice to know about Jakarta. So many national history. Museum wayang is one of traditional place that you have to know. Good place for take some photo with ur camera.","tripadvisor_monas_456":"I enjoyed having lunch at Café Batavia. It almost reminds me of Amsterdam. It reflects the colonial Dutch settlement here. The restroom was interesting with all those pictures of celebrities. You must go there if you are in Jakarta. Highly recommended. I took the local bus there from my hotel. 3500Rp per trip- which is like 35 cents US.","tripadvisor_monas_457":"We spent a night in Jakarta at beginning of Intrepid tour. We would not really want to return. We walked around the Old Town and port.There was little to see and was grimy.","tripadvisor_monas_458":"We reached the area at about 3-ish in the afternoon but it began to rain. So, we took shelter at Cafe Batavia, had a meal there, then, when the rain stopped, proceeded to explore Fatahillah Square - I'm not saying much about the cafe or the square here as I have written about them respectively in separate reviews.By the...More  ","tripadvisor_monas_459":"Visited the Dutch quarter in Jakarta. Easy train trip from the main station. Very pretty area with vendors and lots of entertainment. Bicycles for hire in square with lovely hats for ladies. Walked to port whether there were some interesting boats. Would recommend Jakarta in August for national day. Night time entertainment in Jalan Jaksa which is fun. Locals very...More  ","tripadvisor_monas_460":"In bahasa we called it Kota Tua. This place was near from Museum fatahillah. The beauty of this city was on the building architecture. It deutch builidng style, I think. But some of the building was to old, and I heard from the news, that the Jakarta government will renovate this area, I hope it will done soon.","tripadvisor_monas_461":"This place / area actually have a lot of history, but somehow the government didn't really take this area seriously on the maintenance, sometimes they do all the renovation and make a proper tourist visit area but thru time those facility become bad and then just broken.I used to like hanging out in one cafe in front of fatahillah...More  ","tripadvisor_monas_462":"we can recall the old time when jakarta is name as jayakarta or batavia in netherland colonial time. it just a history","tripadvisor_monas_463":"we can recall the old time when jakarta is name as jayakarta or batavia in netherland colonial time. it just a history","tripadvisor_monas_464":"After seeing the modern shopping centers in CBD Jakarta, we decided to take a taxi to Jakarta Old Town. This was an eye-opening adventure. A local man approached us to offer his tour-guide service. His English was reasonable and he looked sincere. He told us he used to work as a English teacher but for the future of his 3...More  ","tripadvisor_monas_465":"If you are in Jakarta then you should stop here. It show how Jakarta was hundreds of years ago, but now the area is pretty dirty and abandoned. You can see that thy are working on icing it up, and as a preservationist I would love to see the building brought back to their old glory. The puppet museum was...More  ","tripadvisor_monas_466":"Nice to see some oud Colombiaanse buildings, but most of them are ruïnes. Café batavia is a place to visit. Expensieve but good to feel THE atmosphere of a century ago.","tripadvisor_monas_467":"This is a show that is held every year.In the anniversary of the city of Jakarta.There is live music, band music from the best grub in Indonesia.There is a wide range of products on offer.Plant products, food products, electronics, garments, and other more.!And much more fun entertainment.Very nice for holiday events and shopping.","tripadvisor_monas_468":"At least once, see the history of Jakarta. Well worth a visit, seeing the sights, sounds and various street stalls selling all manner of items.","tripadvisor_monas_469":"Went there twice, once at night and once in the morning. At night, there are street performance, bazaar at the square. Just mingle about with the locals. In morning, went to Museum Bank Indonesia, Museum Wayang, Museum Bank Mandiri, Museum of Arts. Nice to see the REAL Indonesia.","tripadvisor_monas_470":"It's definitely an old city as you can see from the Dutch influenced architecture that's still there,several museums and lots of street food  little shops to buy souvenirs,you could rent a bike and go around the old city,old bike not modern bike so it's unique,they also rent you a hat that would protect your face from the burning sun,one...More  ","tripadvisor_monas_471":"Whatever Jakartans think about their old town (Kota), it offered a semblence of serenity to this traveler. Even thought the buildings are often in disrepair, and it's quite difficult to cross some streets on foot due to the excessive car traffic (not to mention the honking), once inside the museums, other buildings, or plaza, one can actually come to appreciate...More  ","tripadvisor_monas_472":"The ideal of Jakarta Old Town is that it should be romantic, colonial historical area. With tourist pouring over taking pictures, feeding the pidgeons or just chilling in the cafes nearby. With professional touch, the place could be \"a must see\" attractions such the Trafalgar Square or something like that. Sadly, what really happens is quite the opposite.While the...More  ","tripadvisor_monas_473":"like to know the history. but to many people there I can not spent my time and consent on the object.","tripadvisor_monas_474":"like to know the history. but to many people there I can not spent my time and consent on the object.","tripadvisor_monas_475":"You must visit the Old Jakarta \"Kota\" to see how was Jakarta long time back. The old buildings still there, between the dutch and chinese blended together. Dont forget to pass by to the wet market. Its a must!","tripadvisor_monas_476":"Nice old decorated buildings and the atmosfear is good . Funny that large amounts of traffic through smaller roads that get out into bigger roads.","tripadvisor_monas_477":"eventho its quite dirty and pollution level is just really high, the Kota Tua is still a nice place to go. I prefer to take TransJakarta or Train as its really frustrating to use car (the traffic is just horrible)","tripadvisor_monas_478":"This square and surroundings can't be missed. good to combine with the harbour and off course world famous Café Batavia. During weekends the ideal hangout","tripadvisor_monas_479":"There are a couple of museums to share the Indonesian life. We went on a Sunday and lots of families were gathered. There were food vendors,balloon salesmen, jugglers, dragon dancers as well as other entertainers. Very colorful and lively area. And Cafe Batavia in the square was a very good choice for lunch!","tripadvisor_monas_480":"It's a very wrong and late prevention from Jakarta Government to make this legacy stays breathing. This place turns into trash and people selling everything around the old building. Not a very recommended place to visit in weekend.","tripadvisor_monas_481":"Im not sure how to rate this place. I visit this place many times from time to time as i work in Jakarta (though I come from Yogyakarta). First time I went to this place, I felt great! different vibe. I still got the colonialism feel! But as more people go this place, It becomes too crowded that I cant...More  ","tripadvisor_monas_482":"If you think that Indonesia used to be in colonialism? Think again. Coz it still is. Coz visiting Jakarta Old Town still makes me think that Indonesia is still in colonialism (with the wealth that we have naturally).","tripadvisor_monas_483":"Very nice to see a glimpse of Jakarta in the old days with cool colonial buildings. It is not so well maintained but still beautiful. Usually on weekends there are some historical community groups there wearing colonial costumes and ride old bikes, here it is called \"Onthel\" bike. You can also rent a bike and go around the Old Town...More  ","tripadvisor_monas_484":"A historical side where we can learn about Jakarta since pre-colonial and colonial era. Old City Hall, Railway Station, and some museum, with some boutique restos","tripadvisor_monas_485":"A historical side where we can learn about Jakarta since pre-colonial and colonial era. Old City Hall, Railway Station, and some museum, with some boutique restos","tripadvisor_monas_486":"When I go in the evening, the yard is too dirty, so many pedistarian not organize well. actually is a nice place, please a little bit touch up for make it more better and nice","tripadvisor_monas_487":"People are so nice and the Old Town with f.ex. the BATAVIA CAFE -it's easyly to walk and to enjoy all of this special Kota.","tripadvisor_monas_488":"Worth a quick look, but nothing to write home about. The buildings do not seem to have been well looked after, and there just is not much here. Missable.","tripadvisor_monas_489":"You can see the old buildings from the Dutch era and Fatahillah Museum where the Dutch ran the city in the old days. It's also one of the very few places in Jakarta where you can actually feel the pleasure of walking without being scared a vehicle would hit you.","tripadvisor_monas_490":"when indonesian people when to europe..guess where do they take pictures at...?!?! OLD CLASSICAL BUILDINGS....where DO HAVE also here (well offcourse not the same) but if they have good attention and care, those bldgs are pretty nice","tripadvisor_monas_491":"It could be a really good turistic atraction but they have to restor it more. Cafe Batavia is really nostalgic with nice food and ambiance. Must try in Jakarta!","tripadvisor_monas_492":"I didn't know much about this until a mate mentioned that I should have a stroll through and that's what we did ... our \"supir\" parked and we leapt out and enjoyed a good hour of walking around ... taking photos ... and then sampling a great drink and salad at a beautiful restaurant ... check out the amazing WC!","tripadvisor_monas_493":"I love old town and make it a point to visit the old town of the countries I visit. I have been to Jakarta many times on business for many years, this is the first time that I manage to get some time out to visit the Old Town. There are a number of interesting period buildings. My disappointment is...More  ","tripadvisor_monas_494":"the old town of jakarta is like in the middle of all the busy district,but once youre in it,its like a different world.you can rent bicycle to get around and its a really beautiful side of jakarta. surrounded by the colonial buldings and organized environment.","tripadvisor_monas_495":"I like the unique and beautiful architecture of the building but i don't like the smell of the river","tripadvisor_monas_496":"I like the unique and beautiful architecture of the building but i don't like the smell of the river","tripadvisor_monas_497":"This could be a fantastic attraction for Jakarta to be proud of - but it's not. I've heard the night market is good, but there is no way I would venture into this area after dark. The Fatahilah (Jakarta History Museum) is falling apart and filthy. Rent a bike, take some pictures, then head over to The Cafe Batavia -...More  ","tripadvisor_monas_498":"When you are in Jakarta for the first time, do not miss Old Town. It is all about history of the city and the people, from Governor house, post office, museums, banks, railway station, port, and many others. You can walk or ride a rented bicycle to tour around. Make your best effort to stop by at Cafe Batavia for...More  ","tripadvisor_monas_499":"The old part of Jakarta encompasses the bank museum, Fatahillah and the Shadow Puppet (wayang kulit) Museum. I'm not sure what else someone would do here for the \"second day,\" other than to hop on a train at Kota station to go to Bogor gardens.If kids are in tow, perhaps a visit to Taman Mini (all the way in...More  ","tripadvisor_monas_500":"not so many places in Jakarta where you can walk in open air ... looking alot of activities goin on and not worried somebody will bang you ... this is the place!!","tripadvisor_monas_501":"It had an old world charm with relics of Dutch people who once were here. The museum was beautiful and the ambience outside was excellent with colurful people and live music.","tripadvisor_monas_502":"A different view of Jakarta. The buildings bring us back to the colonial era, because not much buildings as in Old Town area still exist in any other places on Jakarta.Try to visit the area in weekday morning or lebaran moment when the place is less crowded","tripadvisor_monas_503":"This is the place where people at old time used to name Batavia as the Vanice of the East. We used to see canals, old docks, fortress, bridges and plaza. This is the place where the Dutch develop their colonial government, with the Governoor General Office at the center of colonial power. At that time, Batavia was one of the...More  ","tripadvisor_monas_504":"We spent an enjoyable afternoon walking in this area. It is a bit rundown and sort of shabby in ways but also very interesting. We did get a very good look at some Dutch history and buildings in the area. Shame to see the condition of some but it is also a representation of the economy these days for all...More  ","tripadvisor_monas_505":"My wife, 19 year old son, and I spent several enjoyable hours exploring Old Town. We watched a magic show and people riding bikes on Fatahillah Square, toured the Jakarta History Museum, the Wayang Museum, and the surprisingly nice and interesting Bank Indonesia museum. We also had a very nice lunch in the beautiful Cafe Batavia. If you go to...More  ","tripadvisor_monas_506":"some interesting buildings but there shape is unbelievably bad. however, worth seeing it if you don't fear dirt, smell and traffic jams on the way.","tripadvisor_monas_507":"some interesting buildings but there shape is unbelievably bad. however, worth seeing it if you don't fear dirt, smell and traffic jams on the way.","tripadvisor_monas_508":"This might have been the centre of Dutch Power in the East Indies.. Building dating from the 1800s, including the Governors mansion, Cafe Batavia, the Numismatic Museum, The Wayang Museum.. steeped in history..","tripadvisor_monas_509":"This large area has numerous Dutch-style buildings, and is worth a stroll. Its is also the location for a number of small but very interesting museums, including the MARITIME museum, Fine Arts and Ceramics Museum, Museum of Bank Indonesia, Mandiri Bank Museum, The Wayang Museum and the Historical Museum - each worth a visit. The Jakartakota Rail Terminus is also...More  ","tripadvisor_monas_510":"Taxi dropped me off at the Central Square which was interesting but since it was Monday, the museums were closed. Can't speak their language and I couldnot find anyone to show me around, I was hoping for a hop-on, hop-off bus but apparently there is none. Couldn't find a taxi driver who understood that I wanted to see the sights...More  ","tripadvisor_monas_511":"It is dirty, smelly, everything here it just really bad. Not interesting at all.","tripadvisor_monas_512":"Not worth the traffic unless you are fascinated by poverty and crowds.","tripadvisor_monas_513":"The picture of colonial culture is strongly visible on the building design that available around the area. It becomes the most attractive objects for many photographers that seek for the unique themes of old fashioned interest, it's like bringing the history back to life. Many couples choose this place for the pre-wed photo studio as the background can be very...More  ","tripadvisor_monas_514":"this is the old area and tourist, there are a lot of souvenir selling on the road, be careful to eat the food on the road if your stomach is not good, nice experience to ride bike around the area.","tripadvisor_monas_515":"some old buildings are still on good condition, but some are poor.nice place for photography","tripadvisor_monas_516":"I was expecting a little more in the way of maintenance and upkeep, as well as a larger number of landmarks. The area was packed with people (ALL of Jakarta is PACKED with people), and generally quite dirty and in disrepair. There were very few Westerners and few people spoke a non-Indonesian language. Skip Old Town in Jakarta and visit...More  ","tripadvisor_monas_517":"Located on the epicenter of Jakarta, the Old Town is very popular with their rickshaws, old bicycles and museums (Fatahillah Museum and Bank Mandiri Museum among them). This is...read more ","tripadvisor_monas_518":"Located on the epicenter of Jakarta, the Old Town is very popular with their rickshaws, old bicycles and museums (Fatahillah Museum and Bank Mandiri Museum among them). This is the must-to-go place for both local and foreign photographers and lots of pre-wedding photography are being taken here.","tripadvisor_monas_519":"place for bargain. Cheap prices! Watches, T-shorts, close......all what you need))) Nice, but expensive restaurant on the front of museum Sejarah. full of design!","tripadvisor_monas_520":"Difficult to get to on a bad day when traffic is slow but a good place to see colonial and historical buildings.","tripadvisor_monas_521":"Could be better in terms of cleanliness, but that is the job of not only the public officers but also the visitors.","tripadvisor_monas_522":"Take the time to walk around the square and visit some of the old historic buildings,catch the busway to get there as it is convenient and reasonable price","tripadvisor_monas_523":"the one in jakarta not very mall yes its,can bicycling with rented","tripadvisor_monas_524":"Like many things in Indonesia, an aura of neglect and decay hangs over the significant historical collection of objects on display in Jakarta Old Town. Lined on one side by a canal with a watery substance (but a bit gooey and black) in it, what you see is a square shaped block/collection of buildings that date back to colonial times,...More  ","tripadvisor_monas_525":"I should give more than 3 stars, I loved the Old Town of Jakarta until is ruined byt the street vendors, people who hang around there gave us bad impression. Not too mentioned quite dirty, I felt sorry the dutch gave a ways this beauty to jakarta","tripadvisor_monas_526":"We paid cheap entrance fee to go into the museum, but there hardly anything inside. At the end, we spend time in watching rare insect in the drainage. The building itself was awesome.That could be better if there are people or more writings telling us the historyRiver was filled with rubbish and there are household under the bridge,...More  ","tripadvisor_monas_527":"Well, the old town got so many to offer. It has museums, ports, and many kind of old building. If you are into photography, this place will excites you.I recommend you to take an \"ojek sepeda\" or bicycle taxi. Bicycle taxi is basically a service, which you will ride some bicycle, controlled by (usually) an old man. They will...More  ","tripadvisor_monas_528":"The Jakarta Old Town was recommended to us on a recent trip by hotel staff. It is mostly the old dutch part of Jakarta and has the \"famous\" Cafe Batavia there as well. It is quite...read more ","tripadvisor_monas_529":"The architecture was cool - theold town house and prison in particular. Lovely big square to relax in.Excellent food in Dutch cafe","tripadvisor_monas_530":"The Jakarta Old Town was recommended to us on a recent trip by hotel staff. It is mostly the old dutch part of Jakarta and has the \"famous\" Cafe Batavia there as well. It is quite nice for a look around and in the evening there are markets. We were taken there by a local guide and driver and I...More  ","tripadvisor_monas_531":"The Old town looks like poor remains of a provincial colonial town - not the heritage of the global mega-city. Few museums, pedestrianised part, happy people and Cafe Batavia are few highlights in the misery of left overs...","tripadvisor_monas_532":"I came to old town with my cousin husband, he is turkish and it is his first time to Jakarta, so I think it is a good idea to take him to the Old town. As soon we arrived, we watch traditional attraction, people eat fireball and get whipped, and they alright. And then we came to the museum, Gosh....what...More  ","tripadvisor_monas_533":"It was recommended place if you want some photo hunting in Jakarta. Classic environment, oldies building. Despite the environment not so clean, but it will be very great in your camera.","tripadvisor_monas_534":"If you like history of countries then Old Town with its distinctive Dutch architecture and mix of English and Dutch in most things, then you will love a wander around Old Town. There are many museums and the Javanese people are only too happy to show you around and talk about their heritage.","tripadvisor_monas_535":"Traffic, pollution, congestion. Not much of the old town to see.","tripadvisor_monas_536":"I was in Jakarta in March and April working for seven weeks and found the city a little challenging. Travelling by taxi or bus took ages due to road congestion and walking was not always pleasant due to pollution and heat. The old part of Jakarta centred around Batavia is somewhat disappointing, and particularly so after the write up it...More  ","tripadvisor_monas_537":"but you should have local guide to guide you there... to see another interesting spots like City station, and Sion curch. Don't go alone at night, please.","tripadvisor_monas_538":"Would be great if they spend more to maintain this authentic and down to earth part of Jakarta.","tripadvisor_monas_539":"the Jakarta old town can be managed and polished to attract more visitors. at present the beautiful buldings are mute, do not tell us the story they have been through. what a...read more ","tripadvisor_monas_540":"the Jakarta old town can be managed and polished to attract more visitors. at present the beautiful buldings are mute, do not tell us the story they have been through. what a shame! walking around the old town you will need to have an expert local guide who can take you back to the good old days. i personally found...More  ","tripadvisor_monas_541":"The place is full with people, traffic jam and old soon going to crumble rusty building that are not being taken care.","tripadvisor_monas_542":"Mostly this place interesting is old building built during Dutch colonial times. You can take pictures and sight seeing in this interesting place. Some of area still need maintenance..","tripadvisor_monas_543":"most buildings here built since Netherlands colonized Indonesia,some buildings renovated,interesting place to see.","tripadvisor_monas_544":"nice place to take picture, sometimes overcrowded in the weekend but satisfy my hunting mood","tripadvisor_monas_545":"The old town gives you a taste of old Batavia with a touch of the new generation. Good place to visit for some of the local culture.","tripadvisor_monas_546":"The buildings are deplorable - literally falling down apart from the few that are privately owned or museums. Such a shame and something should be done about it before it is too late. Very little information available unfortunately - need to do some research beforehand to make the most of the visit.","tripadvisor_monas_547":"a must-visited little part in Batavia !Why dont any of you visiting to this decent place ?","tripadvisor_monas_548":"Some buildings are old, clearly, but unfortunately they lack of maintenance and some are just left to rot. No clear information on the sites unless you have your own guide. But generally it is not so crowded as in any part in Jakarta. In weekend, there are just too many people here.","tripadvisor_monas_549":"If you're stuck in Jakarta, this is a part of time worth while visiting. Start at Sunda Kelapa - Visit the maritime museum and fish market and than work your way down to Fatahillah square. There you can enjoy a coffee at Cafe Batavia, and visit more museums or go further to Glodok (Chinatown).","tripadvisor_monas_550":"A great place to see colonial Jakarta, if only it was cleaner and better maintained. Allows for plenty of photo ops, far removed from the mundane high-rises of the city.","tripadvisor_monas_551":"A great place to see colonial Jakarta, if only it was cleaner and better maintained. Allows for plenty of photo ops, far removed from the mundane high-rises of the city.","tripadvisor_monas_552":"If I had two days in Jakarta, I wouldn't visit old town. There are far better things to do with your time. Three days, maybe, if you like crumbling buildings. (And we do.) They could make an attraction out of this place by putting up signs telling visitors what they are seeing, but the closest you come are young men...More  ","tripadvisor_monas_553":"The old town looks a bit tired and some of the building still need to be renovated. It's a shame because the ones that have been done look lovely.The old town is around a square which is pedestrianised however there are lots of people cycling around on the multi coloured bikes for rent. It becomes really crowded at the...More  ","tripadvisor_monas_554":"Nice place with old style from indonesia.. a lot of old building but still strong and full of history for each building on its past","tripadvisor_monas_555":"Kota, the old town in Jakarta, is the WORST historical center I have ever seen in 20 years of travels all around the world. Old building in bad state, nothing to see here. Garbage everywhere... I suggest you not to waste time here as you will just get traffic pollution, there are better places to see in Jakarta","tripadvisor_monas_556":"This place should be a great place. The historical places with amazing old building full of great stories. They could speak a thousand words of the awesome things that happened in the past.But...the reality...it is no more that abandoned ghost town with the abandoned rotten buildings that will collapse within years to come.What a pity!!!","tripadvisor_monas_557":"as everywhere in Asia the old buildings are not really preserved, a pity","tripadvisor_monas_558":"this place is planned by dutch goverment to be a new amsterdam,so you can still feel youre in amsterdam with its canal and old buildings...","tripadvisor_monas_559":"Graffiti and rubbish around, that's what I complain about.","tripadvisor_monas_560":"If you want to see the bustling metropolitan of Jakarta this is the place place to visit. Ready to get sweat, walk around and in the small way, beware of pick pocket but at the same time you will get everything you want to know about the real Jakarta !","tripadvisor_monas_561":"lot of dutch style buildings, a good place for pre wedding location.. lot of food stalls,","tripadvisor_monas_562":"lot of dutch style buildings, a good place for pre wedding location.. lot of food stalls,","tripadvisor_monas_563":"Like: The foods is worth to try (there are many exotic chinese foods), but I think you need vaccination first if you want to try them.Dislike:this area absolutely need renovation","tripadvisor_monas_564":"Big area with colonial building. Can rent colourful bicycle to see the area.Unfortunately, there are people there asking for money if you want to take photos of certain things i.e., antique cars.","tripadvisor_monas_565":"As Indonesian, i am proud to visit this area. Really nice sight seeing build on dutch colonial influence, really interesting. But it will be ever better if the government put more attention to this place, to organize and maintaining the buildings.. As it is now, its beautiful but not organize..even some building were not in the good shape, but generally...More  ","tripadvisor_monas_566":"I love Jakarta Old Town! On the fringe, you'll find old buildings, lots of urban decay (great for photography), and right in the middle of town, you'll find a large night market, vibrant, quint, and very local, where you'll find leg peddled children's rides (very cute), temp tattoos done via torchlights, lots o f small knick knacks, local food stalls...More  ","tripadvisor_monas_567":"old city of batavia or now is well known as jakarta is have the feeling of central europe if we see the building here, yes the building was build by Netherlands when they are occupying this capital. just the local Government seem not so much taking care of many building in this area so either their dusty or even neglected....More  ","tripadvisor_monas_568":"This area is good to see, but do not expect to much, it is just normal and nothing is historical","tripadvisor_monas_569":"This area has lots of great places to go to, if you want to experience Jakarta of the past, including trying out the local food places as well as seeing buildings from an era gone by... PROBLEM IS: how do you do that if you can't find your way around...make sure you have someone very familiar with the area to...More  ","tripadvisor_monas_570":"Although this area is dilapidated - or maybe even BECAUSE it is dilapidated - you get a real sense of what old Batavia must have been like, with its little canal, lined with old buildings either side, leading to the old port. All of this area is walkable, but try to do it early as it is hot and humid...More  ","tripadvisor_monas_571":"When you visit, go early, because traffic is especially bad in this part of town. Thankfully, there has recently opened a local train to transport people from central Jakarta to the North, which will make the Old Town (or Tua Kota) much more accessible.Some of the main attractions of the Old Town include Cafe Batavia, the Puppet (or Wayang)...More  ","tripadvisor_monas_572":"Beautiful old Dutch and British buildings but rather sad looking state due to decay.","tripadvisor_monas_573":"Beautiful old Dutch and British buildings but rather sad looking state due to decay.","tripadvisor_monas_574":"Many dutch buildings but almost all rotten, no maintenance. It s the reflection of the country, could be nice but missmanaged..","tripadvisor_monas_575":"This was one of our favourite parts of Jakarta as there was so much going on. It's crowded and busy with so many businesses, and has loads of character. If you stand back and look up at the buildings it's fabulous - there are businesses going on at ground level and historic buildings, hovels and all sorts of life going...More  ","tripadvisor_monas_576":"yes perfect way to see Old Jakarta from your eyes and your lenses. lots of old and historical buildings are still there (not some) and it is a favorite place for couples/friends/families/companies to take pictures for their special moments. go get your camera/DSLR/camcorder ready.tips: be careful of your belongings as one of my colleague lost her props for photo...More  "}