{
  "tripadvisor_monas_0": "This is wonderful concept of replicating the entire Country at one place with its varied architecture climate and culture. There are varied ways of seeing that may be through...read more ",
  "tripadvisor_monas_1": "I was here one afternoon and ate at one of the local resturant were then ride the cable car, the cable car was up on the motorbike again to get around, but it had not gone, you can rent a motorbike to get around where , you need a lot of time there if you want to see everything, possibly...More  ",
  "tripadvisor_monas_2": "Whether you are lone tourist or as group or visiting with your family, this Indonesian miniature park is worth to visit, since you will be introduced to understand as well as being shown the diversity of Indonesian rich culture from various ethnics. visit here don't miss the pavilion of Toraja, of West Sumatra, of West Papua and of course of...More  ",
  "tripadvisor_monas_3": "They're also known by Taman Mini Indonesia Indah (TMII).Showing the visitor an Indonesian culture from all provinces which came with a different style and language.Also in the same area, they offering a bird park, 3D theatre, orchid garden, snow bay, cable car and culinary experience.It's one of a must place to visit specially for tourist whose curious...More  ",
  "tripadvisor_monas_4": "it is a nice place to know about Indonesian Culture if you can't visit each one of them.Best option to do if you have less time is to do Cable ride & then visit Bird Park.Bird Park is must visit in Miniature Park.",
  "tripadvisor_monas_5": "This is wonderful concept of replicating the entire Country at one place with its varied architecture climate and culture. There are varied ways of seeing that may be through rope-way train or in your own car. To really feel place you need to have one full day devoted to this place but in few hours also you could have the...More  ",
  "tripadvisor_monas_6": "Fun experience to show how is archipelago and diversity of Indonesia in one complete place. The traditional housing, religions, islands and a lot of kind of things of Indonesia to see in a nice way of this place",
  "tripadvisor_monas_7": "As foreign visitor, the expectations are high but the reality is disappointing. The park is a mixture of fun fair and cultural heritage. For a mature couple interested in the cultural diversity this is difficult to visit, particularly on a Monday when most cultural heritage buildings are closed. In addition it is difficult to get to particular regional buildings because...More  ",
  "tripadvisor_monas_8": "The really good:Architectural beauty of Indonesia condensed in one - very large - space. Don't let the name 'taman mini' deceive you! Also, there are some performances that are quite nice. Go to information at the entrance, they are very helpful.The good but not great:The gondola gives you a nice overview, but it's a bit shabby. Not...More  ",
  "tripadvisor_monas_9": "Do allocate a day to visit this location. This is an attraction for the family. You can have a llok at the prominent structures of each country as well educate your children to the different cultures of each region and country.",
  "tripadvisor_monas_10": "This park is Indonesia’s answer to every visitor’s prayer to see the magnificent archipelago in just one day. The park represents Indonesia’s provinces and their outstanding characteristics, reflected most strikingly in the exact regional architecture of the province. Although it is called miniature of Indonesia, the buildings are not so small such as Madurodam in Holland. Houses in this park...More  ",
  "tripadvisor_monas_11": "This place needs at least 2 full days if you want to experience the entire park. However, we had one full day in the park and enjoyed every bit of it, since you get to see the...read more ",
  "tripadvisor_monas_12": "it is a nice place for learning about Indonesian Culture in such a smaller area if you can't visit each one of them.",
  "tripadvisor_monas_13": "I like to take my family here. There are many things to explore and learn. Both culturally and educationally. They have all of Indonesians' traditional houses and also museums.",
  "tripadvisor_monas_14": "This place needs at least 2 full days if you want to experience the entire park. However, we had one full day in the park and enjoyed every bit of it, since you get to see the entire history and culture of Indonesia.The highlights were the cable car, the IMAX theatre, The artificial islands and the large size ancient...More  ",
  "tripadvisor_monas_15": "This gigantic area of one stop recreational park. The main attraction used to be only the ethic houses & displays of Indonesian culture. Recent years, they expand it to many museums, children playground, imax theatre, flower dome & waterboom. If you want to enjoy the whole package, it will take you more than 1 day. You'd better rent a bike...More  ",
  "tripadvisor_monas_16": "Came w wife and 2 kids, our first day in Jakarta. Pretty empty while monday. 25k/person entrance and additional small fees to enter the separate parks inside. Reptile park was nice, with many snakes, lizards & crocodiles, including the Orah (komodo dragon). Kids loved that. Also nice to walk in birds park and among traditional indonesian architecture. For first time...More  ",
  "tripadvisor_monas_17": "A must see place for all tourists. It showcases ancient heritage houses from all islands of Indonesia. Handsomely painted one can stroll in the houses which display photos and dummies dressed in traditional dresses. Gives you an insight in the ancient traditions and culture of Indonesia.",
  "tripadvisor_monas_18": "The place is too huge that you really have to rent the motorcycles there. But unfortunately, I didnt as I was thinking of just walking there. The drawbacks are that the frequency of the tramp is just very frustrating. Could've been better. A wonderful place to see the whole Indonesia's cultural houses dances and experiences in one place.",
  "tripadvisor_monas_19": "If you want to see many kind of Indonesia's tradition, tribes, traditional attraction, most all of Indonesian traditional culture, but you just have a few day for it, you just need to go here. It has hostel, small hotel or big hotel near by. I just visited this place and stay almost 1 week during last year. And I enjoyed...More  ",
  "tripadvisor_monas_20": "love to bring my family here since indonesian culture are very variative and takes time and lot of money to travel them all. even im indonesian i didnt have chance yet to bring my family to all places in my own country, taman mini what its called are a must-go if you travel to jakarta and demand a city tour....More  ",
  "tripadvisor_monas_21": "Miniature of Indonesia island and culture...a must visit place. The entrance ticket is not expensive, very suitable for family sightseeing.",
  "tripadvisor_monas_22": "Indonesia with 5 big islands from the west to the East got hundreds thousands of small island, cultures and languages, to visit all in every island including small you need at...read more ",
  "tripadvisor_monas_23": "This place is so big with various attractions. As the name, it is Indonesia in small size. You can find more than 30 traditional houses with their own attractions such as dancing, song, music, etc.This place also has various museums, like Indonesia Museum, Fresh Water Museum, Science Center, and many parks you can enjoy with your family.Try the...More  ",
  "tripadvisor_monas_24": "Yes, your one day is not really enough to go around with all the beautiful spots inside, plus the rides and museums that speak about Indonesia and its rich culture.",
  "tripadvisor_monas_25": "I tried to Go thier using uber and the GPS coordinates exist on trip advisor ... we reached to very far plave from Jakarta the place is very poor not clean and far away from the capital . I spent more than 3.5 Hours in Uber because of traffic Jam also.",
  "tripadvisor_monas_26": "Indonesia with 5 big islands from the west to the East got hundreds thousands of small island, cultures and languages, to visit all in every island including small you need at least 3 years and half with minimum stay 3 or 4 days in every places! But you wont do that in one time right? This place Taman mini indonesia...More  ",
  "tripadvisor_monas_27": "Beautiful place to relax and view history especially Hakka Mini Section..take you time go round to see what attract you most.. Take lots photos for your future remembrance..",
  "tripadvisor_monas_28": "Do not go on a weekend!!! Absolutely crawling with locals. We spent an hour in traffic to get to the park from the city, thinking we would enter a nice serene park to stroll around...however, they actually let cars and bikes drive around the whole park, so there were smoggy traffic jams literally all through the park! No paths to...More  ",
  "tripadvisor_monas_29": "The museum near the entrance is worth visiting. The remaining parts of the park is either poorly maintained,disorganised or overcrowded with locals hanging out.",
  "tripadvisor_monas_30": "We had a brief visit at the Taman Mini Indonesia Indah as one of the highlights during an 8 hour Cruise shore tour of Jakarta. The tour guide gave us a humorously entertaining overview of Jakarta and Indonesia. He mentioned the history, the people, lifestyle, culture, their religion, education system, employment and etc. At the Mini Indonesia he gave us...More  ",
  "tripadvisor_monas_31": "It has been more than 2 decades ago.... TMII for a school trip they have all from science museum, keong theater, to mini islands and all the traditional houses and dresses from each cities of Indonesia",
  "tripadvisor_monas_32": "do you know how big Indonesia is?do you realize how many island in this archipelago are?do you even aware the odd of Indonesian culture?Well... you can find all the answers by visiting this beautiful and wonderful park!Once you are there... you'll be amazed. Awesome!!!",
  "tripadvisor_monas_33": "This place is brilliant! If you are willing to set aside about half-a-day to visit this place, you will indeed get a snap-shot working knowledge of what Indonesia is all...read more ",
  "tripadvisor_monas_34": "This place is brilliant! If you are willing to set aside about half-a-day to visit this place, you will indeed get a snap-shot working knowledge of what Indonesia is all about.Every province and culture, including religion is represented in this park. On top of this, they have various museums of interest. Your day in Jakarta will be complete with...More  ",
  "tripadvisor_monas_35": "this is all in one indonesia, go here very ealy monrning and go home late.. youc an explore all indonesia here.,. JUST HERE!!! no need flight ticket to go round indonesia lol",
  "tripadvisor_monas_36": "This park has many different attractions regarding the country of Indonesia. You can spend all day here with lots to do including a cable car ride, IMAX theater, and so much more.",
  "tripadvisor_monas_37": "This is the best place i visited in Indonesia. My son works in Jakarta and one of his clients lent us her car and chauffeur to drive us round. It's a huge place and you see more being driven or using a bike or scooter. It sums up all the Indonesian islands in one place and it's fascinating.So many...More  ",
  "tripadvisor_monas_38": "Good to see the history & culture of Indonesia from different parts. but needs modernisation. Downtown Jakarta is a melting pot of people, places, building, shopping malls, food variety, shopping, just unbelievable place. Friendly people.",
  "tripadvisor_monas_39": "TMII is worth a visit if you ever in Jakarta!My advice is to go from morning until evening because there are so many places to visit.You can visit museums,water world,street food and so much more!You can even rent a bike to cycle around the park because the park is so big!Beautiful scenery and if you're not a fan of crowded...More  ",
  "tripadvisor_monas_40": "Visit the Miniature park you will see all the different types of Houses of the Indonesian homes ....",
  "tripadvisor_monas_41": "We took a tour guide and went for a day through the park. We only visited one-third. It is full of history and the differences of Indonesian cultures. One needs a guide as there were not many descriptions in English.We were still fascinated how diverse Indonesia is, and it help make our plans of what places across Indonesia we...More  ",
  "tripadvisor_monas_42": "Indonesia being such a big country with its islands located around a vast sea area, it is almost impossible to visit all the attractive provinces during a single visit to the country. Since we only had planned to visit Jakarta and Bali during our trip last July, we thought to have a look at this place to get a small...More  ",
  "tripadvisor_monas_43": "I was really delighted to see so many colourful houses and temples in this area. We took some amazing photos. It took us around 100000 Indonesian Rupiahs to reach this place from the centre of Jakarta, then entrance was 10000. Cause the park is colossal and my friend and I did not have much free time, we took a train...More  ",
  "tripadvisor_monas_44": "The price is very affordable. The view is very beautiful. It is so Indonesia. I can see many Indonesian culture just in one spot here. Very recommend for children to learn many...read more ",
  "tripadvisor_monas_45": "The most famous theme park in Indonesia. This park is the embodiment of a grande idea of the so-called New Order era in Indonesia, to put all the vast elements of Indonesia's culture and history in one big place.A must visit for elementary students, and quite fun and enlightening for just everybody.Sadly, but predictable, this grand idea is...More  ",
  "tripadvisor_monas_46": "The price is very affordable. The view is very beautiful. It is so Indonesia. I can see many Indonesian culture just in one spot here. Very recommend for children to learn many things. The space is very wide and many museum too. Very relaxing place.",
  "tripadvisor_monas_47": "no need to tell it more, just visit it and you will see a \"huge\" and \"rich\" indonesia in \"small\" place. however its not a small place, but im suggest you to explore this park just by walking, or if you want more easier just rent a bike.",
  "tripadvisor_monas_48": "The entry ticket is quiet cheap, so no wonder if many of local tourists come here often. Especially on weekend, bunch of families are here. Even it's a very good place but sometimes it's dirty on the grass. Families come here and bring their own food from home and seat in on the grass eating it, just like having a...More  ",
  "tripadvisor_monas_49": "If you're pressed for time, this is the one place to go to in order to experience as much of Indonesia's varied cultures, peoples and architecture in a short time. The theme-park like venue features architecture that is typical to Indonesia's various provinces - the temples in Bali, thatched houses in Surabaya, stone-jumping wall of Nias Island, and so on....More  ",
  "tripadvisor_monas_50": "A huge place, could do with serious maintenance, but this makes it more Indonesian! Cable car is cool, gives you a sense of scale.",
  "tripadvisor_monas_51": "You need to rent a bike for you to visit the whole place. For us, we rented a double bike for 25,000 IDR for 1 hour. The whole park will show you the whole culture of Indonesia. Aside from the entrance fee from the main entrance, some mini parks requires additional fees.",
  "tripadvisor_monas_52": "we can explore 34 different culture from 34 different province of indonesia, from its meal, dance, language, costume, tradition, song, music instrument",
  "tripadvisor_monas_53": "The place is massive as has a lot of attractions mostly for kids. They don't have information in English anywhere, so it is a bit tricky to go around if you don't speak Bahasa Indonesia.You can rent a bike, go inside the park by car or walk.Remember to wear comfortable shoes and always bring an umbrella!",
  "tripadvisor_monas_54": "This is a huge park with a lot to see. You will need the whole day to see everything. Take the cable car for a birdseye view. Remember to allow plenty of travel time to and from TMII due to the constant traffic jams in Jakarta.",
  "tripadvisor_monas_55": "Nice place to visit to see the various representative houses of various Indo regions. It has a train,monorail and bus service which u can hop in and hop out upto 3 times. The Java...read more ",
  "tripadvisor_monas_56": "The park was delightful. It was like visiting several islands in a day. Good food. Lots to see and great entertainments.",
  "tripadvisor_monas_57": "Taman mini (miniature park) of Indonesia is a way to visit some parts of Indonesia in one day. There are also some Interesting museum that depict the glory of old days and also amusement park for kids who want adventure. It is usually very full during the weekends. So, it's best to go there early in the morning and leave...More  ",
  "tripadvisor_monas_58": "Big and large area with the various of attractions and expressed of Indonesian culture, planning and design is great",
  "tripadvisor_monas_59": "I recommend visiting it in weekdays. It gets very very crowded at the weekends. You can hardly find place for parking.It is very hot and it could be very tiring to try to see everything in one day.There are several things to see.İt is possible to rent a mini mobile car inside to go to places which...More  ",
  "tripadvisor_monas_60": "Nice place to visit to see the various representative houses of various Indo regions. It has a train,monorail and bus service which u can hop in and hop out upto 3 times. The Java and Bali houses were good as well. It has a lake where boating is allowed.",
  "tripadvisor_monas_61": "The park is big, but doable on foot in a whole day. It depends on what you want to see and do. We spent an afternoon there and saw all the pavilions and the museum of Indonesia. Entrance fee is 10.000, the pavilions are free and for museums or activities you have to pay extra.The park is defenetly hard...More  ",
  "tripadvisor_monas_62": "The park is very run down and the few staff there are disinterested.A long way to travel for very little",
  "tripadvisor_monas_63": "If you have one day to get a feel of Indonesia this is for you.It has a beautiful museum which is a must recommended you take a guide ( costs IDR 1000,000) they are helpful. Each part of Indonesia has a pavilion for you to explore their way of life. Save more time for Bali. Catch the Komodo Dragon...More  ",
  "tripadvisor_monas_64": "Start spending time at the Museum and guide is recommended who will plan your trip inside depending on your time.Do visit the Bali, Papua and East & West Java Pavillions. Catch the Komodo Dragon and IMAX 3D movie on destination Indonesia.A great sampler of what Indonesia has to offer",
  "tripadvisor_monas_65": "Recommended for educational traveling and enhance Indonesian heritage through every unique house represent each province in Indonesia.",
  "tripadvisor_monas_66": "It's very nice place with many scenic and places where we can have time passed or well spent. It's very close to Jakarta, a city where I lived (Mega Kuningan).. a must see for a...read more ",
  "tripadvisor_monas_67": "If you want an overview of Indonesia, this is the place to be. Showing all the places in Indonesia from culture to architecture. Spend an hour or two here would suffice.",
  "tripadvisor_monas_68": "A major, nightmare weekend traffic jam within the park as you are allowed to drive in the park to get to one point of interest to another. Not advisable to go by foot around the park with young children in toll.We ended up skipping all the highlights of the park, paid for the monorail ride to have a quick...More  ",
  "tripadvisor_monas_69": "This place from city centre need approx of 1-hour traveling by car or taxi. Watch out for peak season as it may be extreme traffic jam. This is a tourist spot place and as well as local family relaxation place especially during weekends. Whereby, you see more tourists in group and local coming for picnic and theme parks (games, boat...More  ",
  "tripadvisor_monas_70": "It's very nice place with many scenic and places where we can have time passed or well spent. It's very close to Jakarta, a city where I lived (Mega Kuningan).. a must see for a people who visit with short trip.. Suggestion -1. Dont try to cover everything in same day (it's impossible and will ruin your day).2....More  ",
  "tripadvisor_monas_71": "If u dont have time and money to explore indonesia country then u should come to this place. U will see indonesia culture here. They present each town (mostly big town in indonesia). From the house, dress etc. Not suitable for kids. Cos they will find it boring and tired. But a good place for teenager cos they can learn...More  ",
  "tripadvisor_monas_72": "Coming to TMII or Taman Mini, was my mission to introduce my homeland to my boyfriend, who is French, and my little nephew, who is Indonesian :DThe park has quite an improvement since i visited last in late 90's.We took the skylift to give the \"boys\" a bigger version of Indonesian map and a miniature take on how...More  ",
  "tripadvisor_monas_73": "One of the historic tourist interest to go in former President Soeharto era, the place is still open to public but most middle to upper income will rarely go, maybe once in a lifetime but...definitely not a place to have fun anymore. Poor maintenance on cable cars, only few food courts or food stalls and no good restaurants to go...More  ",
  "tripadvisor_monas_74": "great for people who wants to know indonesian culture in one day trip, because you can see traditional houses, culture, clothes, etc of each province/regionbut its kinda old and not well-maintained",
  "tripadvisor_monas_75": "When you stop in Jakarta. this one not to be missed, if not you will regret for not taking the time to see it. the whole house and art globally from each province in Indonesia here. especially home custom home very steeped in culture and civilization and cultural influence of the Dutch East Indies, China, Arab and Malay. in most...More  ",
  "tripadvisor_monas_76": "Taman Mini Indonesia Indah (TMII) is one of the attractive tourist spot in Jakarta. the place is very huge but you can ride the shuttle bus with cheap price. If you only have a short time to visit whole Indonesia or maybe you want to peek one of the city in Indonesia than you must visit TMII. Beside the miniature...More  ",
  "tripadvisor_monas_77": "Tmii is all indonesian cultures are there if youbdint have time to visit all indonesian province just visit tmii all indonesians province miniature is there.",
  "tripadvisor_monas_78": "Both times I've visited have been horrendous, due to the traffic IN the park. Why let cars and bikes into the attraction? It's not THAT big that you need a taxi to take you round... and even if you are unable to walk round, there is a public train (on wheels) or cable car available. What could be a leisurely...More  ",
  "tripadvisor_monas_79": "We visited Mini Indonesia as it was recommended to us in Jakarta. It turned out to be a horrible place with very limited toilet facilities and lack of choice for food.A simply horrible family day out!There were no baby changing facilities so I had nowhere to change the baby's nappy. Then there were no decent toilets for the...More  ",
  "tripadvisor_monas_80": "The traffic to leave while inside the park was horrendous... Over an hour to leave the place! Completely avoid visiting on weekends...",
  "tripadvisor_monas_81": "Tmii is all indonesian cultures are there if youbdint have time to visit all indonesian province just visit tmii all indonesians province miniature is there.",
  "tripadvisor_monas_82": "Fulfilled with miniature of the tribes' traditional house in Indonesia and various museums. there are also a pretty cool swimming pool and kids' Palace for your kids to play.",
  "tripadvisor_monas_83": "Yes, if you wanna tour all of island in Indonesia, but you don't have a time, you can going to Taman Mini Indonesia Indah (TMII) or Beautiful Indonesia in Minitature Park. You can find and see the distinctive building areas as well as cultural arts, Sumatera, Java, Kalimantan, Sulawesi, Maluku, Nusatenggara, Papua and much provience in all island. You can...More  ",
  "tripadvisor_monas_84": "Here u can see indonesia in small sizeOne of interesting object is train that move by wind powerSo no electricity neededNo pollution train",
  "tripadvisor_monas_85": "TMII was surprisingly huge. I really loved all the traditional houses from different parts of Indonesia. The details on some of them were exquisite. And they really showed how diverse Indonesia is. It helped that the entrance fee to the park was only IDR 10 000.One of the main draws was also the Bird Park within TMII. I was...More  ",
  "tripadvisor_monas_86": "Place is crowded but it is nice to see locals celebrate idul fitri with family. Queue for attraction is enormous so prepare yourself. Food is cheap, no tourist price there. Good for a day trip",
  "tripadvisor_monas_87": "Visiting Jakarta Lounge for my nephew remedial school task. Two storeys small building in front of Christian Church. Full of replicas of Jakarta's local heritage and culture. On the ground floor: Ondel ondel, local dress for various ceremonies, with its armories, while the upper floor shows the history of Jakarta, and on the outside many local food (kerak telor, soto...More  ",
  "tripadvisor_monas_88": "trip with the kids or not, TMII worth to visit, a lot of museum and educational places and also have fun, i just hope the animal treated better, but aside of it, tmii is full of...read more ",
  "tripadvisor_monas_89": "trip with the kids or not, TMII worth to visit, a lot of museum and educational places and also have fun, i just hope the animal treated better, but aside of it, tmii is full of knowledge place specially to getting to know more about Indonesia and its culture ...",
  "tripadvisor_monas_90": "Great for everyone and has alot of history walking around and looking at buildings and how they lived before the history is great and many small shops around there is also a tram . Train and cable car",
  "tripadvisor_monas_91": "Beautiful Indonesia Miniature Park is not miniature at all. Don't be disillusioned by the name of this park. It would be advisable to rent a car to bring you around the park to see the 36 different house in the different regions in Indonesia. It is advisable to go in the morning. Most of the individual entrance to the 36...More  ",
  "tripadvisor_monas_92": "Locate at East Jakarta reqion, can be get by Toll gate Taman Mini or alternative road.On This location visiotor can to find of Tarditioanl housing from all Indonesia Province,Insect Musem, Orhid park,Bigest Water Aquarium, Burd Park,firdt sky line train in Indonesia,Big Mosques, Churk, Mini Temple, Komodo Museum,smal train arena.The TMII, equip by 4star Hotel, 3 star Dormitory, function...More  ",
  "tripadvisor_monas_93": "More and more i got Information from my guide Mr. Edward from Ladita Tour Jakarta, he told to me in here you can explore Indonesia in one day !even my mom from Medan, but i don't really know about this culture, by my guide he told me so exciting !Thank's for my city tour Ladita Tour Jakarta !",
  "tripadvisor_monas_94": "Taman Mini Indonesia is similar to the Philippines' Nayong Pilipino: it is the country in miniature. The concept is good, as visitors, especially tourists, will see in a day how houses and other community structures look in the different provinces of Indonesia. Visitors also get a glimpse of the Indonesian way of life as some products are on display. Our...More  ",
  "tripadvisor_monas_95": "Nice but its not well maintain! Garbage are anywhere.. We enjoy our tour & see different places in Miniatures.. You should have car to roam around cause the place is big. Entrance fee is minimal. They should maintain the place cause its beautiful.",
  "tripadvisor_monas_96": "Huge park that offers activities and attractions to experience different cultures of Indonesia in one place. The mini-lake with miniature Indonesian islands is a must-see. You could take a water-bike or duck-ride in the lake, or you could take the sightseeing route by getting in the cable car or monorail.You could chill and relax near the lake or in...More  ",
  "tripadvisor_monas_97": "Huge and wonderful place... I had my first time ride of motorbike.. And It was lovely and the people were friendly.",
  "tripadvisor_monas_98": "Unexpensive and offers vast attraction, this place is great for family picnic and education. Other than cultural miniature of traditional house of ethnic in indonesia, it also offer various museum, sea-world like taman-akuarium-air-tawar, disney's themed castle istana-anak-anak-indonesia and monorail encircling the area. The park is at best during 90's, nowadays some of the attractions is unmaintained.",
  "tripadvisor_monas_99": "This is a legendary miniature park located in Jakarta. This park was first inaugurated in 1975. So it was quite old but still has some new features built.In this park you can...read more ",
  "tripadvisor_monas_100": "Before you go anywhere in Indonesia you can start here, as you will learn to know most cultural significant aspects of the archipelago.",
  "tripadvisor_monas_101": "It is good place to know about Indonesia and its culture, archipelago, and many other information. Unfortunately this theme park are not so up to date. But it still lovely place to spend time, especially if you want to have a brief review of Indonesia.",
  "tripadvisor_monas_102": "This is a legendary miniature park located in Jakarta. This park was first inaugurated in 1975. So it was quite old but still has some new features built.In this park you can find multiple museums and pavilions. There are 16 museums; transportation museum, oil & gas museum, telecommunication museum, sports museum, insects museum, etc.Main attraction in this park...More  ",
  "tripadvisor_monas_103": "This place is the best way to introduce and show parts of indonesia with it's culture, house model and souvenir. Everything is nice and good concept to represent each provences. But need a good management to renovate and keep it clean.",
  "tripadvisor_monas_104": "I visit the aquarium museum and enjoy the duck ride. Most museum does not provide English guidance and no English speaking guide is available. Most museum feel outdated, but still fun for kids. The cost of souvenir in here tends to be really cheap with no need for bargain because of the price tag. They have some tribe ritual such...More  ",
  "tripadvisor_monas_105": "nice place for family especially for kids. this place have a lot of information about indonesian's culture included their traditional house, arts, food etc. maybe need some restoration and maintenance for some of the areas like the toilet and building.",
  "tripadvisor_monas_106": "This park is one of a kind in Indonesia. Very large. Many thing to learn about Indonesia. There are complete display of all Indonesian culture, house, traditional outfit, etc.also there are some museum, a IMAX theathere showing about Indonesian heritage . It is a very good place for young kids to learn about Indonesia. very fun.",
  "tripadvisor_monas_107": "I'm sure at one point, maybe 20+ years ago, this was a lovely theme park. It looks however as if no-one has done any maintenance or upkeep in that long. I loved seeing all the houses from the different regions but like many of the museums in this country, the lighting was poor on the displays and the whole place...More  ",
  "tripadvisor_monas_108": "If you want to go to this place, better be ready to see packed of people, cars and motorcycles. Most of the time crowded especially on the weekend. Try to come during the weekdays if you come to visit.They need to have more public bathroom since if this place is quite open and not clear sign need to ask...More  ",
  "tripadvisor_monas_109": "This is a must visit place in Jakarta. It is a place where majority of Indonesian culture can be seen, from traditional houses, attires, as well as religious sites. There is also Chinese Indonesian museum, which is a recognition that Chinese Indonesian is also part of rich Indonesian culture.",
  "tripadvisor_monas_110": "Come to Taman Mini Indonesia Indah (TMII) if you have only very short time in Jakarta/Indonesia. You will see the representation of culture of the country. Best go with locals so...read more ",
  "tripadvisor_monas_111": "Come to Taman Mini Indonesia Indah (TMII) if you have only very short time in Jakarta/Indonesia. You will see the representation of culture of the country. Best go with locals so he/she may explain you about the country in general. It's good place to visit with family. Yes, it's an old park but still worth a visit especially when your...More  ",
  "tripadvisor_monas_112": "better to visit this indonesian in miniature park on weekend then you will see any attraction on every traditional house and don't forget to visit the traditional house of west sumatra and even this traditional house it's been visited the prince charles and Lady Diana in a few years ago it is one of the biggest traditional house which is...More  ",
  "tripadvisor_monas_113": "I enjoyed this, although it was sort of an accidental/spontaneous excursion. I made the rather bold decision to ride the cable-car above the park, which had me fearing for my life. At a height of 192cm and weighing in at about 100kg, I'm not completely certain that the builders of the cable car had my dimensions in mind as a...More  ",
  "tripadvisor_monas_114": "old amusement park trying to catch up with modern world, what can I say more? so many old stuff from the 90's (even if they already added up some new & modern part) yet it still left behind all other new amusement park. not to mention it was lowly maintained. the price started to get overpriced for this old-school kind...More  ",
  "tripadvisor_monas_115": "this is a very nice place to know about Indonesia.you can see so many culture here, from Sabang to Marauke with fun.",
  "tripadvisor_monas_116": "We visited Taman Legenda Keong Mas in TMII complex last weekend, and we loved it. Especially the Dinosaur Park. Because it's new, it's still pretty clean (except the lake), and the staffs were extremely helpful and friendly. Make sure you arrive early to avoid the crowds and heat.",
  "tripadvisor_monas_117": "If you have little time stay in Jakarta and want to have a good snapshot of the overall Indonesia culture, this is the place.Not only because you'll find here some of the typical handcraft, houses, colors and people from each Indonesian region available to explain and show, but also because you'll find a huge amount of local people getting...More  ",
  "tripadvisor_monas_118": "A very pleasant view along with the beautiful dresses and the crafts. This museum has three floors : First floor relates to dresses and Indonesian musical instruments ; the Second floor for coins and the third floor for crafts. The most beautiful part is the view and the garden surrounding the building. by visiting this museum , you can also...More  ",
  "tripadvisor_monas_119": "I have visited Indonesia Miniature Park several times and it was never enough for me. We are lucky to live in Indonesia and have and posses a multi and different cultures, art and so much more and all the islands. God has given us, the Indonesian people so much richness and abundance. Having been a guide and bringing tourists to...More  ",
  "tripadvisor_monas_120": "A very big cultural park, represent the culture of Indonesia. This park is consist hundreds of small thematic parks. Unfortunately in my humble opinion, it needs big maintenance. So sad to see many parks of this park become wrecks, like Cactus Park, etc.Yet couples of new parks are built and very nice like Sky World and Tionghoa Cultural Park.",
  "tripadvisor_monas_121": "The main area of the park is replicas of houses from all the provinces of Indonesia and replicas of places of worship of the difference religions in Indonesia. These are free once...read more ",
  "tripadvisor_monas_122": "I just visit TMII by car. The road inside is narrow, cars parked besides of road make difficult to go through. The parks is dirty. When we go inside traditional houses, the rooms were dark, humid and hot, no air con. The showcase wasn't clear, old and dusty. The management should improve a lot. We try cable car and it...More  ",
  "tripadvisor_monas_123": "It's been a long time for me and my brother not visiting this place. This Indonesian miniature is suitable for school study visit. Yeah, I think it is good for the kids to know their national identity, Indonesian culture by visiting TMII. But not only for kids, with many attractions, TMII is a good place to visit, I promise.But...More  ",
  "tripadvisor_monas_124": "The main area of the park is replicas of houses from all the provinces of Indonesia and replicas of places of worship of the difference religions in Indonesia. These are free once you get the entrance tickets. In addition to this there are several museums, amusement parks, bird parks and gardens. Many of these charge separate entrance fees. Of the...More  ",
  "tripadvisor_monas_125": "Beautiful Indonesia in Miniature Park is universally known as \"Taman Mini.\" Going to Jakarta and missing out on seeing Taman Mini would be like going to New York City to New York City and not ascending the Empire State Building. All the locals would say \"Wah! You haven't seen Taman Mini?\" I don't think it's all that great -- it's...More  ",
  "tripadvisor_monas_126": "See all the traditional homes around Indonesia and be educated on their vast culture! First visit to Indonesia? Head here to learn more!",
  "tripadvisor_monas_127": "On Friday, 6 May 2016 me and my family went to TMII for refreshing and introduce to the children about the traditions and cultures.About 3 years we are not go there. We are hoping the place still beautiful like 3 years ago but not all. Some of places are on progress for rebuilding, there are train lines unused, some...More  ",
  "tripadvisor_monas_128": "I would think it is busy here everyday week days school groups weekends family's I would seem to be you of the place the indoniseans go to see there own country's history and culture.As a forfend it was ok nothing to special but worth a look as there is not to many days out in Jakarta for the family",
  "tripadvisor_monas_129": "Just went there yesterday it was weekdays, not so many ppl but not completely empty too... its quite cheap, lots to do n see... if u dont have car there's a lot of rental cars, or motorcycle or bicycle, or u can just use the car from tmii, many ways to explore.. we choose to do it by walking its...More  ",
  "tripadvisor_monas_130": "Very good miniature for the whole of Indonesia representative province. Depicting the traditional house of other island of Indonesia. We enjoyed this place, exploring some part of the area but too many local people. The weather was so hot so hard to roam around!",
  "tripadvisor_monas_131": "I walked through this huge expanse this morning and I think I only saw half of what's on offer. It needs more signposting and directions in English too. The buildings are grand but fail to really document the associated history.The space and stars centre was really good and the gondola a highlight. Pretty clean and well maintained exhibits but...More  ",
  "tripadvisor_monas_132": "Calm, Nice, free from traffics around surroundings (not sure when major public holiday like Idul Fitri). Nice place to learn in brief Indonesian traditional house buildings, arts...read more ",
  "tripadvisor_monas_133": "The most united Educative on Indonesian ethnic group,culture & huge Traditional inDifferent ethnic Architecture. :-)",
  "tripadvisor_monas_134": "This miniature park is not like the Madurodam in Scheveningen, the Hague in the Netherlands -where you can spend half a day (or a bit more) to enjoy the 1:25 scale of the actual size of the country's points of interest.Beautiful Indonesia in Miniature Park is a humongous 150 hectare park that houses real-sized traditional buildings of each of...More  ",
  "tripadvisor_monas_135": "The copy of the island that we can look from top by Gondola for me was amazing. Also the property such as traditional house of Indonesian from Javanesse, Sumatera, Kalimantan, Sulawesi and Irian Jaya. Traditional uniform, the dance, and many more. Children can rent the bike for an hour and explore all these area.Dont forget to enjoy Keong Emas,...More  ",
  "tripadvisor_monas_136": "I wanted to give this attraction good feedback but I just couldn't do it. There's just so much wrong here. First, why would the actual park be called Taman Mini and Indonesia Indah but be listed on TripAdvisor as Beautiful Indonesia in Mini Park? Who would know to look for thatt? Before discovering that ridiculousness, I was gonna give this...More  ",
  "tripadvisor_monas_137": "If you can't go to visit all the place in Indonesia, you can go to Taman Mini Indonesia Indah, and you can see how beautiful Indonesia.",
  "tripadvisor_monas_138": "yes, TMII is trying to be a representative of Indonesia geographically, culturally, and so on inside, they put all the main icon of place in Indonesia. its a good place to know generally about Indonesia is.",
  "tripadvisor_monas_139": "Calm, Nice, free from traffics around surroundings (not sure when major public holiday like Idul Fitri). Nice place to learn in brief Indonesian traditional house buildings, arts & cultures",
  "tripadvisor_monas_140": "A very big big place where you can go with your family or friends. You can decide to come back several time and spend your time to see birds, or the cloth and tradition museum, or enjoy outside tour observing traditional houses from all Indonesia. Actually is very big and you can understand little bit more of this amazing country...More  ",
  "tripadvisor_monas_141": "Have no time to travel all around Indonesia? Want to know more about Indonesian culture? Go here! This place summarize all traditional culture from all part of Indonesia in 1 place. This place is huge. Better go early in the morning to avoid all the crowd as it could be very crowded with local tourist especially during long weekend.",
  "tripadvisor_monas_142": "If you dont have the time and the luxury to visit all the landmarks of Indonesia then visit this place. Taman Mini as the locals call it, showcases almost all of Indonesia's tourist attractions throughout the country. It's nice to roam around and take pictures of different spots in just one location. Just make sure you have sunblock and water...More  ",
  "tripadvisor_monas_143": "Went on a very sunny day. the visitors as well as the park officials were all friendly and very informative. the different styles of architecture were expecially nice to see- If...read more ",
  "tripadvisor_monas_144": "Went on a very sunny day. the visitors as well as the park officials were all friendly and very informative. the different styles of architecture were expecially nice to see- If you don't have the opportunity to visit a lot of Indonesia on your trip. visit Taman Mini. Of course it's not the same as visiting the actual places, but...More  ",
  "tripadvisor_monas_145": "I never could imagine such beautifully planned and organized depiction about the provinces of Indonesia .Its really first hand information to know the whereabouts of its origin.",
  "tripadvisor_monas_146": "During my childhood, I enjoyed my trip to this place as they have keong emas to watch the 1st 3D IMAX movie, we can see miniature of Indonesian islands and we can learn each culture of Indonesian provinces. Not to forget the bird house and few museums. Recent visit, they are not so focused on the Indonesian culture itself but...More  ",
  "tripadvisor_monas_147": "Very enjoyable for first timers. A wonderfully landscaped architectural treasure. Magnificent authentic replicas of all the regions of the Indonesian islands. take the cable car for less than 3 dollars and watch the scenes from above, quite picturesque! Very green areas and restaurants of fast food will allow you to rest and take in the views. Located in woody cool...More  ",
  "tripadvisor_monas_148": "Fascinating place, with miniature of Indonesia Islands and culture.A must visit place for foreigners or people from outside jakarta.",
  "tripadvisor_monas_149": "This park is big and colourful. The colourful carvings is something very unique, we took diff. pics of those carvings . there is a small shop for small titbits .speciality of indonesia.The garden is lovely with big trees giving shade to tourists.really nice.",
  "tripadvisor_monas_150": "Attraction provides a good glimpse into Indonesian culture & tradition. A very good concept as the attractions are miniatures of many historic landmarks. Very touristy and fits well in case you are on a short visit.Only drawback - place needs maintenance and the uplift can be certainly add lot of life into it. I would rate it 3.5",
  "tripadvisor_monas_151": "We went a bit late. The houses close at 4.00p.m. Quite frustrated. So we took cable car to view the area. The entrance fee is IDR10,000 per person and IDR10,000 for the car/van. The cable car fees is IDR40,000 per person",
  "tripadvisor_monas_152": "To travel around Indonesia will take you months. 34 provinces with various interesting destination will attract you to stay longer and longer in this beautiful country.So, if you have only few days in Jakarta, the capital city of Indonesia, this Miniature Park will give you a general picture about this country.And you will find more than 10 unique...More  ",
  "tripadvisor_monas_153": "Indonesia in one place, that's why it is called \"Beautiful Indonesia Mini Park\"If you want to learn about culture from various locations in Indonesia, this is the place. TMII have various spot called \"Anjungan\" which shows all the traditional aspect from many tribes in Indonesia. On the center of the park, there is a big lake with small island...More  ",
  "tripadvisor_monas_154": "We spent about 4-5 hours wandering around this attraction. Lots of lovely old costumes and info about Indonesia and the influences of each part of the country. We found the more...read more ",
  "tripadvisor_monas_155": "We spent about 4-5 hours wandering around this attraction. Lots of lovely old costumes and info about Indonesia and the influences of each part of the country. We found the more interactive/fun parts toward the exit end, but overall it was an enjoyable day. Lots of detail put into each building.",
  "tripadvisor_monas_156": "fastest way to know Indonesia, every province in Indonesia has a miniature feature with its local culture, recommend you to try gondola, train & waterboom. Almost every landmark in Indonesia can be seen here",
  "tripadvisor_monas_157": "It's a beautiful park with replicas of all kind of architecture from all the indonesian islands and vegetation.",
  "tripadvisor_monas_158": "This place is a good idea, but it's poorly maintained and poorly curated. With many of the regional displays you have to walk in and then back out to the road to get to the next one. On some you can walk in between, but there is no singage in between, so you don't know what regions display you are...More  ",
  "tripadvisor_monas_159": "We enjoyed the dioramas and museums that gave a slice of Indonesian culture. Transportation inside was disappointing; we waited endlessly for the hop-on bus to take us around as the place is massive and it was extremely hot and humid but the bus came around more than 5 times within an hour and left us waiting in the blazing sun!...More  ",
  "tripadvisor_monas_160": "if u come to jakarta or indonesia , specially as tourits u must come to taman mini, u can see the miniatur of indonesia . just prepare to long walk n enjoy it",
  "tripadvisor_monas_161": "There are traditional houses spread along this big landscape, they represent all of Indonesian tribes hall, they are very unique and amazing. As this place built and opened since 1975, it means those traditional houses was almost 100 years old. The founder are very brilliant. although, Indonesia's goverment must do some improvement and maintenance.",
  "tripadvisor_monas_162": "I did not have enough time to travel to the various sites in Indonesia so this was a quick substitute. It's a little run down but an over all decent experience.",
  "tripadvisor_monas_163": "You can see whole Indonesian without travelling far away. Crowded at the weekend, traffic jam in the access to ticket locket. Traditional houses, dance and arts indulge your eyes and brain.",
  "tripadvisor_monas_164": "Visited several times, when I was kid and lately.It was one of awesome tourism's place long time ago about 15 years ago. The point, now days this place definitely need more improvement in everywhere and need more maintenance. (Since it will be a long lists of the cons)Not worth to revisited.Unless they updated most of the attractions...More  ",
  "tripadvisor_monas_165": "This Beautiful Indonesia Miniature Park cover very big area and here we can learn and see Indonesia in one day. We can see the Traditional Houses from the ethnic people...read more ",
  "tripadvisor_monas_166": "This Beautiful Indonesia Miniature Park cover very big area and here we can learn and see Indonesia in one day. We can see the Traditional Houses from the ethnic people / Province from indonesia. We can see many museum like Transport Museum, Fish Museum, Electricity Museum, etc. Very nice place to visit and we can also enjoy the gondola but...More  ",
  "tripadvisor_monas_167": "Its amazing place to visit before you make around the country of Indonesia Tour .So before you decide your plan to make around Indonesia Country Tour You must visit Taman Mini Indonesia Theme Park first",
  "tripadvisor_monas_168": "The concierge at my hotel recommended this park and I'm really glad she did. Excellent place to learn about all of the different and wonderful cultures that make up Indonesia. From temples to other landmarks, this park is truly satisfying. make sure to visit when you go to Jakarta.",
  "tripadvisor_monas_169": "i wanted to show my sister who came from Holland what Indonesia actually has. The beauty of its own culture. Didnt had much time, so we choose Taman Mini Indonesia Indah. Showed her city icons, culture and shows her 'Mini Indonesia' from up above. Each section had their own things to show, even they had streetfood at the front gate....More  ",
  "tripadvisor_monas_170": "Yes,It's about the 'Taman Mini Indonesia Indah' or Beautiful Indonesia Miniature Park. Here we passed one of our best ever summer days in Jakarta.The park,having an area of 1 sq.km,is a culture based recreational area in east Jakarta & really a favourite place for holiday makers. If you don't have time to tour around Indonesia,you must come here to see...More  ",
  "tripadvisor_monas_171": "Jakarta will be a good place for you to start your trans Indonesia trip. TMII Gives you a feel of Indonesia culture and architecture. There are traditional dance show on the weekend. And for each region houses, there are info and free pamphlet for you. There will haggler who will haggle you to buys photos from them.",
  "tripadvisor_monas_172": "What a wonderful place! Need plenty of time whether walking or driving. Every area is unique! Love the lake which is a replica of the Indonesian islands!",
  "tripadvisor_monas_173": "This huge park is an amousement park with the entrance ticket 10k ird, but for many things you need to pay again.The park has some museums, many traditional buildings, cable car, little train and a high train. If you want to stay here and enjoy it, than reserve for it all the day, otherwise it is enought 2-3 hours...More  ",
  "tripadvisor_monas_174": "It's buteaful place need more care and Caffè shops and restaurants it's quite but need take care about the green land and activate more actives in that park",
  "tripadvisor_monas_175": "They have an event on sunday morning. It's really nice they performed traditional dances directly from Kalimantan with their full traditional dress, music instruments and singer.They welcome the guest and gave us a goodie bag, a souvenir, snack and lunch.It's pity not many guest coming. Only a few tourist to come. TMII should promote more and update all...More  ",
  "tripadvisor_monas_176": "There r 27 miniature of traditional houses in Indonesia, there U can learn abt culture in each province in Indonesia. beside dat U can go 2 Imx theater n Snowbay water park.",
  "tripadvisor_monas_177": "Taman Mini, a miniature city which has life size models and museums depicting different provinces of Indonesia. Seeing the cultural heritage of Indonesia with its close links to the Indian culture and seeing different adaptations of Ramayan/Mahabharat was memorable. We happened to visit on a day which was some kind of anniversary and so a carnival was on with lots...More  ",
  "tripadvisor_monas_178": "There r 27 miniature of traditional houses in Indonesia, there U can learn abt culture in each province in Indonesia. beside dat U can go 2 Imx theater n Snowbay water park.",
  "tripadvisor_monas_179": "When I told my friends that I am going to Jakarta, they asked me why would I want to go there... and they were Indonesians!!! They told me the city is busy with bad traffic, pollution, malls and buildings. Nothing to see there! Luckily, I met my Uncle who now resides in Jakarta. He took me around the city. We...More  ",
  "tripadvisor_monas_180": "I've visit Taman Mini Indonesia Indah after 20 years...This place need a lot of maintenance...Hard to find food or restaurant... Just a few fried chicken resto inside the area",
  "tripadvisor_monas_181": "A total money saver to sample the best of Indonesian archipelago, at least before you decide which island to visit.With only less than 3US$ per person, you can tour the miniature of Indonesia, complete with its culture, traditional attires, dishes, houses and legit information in one day.I enjoy taking my daughter here as the site gives us more...More  ",
  "tripadvisor_monas_182": "Must visit for all travelers to get a feel of the country, its culture, tradition, and know about different provinces housing, animal, vegetation etc.",
  "tripadvisor_monas_183": "We visited Taman Mini shortly after our arrival to Jakarta. It was a unique experience in that you can see a bit of culture & architectural design represented from each of the main islands of Indonesia. We had our own car & driver, which I think made the trip much more pleasant. The park is very large. We packed a...More  ",
  "tripadvisor_monas_184": "This is one of the old theme park in Indonesia, recently expand the venue with more various attraction, they have water park, monorail and of course legendary \"Keong Mas\" also so much more",
  "tripadvisor_monas_185": "This is one of my favorite places and family to fill the holiday and learn about the diversity of Indonesian culture",
  "tripadvisor_monas_186": "Indonesia is lovely Island.But if you don't have time to have tour around the IndonesiaPlease come to this lovely place, because all you want to know about Indonesia located on this place",
  "tripadvisor_monas_187": "Experience various cultures of Indonesia with exciting architecture at this place. Get to know the many ethnic backgrounds of Indonesia without having to travel to far away places.",
  "tripadvisor_monas_188": "Sorry to say but as usual with any building in Indonesia this park is badly in need of a team of builders! Poor cleaning and maintenance give the feel of neglect and decay to what could be a nice place to visit. Add to that the usual vendors and rubbish then you have this!",
  "tripadvisor_monas_189": "Experience various cultures of Indonesia with exciting architecture at this place. Get to know the many ethnic backgrounds of Indonesia without having to travel to far away places.",
  "tripadvisor_monas_190": "Excellent idea to let tourists as well as local know Indoensia in a Miniature replica.Originally it was very good, over the time it's run down badly as a consequence of low upkeep. ACs aren't working in Museum....We saw some new construction coming up last trip, but no sign of any renovations.",
  "tripadvisor_monas_191": "Such a great place to learn the diverse cultures in Indonesia, although it can be quite hot to visit all the mini provinces. When it says mini I actually imagined miniature houses but no, the houses are actual sizes. It's very interesting to see the different cultures in different parts on Indonesia, which can differ greatly to each other. Going...More  ",
  "tripadvisor_monas_192": "if you want to learn indonesia, you can visit here, all you need is here. complete, historically, and acknowledged.",
  "tripadvisor_monas_193": "This amazing place was built by President Suharto. I went with a guide, and I would really recommend this to get the most from the experience. Take plenty of water. Certainly this place celebrates the incredible diversity of peoples who are now modern Indonesia.",
  "tripadvisor_monas_194": "Tried their cable car and it was definitely fun, wish we tried their mono rail too. But learning Indonesia as it's best, need days to complete the circuit!",
  "tripadvisor_monas_195": "Beautiful park with lots of entertainment...suitable for all ages to come and enjoy....very good place to see and learn Indonesian culture and tradition",
  "tripadvisor_monas_196": "Taman mini indonesia indah (TMII) is a beautiful amusement park. Here we can see all of indonesian cultures. There are many kinds of indonesian traditional houses, customs, explanation about indonesian traditional festival, languages, dances and museums as well. Without travel to islands of indonesia you would have known about all of indonesia here. So come and see indonesia in Taman...More  ",
  "tripadvisor_monas_197": "the concept and idea of this place is actually pretty good, you got to learn much about indonesian culture and geography etc. but still need lots of repair and maintenance. awful traffic inside the area and poor cleanliness are the main issues, I think.",
  "tripadvisor_monas_198": "This was my 5th times perhaps to visit this place, and recently being more better than before. They educate people in regards to richness of Indonesian culture and heritage.",
  "tripadvisor_monas_199": "This was my 5th times perhaps to visit this place, and recently being more better than before. They educate people in regards to richness of Indonesian culture and heritage.",
  "tripadvisor_monas_200": "Want to know more about Indonesia ? Pls come to Taman Mini Indonesia Indah. You can learn about Indonesian Tribes and their beautifull abd Unique House Style",
  "tripadvisor_monas_201": "The park is very big and offers the best image of the variety of Indonesia ethnic groups and cultures. Also having a lake and green areas, it's one of the few places in Jakarta where you can enjoy walking around. In fact, if there wouldn't be the option of the cable car, it would be exhausting to visit the whole...More  ",
  "tripadvisor_monas_202": "I guess it was a nice place when it opened. Good idea, but no maintenance is done, the place is not looked after, trash everywhere.And cars are allowed to go everywhere. Not very safe with small kids.",
  "tripadvisor_monas_203": "Different part of Indonesia and it´s monuments in one place. You can see the main palaces, temples and local types of architecture from Bali, Java, Sumatra etc. Like every indonesian attracitons do not go here when day-off in Indonesia as it is full with domestic people and traffic jam. Should be look better after the monuments.",
  "tripadvisor_monas_204": "this place is not too far from my home. I can come here twice a week. Not only you can see all the provinces in Indonesia, but also you can learn traditional dance, learn how to make batik, watch the imax movie, cycling, go to museums, swimming, inline skate, and buy souvenirs.",
  "tripadvisor_monas_205": "Big and crowded theme park .Too many activities and I think it should be ok for children . But compare to similar places in Kuala Lumpur and Singapore and ... We didn't like it so much !We took a small bus and saw the hole park in the bus with 10,000 rp!",
  "tripadvisor_monas_206": "Good to introduce overseas friends or children to this place, to gain knowledge about Indonesia culture, art and all. Driving from one to another provinces ' housing and culture makes it easier to get to know about Indonesia. Take cable car through mini lake and fun ride. See the movie about Indonesia in big theatre and enjoy the fun seeing...More  ",
  "tripadvisor_monas_207": "This place known as Taman Mini for local people.It is the miniature of Indonesia.Kids can learn Indonesian culture here.The place is under renovation now.And the lake has dry now.There is a bird garden, the bigcage where there is many kind of bird in ItThe place is realy fun for kids.For grown up people...More  ",
  "tripadvisor_monas_208": "I went here with my officemates. There are so much places to visit where they are miniatures of popular tourist spots in different parts of Indonesia. There are food stalls inside for cheaper price. We ate in a dirty restaurant.. yes it was dirty... As well as their toilets. There are cats on the cashier while serving food. There were...More  ",
  "tripadvisor_monas_209": "The Taman Mini offers building complexes from many islands that make up Indonesia. Marvel at the differences in architecture. Then walk into the buildings to view displays of...read more ",
  "tripadvisor_monas_210": "The Taman Mini offers building complexes from many islands that make up Indonesia. Marvel at the differences in architecture. Then walk into the buildings to view displays of household utensils, clothing, and other bits of everyday life. It feels like an island tour in a single afternoon. I'd go back because you cannot see it all on one day",
  "tripadvisor_monas_211": "\"Beautiful Indonesia in Miniature Park\" is universally known as \"Taman Mini.\" It aims to represent all the provinces of Indonesia in miniature. Taman Mini is a popular attraction and if you have any Indonesian friends they will always ask \"Have you seen Taman Mini yet?\" It's not all that great, but the people of Jakarta are proud of it. There...More  ",
  "tripadvisor_monas_212": "Taman Mini is what this place is called by the public and by cab drivers. It is a great place to spend at least a day.Weekends can be very crowded, but weekday visits have to miss many of the special events that are \"weekend only\".It is great to be able to visit the pavilions that each present one...More  ",
  "tripadvisor_monas_213": "I came here about a week ago to take prewedding photo session, some of the facilities is about 80% finished. i think it's very beautiful places moreover if the rennovation finished at all.i didn't recommend you to visit here at the weekend, it so crowded cz so much people and vehicle in the street.",
  "tripadvisor_monas_214": "I think I like this place . It showed the architectures of the peoples all over Indonesia. There are so much to see but we only got a few minutes to looking around the place because our tour guide is too rely on the trip schedule.",
  "tripadvisor_monas_215": "One of the best places in Jakarta who deserve your visit. You can admire all Indonesia in miniature from Thousand Islands till Bali !",
  "tripadvisor_monas_216": "This is generally referred to as \"Taman Mini\" in my experience and this was certainly what our taxi driver called it. Ask the driver to drop you at the Information Centre where you can get a useful map and some tips on how to make the best of your day. The site covers a large area and you'd need to...More  ",
  "tripadvisor_monas_217": "I gave this a high rating simply because there's not many good tourist places offering a lot of open space like this in Jakarta. Beyond open space, the positives are it's affordable, there's a lot to see, and it can give a good overview of the islands to visitors who want to know more about the various islands of this...More  ",
  "tripadvisor_monas_218": "We just visit this Miniature park last Sunday (08/12/2015), the park had a good front view but the internal maintainers are very bad. At fist we reach the park we directly go to the information counter to get the travel information, they provide us a map and roughly point few placese for us to wisit, Thus we follow the map...More  ",
  "tripadvisor_monas_219": "It a huge miniature park of Indonesia! Going through all areas will take you a whole day even with a vehicle, its that big! And the miniatures ain't small as you think it is. They are actual structures that gave an awesome scene and experience of Indonesia's culture, art and history. Truly a place not to miss, we book a...More  ",
  "tripadvisor_monas_220": "Small scale Indonesia from Ache to Papua, visit the entire country in this park and get to learn about the exsotic culture of Indonesia. knowledge and education",
  "tripadvisor_monas_221": "My latest visit here was with a Filipino friend last month. We visited the Imax Theatre for a 35,000 IDR one hour show about deep sea volcanoes. Too bad it was dubbed into Bahasa Indonesia that I had to translate it for my foreign friend. Then, we were off for Meseum Indonesia for a 15,000 IDR entrance fee. Here, do...More  ",
  "tripadvisor_monas_222": "Small scale Indonesia from Ache to Papua, visit the entire country in this park and get to learn about the exsotic culture of Indonesia. knowledge and education",
  "tripadvisor_monas_223": "A quintessence of different cultures and historical periods in Jakarta. Good place to visit (without too much walking though, a bus tour can be a good suggestion)",
  "tripadvisor_monas_224": "I visited Taman Mini recently and found it disappointing. It is not that old but unfortunately it is now in disrepair.",
  "tripadvisor_monas_225": "It was fun. I was fortunate to get a great guide at the Indonesian museum. I did the cable car ride to see the mini structures and felt that was better than walking the whole thing. I went on a Sunday and was fortunate enough to get to see locals dressed up in traditional attire and performing songs and dance...More  ",
  "tripadvisor_monas_226": "Unfortunately, the visit was a complete disappointment for the family. The entire park is run down, looks and feels as if time had stood still for 30 years.",
  "tripadvisor_monas_227": "When you look for things to do in Yakarta one of the options is go to The Indonesia Miniature Park (Taman Mini Indonesia). To be honest Yakarta is probably the less exiting place to visit if you are in Indonesia. This park is attractive because you can explore the architecture of Indonesia, especially if you can not visit other islands...More  ",
  "tripadvisor_monas_228": "If you want to know about Indonesia, this is the best place to visit. You can see and learn about the culture. Go inside every traditional house and feel the difference.You can visit Keong Mas, an Imax teather.Good for all ages, kids, youth, and seniors.Don't forget to bring umbrella or hat:)",
  "tripadvisor_monas_229": "It was a quick and exciting short tour for $35 in a van with three other people billeted from another hotel. Despite the routine heavy traffic, we arrived in comfort and marvelled at the beautiful place. Inspired by the Philippine miniature park Nayong Filipino, there was nothing small about the place. They depicted a typical Balinese park, a museum with...More  ",
  "tripadvisor_monas_230": "miniatur of province Indonesia. even we just see the miniatur, for us is amazing. Indonesia is big country and beautiful culture. we rent bycicle in here so we turn around use bycicle. if you want tp know about indonesia, you must come to here.",
  "tripadvisor_monas_231": "Pulling up to this place in the taxi, you are immediately gobsmacked by the size and scale of the place! Allow a whole day here to explore an amazing cultural snapshot of...read more ",
  "tripadvisor_monas_232": "Must visit in Jakarta, I go there long time a go better than I expect before. As Indonesian I proud we have ok place to shows some of our cultures.",
  "tripadvisor_monas_233": "Ensure you leave after peak hour traffic and give yourself at least three hours to look around. Very interesting look at the architecture of the different islands.",
  "tripadvisor_monas_234": "This place should be visit need a half day to explore ,good experience with the kids.Star with kid palace and gondola and have fun with the bike ,love the park with the Chinese history many knowledge and information about Indonesia culture and heritage from all over Indonesia",
  "tripadvisor_monas_235": "Good experience for kids and students, many knowledge and information about culture and local heritage from all over Indonesia",
  "tripadvisor_monas_236": "Pulling up to this place in the taxi, you are immediately gobsmacked by the size and scale of the place! Allow a whole day here to explore an amazing cultural snapshot of Indonesia. The park is looking a bit tired but is still a great introduction to Indonesia. Unbeknown to us, most Indonesians drive or use a bus tour to...More  ",
  "tripadvisor_monas_237": "This is one of another place should be visit..i need a half day to visit Indonesian miniature park, im enjoyed to saw a thousand Indonesian culture",
  "tripadvisor_monas_238": "If you wanna know about Indonesia but only have a short time you can visit this place. All across the 34 province can be learned here but you must have good condition in order to go around.",
  "tripadvisor_monas_239": "Beeing a Jakartas for so many years and so many times visited TMII, this place is definitely need to be relocated or remodelled.The idea is great, but it should be improved or modernized with parking space, or something to accomodate the current flock of visitor.Traffic was a mess,Not enough parking space,Food was terrible, Who wants to...More  ",
  "tripadvisor_monas_240": "We went for a short trip to jakarta and planned to visit Taman Mini as the priority . The entrance fee is 10000 IDR and worth to the money . here You can watch all the Indonesian culture at one site",
  "tripadvisor_monas_241": "Established by First Lady: madam Soeharto, 2 nd president of Indonesia, it is the best place to know Indonesian region. Within this amusement park you are able to find many different cultures and cuisines in Indonesia.Using a cable ban you would be able to see miniature of the island in Indonesia.Enjoy your visit for it would take a...More  ",
  "tripadvisor_monas_242": "By visiting this beautiful miniature of Indonesia, you get the experience of going around Indonesia in short time.",
  "tripadvisor_monas_243": "By visiting this beautiful miniature of Indonesia, you get the experience of going around Indonesia in short time.",
  "tripadvisor_monas_244": "the one of best place to shown the identity of local culture of indonesia. Should visit here and pay the entry is very cheap.Just take d bus (halte through Pulau meranti) and u can try take ojek to go theres about 2500rp.",
  "tripadvisor_monas_245": "This is a beautiful country to visit and the best place to eat. Everything is very cheap in indonesia.",
  "tripadvisor_monas_246": "This place was meant to be an awesome landmark of Jakarta. With the unique miniature concepts that mimicked every different culture and race in Indonesia, this place was initially built to be a showcase to tourists about beautiful Indonesia. But after we visited this place, we understood why it would never be a landmark of Jakarta.The facilities are all...More  ",
  "tripadvisor_monas_247": "Nice experience. One can see the different leaving habits and houses of many indonesian islands, all without leaving Jakarta. Really recommend it.",
  "tripadvisor_monas_248": "The place is good but dirty .. to much trader its so annoying !!The ticket price is very Expensive !!each vehicle we have to pay admission , but we've paid the price of the gate monument!!!!I don't like to come here!!",
  "tripadvisor_monas_249": "most i like is PPIPTEKlearn and play. you can take your childre. here to play and learn about technic, basic physics studies and lotsa mind games to llay with.",
  "tripadvisor_monas_250": "Small view about indonesian culture and lot of museum for more my knowledge.Small lake that picturing indonesian island.",
  "tripadvisor_monas_251": "Full day needed here.We only went for half a day so was a bit rushed.It has a small water park at it too. (We didn't get to it)I would say go to the information center first to get a map and museum costs. We got hassled quiet a bit from people trying to rent us scooters at...More  ",
  "tripadvisor_monas_252": "Taman Mini is a I think the best way to explore Indonesia, at least to give you an idea about what you would like to visit later on. Taman Mini offers the cultural delights of each region of its 17,000 islands archipelago. It is highly recommended to have a rented car to explore because it is huge. However, if you...More  ",
  "tripadvisor_monas_253": "Me and my whole family go to TMII and its a cheap place to enioy holiday. We cant take just one day to explore all the place. Its like indonesia in small size...very educative...read more ",
  "tripadvisor_monas_254": "This place is so large and explore the whole cultural of indonesia in one place. The infrastructure is quite good. I saw there are many museums inside and many students visit this place for learning their course.",
  "tripadvisor_monas_255": "Me and my whole family go to TMII and its a cheap place to enioy holiday. We cant take just one day to explore all the place. Its like indonesia in small size...very educative place for children who are still in school. Got all the facilities that we need ..",
  "tripadvisor_monas_256": "this place you can visit a hole day if it gets your attention.all styles and people from all of the main island of indonesia you can find there.thy are all open to show you there culture,and handicraft.many places to rest ,places to eat and drink as well.have a boat trip at the lake,and relax as well.",
  "tripadvisor_monas_257": "This is the place to see and to learn Indonesian Diversity in One Day. Very interesting place to learn and to be amazed with this amazing country.. 34 provinces with more than 13,000 islands.. Too big to see. So just come to Taman Mini Indonesia Indah to see Indonesia in a glance",
  "tripadvisor_monas_258": "Awesome Place. Really liked it.I would suggest everyone to go there if you are in Indonesia.Rest a bike and then you can enjoy",
  "tripadvisor_monas_259": "The last time I was here...I remember seeing some traditional houses of Indonesia. You can take pictures of them if you want to.",
  "tripadvisor_monas_260": "Great if you have a day to spare. Unfortunately you need a car to go here, even inside. I'm not sure about the transport (whether they provide it for you or not). But definitely it is a hassle if you don't have a motorcycle or car.",
  "tripadvisor_monas_261": "It is worth to visit the park that you can get an picture of Indonesia. What I noticed was most of the places are under construction. They have a huge theater in side the park.",
  "tripadvisor_monas_262": "We wanted to spend a day outside of Jakarta and discover a bit of the culture.The buildings of each regions were indeed super interesting and I remember having a chat with the Tanah Toraja Lady would really made us want to go there.The only but really big inconvenience for my part is all the cars and buses driving...More  ",
  "tripadvisor_monas_263": "I went here several times mostly for work and weddings. But I did have the chance to take a look around. Not so well maintained, careless staffs. Most of the food available here taste average to below average. Def need a management reform",
  "tripadvisor_monas_264": "Well, Taman Mini Indonesia Indah (TMII) is a place that drawing miniature park of Indonesia's culture. You can see traditional houses of each provinces, traditional dances show...read more ",
  "tripadvisor_monas_265": "beautiful replica of all the places in Indonesia along with its customs,.food,culture and other intricacies.the traditional dances of each province,traditional houses and a variety of Indonesian art and culture depicted well here.enjoyed with Raji Sekhar.",
  "tripadvisor_monas_266": "Went to see different aspects of Indonesia and parts of the part are OK but the overall feel is run down. Looks like little to no maintenance on the museums they have in the park. It could be such a nice tourist attraction if it were maintained but probably no money. Just like everything in Indonesia if they receive money...More  ",
  "tripadvisor_monas_267": "A very nice place to visit with your family. We went there a bit late and we were sad because we could not visit everywhere. You must at least stay one whole day to enjoy it.",
  "tripadvisor_monas_268": "Well, Taman Mini Indonesia Indah (TMII) is a place that drawing miniature park of Indonesia's culture. You can see traditional houses of each provinces, traditional dances show and many things about Indonesian art and culture.",
  "tripadvisor_monas_269": "Nice place to see different architecture styles from whole Indonesia. Impressive, couple of hours walking but worth to visit",
  "tripadvisor_monas_270": "wants to drive around Indonesia in a short time? came to Taman Mini Indonesia Indahyou can see and know the various cultures in Indonesia, ranging from custom homes, custom clothing, and enjoy Indonesian food.",
  "tripadvisor_monas_271": "This is place has a huge potential. But needs to be organized. Go by Taxi and there are people who would approach you to take you around. Do not use their service. There is a bus taking you around if you do not want to walk around.But you would get only the glimpse of it unless you walk..Cable...More  ",
  "tripadvisor_monas_272": "This place really brings me closer to Indonesian culture. You really get that feeling that you are in a place,with a lot of culture. And you can also visit afew museums here like the stamp museum, komodo dragon museum and more.",
  "tripadvisor_monas_273": "Very good concept, Mini Indonesia in one area. But as many Indonesia's Park, lack of maintenance. Hope the institution really take a good long term planning for itself.",
  "tripadvisor_monas_274": "It could have been great. Imagine a park with a 5-km loop. As you walked along the loop you can visit numerous museums and reconstruct homes displaying the cultures, as well as visit gardens and parks displaying animals and plants, across the whole Indonesia.Sounds great but in reality the place is rather messy. Our driver dropped us near entrance...More  ",
  "tripadvisor_monas_275": "One of favorite place in jakarta for vacation with family. We can find many kind of education place and also can learn about indonesia culture from small think. Many museum also...read more ",
  "tripadvisor_monas_276": "One of favorite place in jakarta for vacation with family. We can find many kind of education place and also can learn about indonesia culture from small think. Many museum also in this place such as transportation, technologi and other",
  "tripadvisor_monas_277": "To have Indonesia's miniature in one place is such a brilliant idea! Very good for family recreation and child education. Beside Indonesia in miniature park, we can also enjoy bird park, freshwater aquarium, swimming pool, etc. But its to bad that the handling of this place is not as good as it should be... Maybe because of the ticket price...More  ",
  "tripadvisor_monas_278": "This is quite a big place and you can spend an entire day here. In this place, we are able to see almost all of the different cultures, traditions, housing etc across Indonesia.Although the place is relatively run down and it can be a real tired day of walking, it is worth the effort to go ONCE.If you...More  ",
  "tripadvisor_monas_279": "visiting twice, i did not explore much about what exactly others travellers have mentioned. Indonesia's miniature. i only came to this place to enjoy running and rent a tandem bike to going around. I saw many attraction such as traditional houses from provinces in Indonesia and i am sure many other things inside them. Better for running or cyclist.",
  "tripadvisor_monas_280": "As a rule Indonesian attractions are old and shabby and in dire need of overhaul and this one could do with some maintainance in places. However it is interesting and good fun with some great soveniers to be had in tge various buildings. The sky lift looks like its seen better days but despite all its minor faults its a...More  ",
  "tripadvisor_monas_281": "I went there not knowing how much a ticket costs but was keen on having the experience. It costs 10000 Rupiah which is about 70 cents per person and if you have your car you will add another 10000 for it which you can use to go around the place.It's really huge in size and needs a lot of...More  ",
  "tripadvisor_monas_282": "It's not a bad place but there is not much to see or do, and I didn't learn much at all about Indonesia itself. It was pretty, but that's about as far as it went.",
  "tripadvisor_monas_283": "This place makes Banksy's Dismaland look cheerful. Most of the buildings close at 4pm even though the park is open until 10? Theres a waterpark that looks amusing, but we didnt have swimwear. Spent too much time walking around a creepy seemingly abandoned buildings looking at dated exhibits.",
  "tripadvisor_monas_284": "Taman Mini Indonesia Indah or more famous with nick name TMII are a huge place where you can find the whole culture of Indonesia from wholeover the provences.The houses and also food. You will also found some museum here like sports museum, insect museum, etc.A good place to get to know the whole Indonesian culture in one place.",
  "tripadvisor_monas_285": "area location quiet far from city of jakarta, the best way to get there by taxi, in this place you will see all of indonesia culture n civilization from Sabang (west) to Merauke (east)",
  "tripadvisor_monas_286": "Good place to experience beautiful Indonesia in one place. Good for day/ afternoon out with family, friends. Grounds are very scenic.",
  "tripadvisor_monas_287": "Good place to experience beautiful Indonesia in one place. Good for day/ afternoon out with family, friends. Grounds are very scenic.",
  "tripadvisor_monas_288": "There are 4 ways to get around the park and take a glance at at the different transitional architectural styles of app of Indonesia's provinces. 1/ Monorail 2/ Miniature train 3/ Ropeway 4/ Hired scooter. We did 1 and 3.The bird park, fresh water world and insect world are amazing.The replicas of traditional buildings and houses are very...More  ",
  "tripadvisor_monas_289": "Pros: great variety of attractions, nice artificial lake ( Archipel lake ) with lovely traditional houses representing each province, the Chinese cultural park ( Taman Budaya Tionghoa ) with a nice pond and some statues depicting the ancient Chinese civilisation. Museum Indonesia is also lovely, with nice cultural exhibits and Balinese style gates.Cons : unimpressive toilets charged at rp...More  ",
  "tripadvisor_monas_290": "recommended for all travelers who travels to Jakarta. You get a tiny bit of taste of all the cities in Indonesia.",
  "tripadvisor_monas_291": "Visited Taman Mini for the second time with friends (one Indonesian and an Aussie). We watched the Imax movie about Indonesia which was great even though we don't speak Bahasa Indonesian we understood. We also spent an hour in the museum which is fascinating. We decided to have lunch in the CFC restaurant under the cable car terminal. Just as...More  ",
  "tripadvisor_monas_292": "If you wanna see all house traditional from Indonesia, this is Taman Mini Indonesia Indah.The right choice for family recreation. You can know about traditional house from all of province in Indonesia. Not only houses, you can see all of cultures like dresses, dances, foods and ethnic.",
  "tripadvisor_monas_293": "Good place to spend a day, although it can get very hot. Make sure if have some water with you, although there are a number of shops where you can buy water/ food. Hire a scooter if you can drive and drive carefully.",
  "tripadvisor_monas_294": "Since 3 years ago visited not much changed. Still cozy place to see Indonesia from miniatures Indonesian folk house.",
  "tripadvisor_monas_295": "A great place to know Indonesia in 1 day. Most convenient to visit by renting a car for the whole day as the area is too large to walk about.",
  "tripadvisor_monas_296": "Nice place if you want to know more about Indonesia, especially the musuem of Indonesia. The cable car ride is return trip without able to get down when we reached the other end station, quite a weird arrangement.",
  "tripadvisor_monas_297": "Well worth the effort , but probably better to choose a cooler, cloudier day if a westerner. There can be a lot of walking and in the heat this can become very...read more ",
  "tripadvisor_monas_298": "Well worth the effort , but probably better to choose a cooler, cloudier day if a westerner. There can be a lot of walking and in the heat this can become very tiring.Facilities and eating venues are numerous and are generally good standard. However be aware most of the toilets are Asian Umum style.",
  "tripadvisor_monas_299": "I was little sceptical to visit Taman mini alone with two kids in a foreign land. But full points to the lace for making it very comfortable and attractive for kids and adults both. It's a fun place with lots of activities; there are different sections for all the islands of Jakarta, many nice places to eat, many rides for...More  ",
  "tripadvisor_monas_300": "We had high hopes for this park based on previous reviews and loved the idea of being able to see so much of Indonesia in one place. Unfortunately we found the park to be extremely badly organized. There seemed to be only one way in and one way out for cars via a one way system routed around the entire...More  ",
  "tripadvisor_monas_301": "this is a big park where foreigners can know more about Indonesian traditions and history.I believe kids will love it, is quite big with a lot of greens and trees. A few hours are needed to visit it all.Inside is also possible to find restaurants.",
  "tripadvisor_monas_302": "The park is located at East of Jakarta. Access is easy since it is located very close to the Jagorawi Toll. Inside the park, there are many attractions:33 Pavilions that represent Indonesia Provinces7 Religious buildings14 Museums of all kindsRides: Cable Car, Aeromovel Train, Boat Ride, Swan Paddle Boat, Bicycle3 Theatres11 Gardens and ParksLake...More  ",
  "tripadvisor_monas_303": "By effort I mean it can be very hot, humid, busy with crowds and confusing to get around. That said it is quintessentially Indonesian - run down attractions, polite but fairly disinterested staff and just plain strange. This is the reason you need to go. This park will actually do what Suharto's wife intended (possibly not how she intended as...More  ",
  "tripadvisor_monas_304": "The remarkable, and indeed beautiful, Mini Indonesia Park (also called Taman Mini Indonesia) is huge with full-sized houses that have been constructed to show the architecture typical of the various provinces of Indonesia. For example, there was a longhouse in which multiple families, all related, would live.What was most astounding to my husband and me as we were driven...More  ",
  "tripadvisor_monas_305": "Only have limited budget and time to travel around Indonesia? Need the real reference which the best to visit? Want to overview the culture of Indonesia at glace?",
  "tripadvisor_monas_306": "In Jakarta on a very short trip and wanna explore vast Indonesia?? Taman Mini is the Place to be. Museums, Eateries, souvenir shops, mini villages, cable cars you have to all here. A great place to spend your time family or friends. A must for all visiting Indonesia for the first time.",
  "tripadvisor_monas_307": "Cross all indonesia in one place .. One of the best places in jakarta .. To see the different types of traditions and traditional building cross all Indonesian islandsCrossing sumatra and bali and bandung ..Don't forget to take the hanged cars the view from up is so awesome",
  "tripadvisor_monas_308": "I think the name is not good! TMII should be called Amazing Indonesia in Miniature. The park is not just beautiful, it is Amazing!When I'm introducing Indonesia to my overseas...read more ",
  "tripadvisor_monas_309": "I think the name is not good! TMII should be called Amazing Indonesia in Miniature. The park is not just beautiful, it is Amazing!When I'm introducing Indonesia to my overseas guest, this is the place!It's like to visit the whole Indonesia in just 1 day. And honestly 1 day is not enough to visit this park.This park...More  ",
  "tripadvisor_monas_310": "If you don't have time to visit all the places in Indonesia, TMII is the best place to visit. Its quite far from jakarta city. But really worth visiting. Better hire a car, or a bike because this place is very very huge. Impossible to cover in 1day if you decide to walk. Many miniature are built for us to...More  ",
  "tripadvisor_monas_311": "I have been here like I said, more than three times! I enjoyed all the times there. I will bring every friend or family that visit Jakarta to come here.you can bring car around inside, or just park your car and rent bicycle or motorcycle at cheap price. need to have something to ride on because it's very vast...More  ",
  "tripadvisor_monas_312": "You'll find traditional architectures of Indonesian's tribe in one area. From Aceh, Sumatra Island to Papua, Papua Island. Best visit and view is morning. You'll get fresh air and not crowd visitor.",
  "tripadvisor_monas_313": "Definitely it's a MUST Visit Place if you are in Jakarta. One will have complete view and understanding about Indonesia and it's culture through this place. The sculptures and architectures are amazingly beautiful. Simply loved the place.",
  "tripadvisor_monas_314": "see all specifics in all indonesian provinces. in my childhood there were 27 provincies. now i dont know how many. it always gets more and more provincies. Ride monorail/ kereta gantung to see indonesian islands miniature. Watch imax keong mas theatre. please reserve ahead.",
  "tripadvisor_monas_315": "It's very big and need bike or car to go round. To long and very crowded. But good knowledge about Jakarta and old history 👍🏼",
  "tripadvisor_monas_316": "While it is culturally interesting, the attraction has taken on a very commercial aspect with vendor hawking their wares with hundreds of stands. Traffic is allowed to drive through the park which makes getting around to the different pavilions by foot very difficult. Many of the pavilions are in a state of disrepair and appear to be permanently closed. The...More  ",
  "tripadvisor_monas_317": "If you have a very limited time, visiting this Miniature Park is your best deal. They have summarized Indonesia in one park.",
  "tripadvisor_monas_318": "Go with Grayline tours to this place, as they have a good team of guides. The Museum here is a jewel, spend some time here. The other aspects of the park are the house from various islands, time well spent.",
  "tripadvisor_monas_319": "They offer all the traditional houses, cloth, food and history of cultures in Indonesia. With a handful of museums and activities to do, you should spare a day going around this...read more ",
  "tripadvisor_monas_320": "They offer all the traditional houses, cloth, food and history of cultures in Indonesia. With a handful of museums and activities to do, you should spare a day going around this place. and bring your lunch to the lake side, you can have mini picnic there. they have local and international restaurants there, so don't worry.",
  "tripadvisor_monas_321": "The park is representing diversity and unity in Indonesia, at that time was only 27 provinces exposing in this Beautifull Indonesia In Miniature Park. you may see how beautiful and uniqnes of each province. Each province they have show case how they live on their indigenous way on their village. Start from daily live and also wedding. Mostly also they...More  ",
  "tripadvisor_monas_322": "It's so good to see the miniature, authentic, and uniqueness of Indonesia in one place. There are 33 traditional houses represent 33 provinces in Indonesia. And also there are 6 prayer temples standing side by side. This spot is mentioned as the most tolerant spot.But unfortunately, each traditional house just left like that. No attraction. Sometimes the house just...More  ",
  "tripadvisor_monas_323": "If you want to visit Indonesia and have only 5hours time - you can visit Taman Mini Indonesia Indah. I love it since i was in primary school. Right now they have more museums to see since last time.Last week i was there with our business partner because they have only 5hours time to see Jakarta/Indonesia. The best place...More  ",
  "tripadvisor_monas_324": "Went on my first visit to the area, it really is the only tourist place that is worth the time to go visit.",
  "tripadvisor_monas_325": "A very good place to learn about Indonesia, considering how large it is and how many islands it is composed of.The park is vast so it's good if you can ride a bike, as there are rentals available to help you get from one area to anotherBe warned that all the museums and attractions have entrance fees for...More  ",
  "tripadvisor_monas_326": "I ALMOST decided not to to go to Taman Mini Indonesia Tangah based on some of the poor reviews on here. Now that I have been I can only say that you will be doing yourself a GREAT injustice if you ever come to Jakarta and do not visit Taman Mini Indonesia Tangah. If you the sort of person that...More  ",
  "tripadvisor_monas_327": "The concept of this theme park is excellent. Is comprises in the main pavilions constructed in the style of the many and varied Indonesian sub-regions. Within the pavilions are displays of costumes and implements, in the main, and here and there one can purchase items. My title references the fact that most of the pavilions were unattended and commentary in...More  ",
  "tripadvisor_monas_328": "..to visit this place. It's a must! Not only for foreigners, but also for each Indonesian citizen, you must visit our TMII. Here you can see almost all of Indonesian ethnics and cultures, see each beautiful traditional house, and also some of interesting museums and parks. For me, need 2-3 days to visit all parts of Indonesia Miniature Park or...More  ",
  "tripadvisor_monas_329": "Taman Mini is so huge! You can catch a glimpse of every uniqueness of Indonesian tribes and cultures. Don't forget to ride the Gondola. It gives you a pretty clear view from above how beautiful and huge the place is.If you are a history and/or museum lover, you'll love it!",
  "tripadvisor_monas_330": "Here, we can soak up the diverse cultures of Indonesia. Sure, nothing beats the real stuff at the real venues, but if we have that much time to travel to each province...",
  "tripadvisor_monas_331": "Here, we can soak up the diverse cultures of Indonesia. Sure, nothing beats the real stuff at the real venues, but if we have that much time to travel to each province...",
  "tripadvisor_monas_332": "The beautiful Indonesia in Miniature Park is worth the visit. It gathers interesting details from all over the country. Go there before it is too hot and stay a couple of hours to enjoy it.",
  "tripadvisor_monas_333": "Must visit place in Jakarta. No need to travel to other division in Indonesia. All is here. Visit here means you have been to all Indonesia division.",
  "tripadvisor_monas_334": "This place was horrible. I went there with my husband because it was on one of the top things to do in Jakarta as recommended by TripAdvisor. However, the place is just a rundown museum in a park. After going into two building structures, we decided to just observe the beautiful features of the buildings from each state of Indonesia...More  ",
  "tripadvisor_monas_335": "Taman Mini is a very good idea- a glimpse into all parts of Indonesia and a very good way to experience a bit of everything the country has to offer. The place however is very poorly maintained and not really designed for tourists as most of the stuff is in Bahasa. We visited with some friends and had Ida with...More  ",
  "tripadvisor_monas_336": "I always bring my foreign friends and guest to Taman Mini as to saving time explaining how big and culturally diverse Indonesia is. It may take you the whole day to explore all attractions they have. Expect some longer queue especially on weekend at some favorite attractions like IMAX Theatre, Gondola, Istana Boneka, and Snow Bay....",
  "tripadvisor_monas_337": "Interesting, but most facilities were poorly maintained. So can consider giving a miss if you have no time. Need vehicle to drive you around inside the park because various locations are far apart and cable cars and trains are no operating on weekdays.",
  "tripadvisor_monas_338": "A definite must to visit when in Jakarta. Our tour guide was amazing too. TMII let me experience much more than justt Java and Jakarta. Watch out for the Komodo Dragon though!",
  "tripadvisor_monas_339": "You can see a lottttt of thinggsss!Culture from the west till the eastern part of Indonesia, not just that you can see all different kinds of animals there and try to take the sky lift to see the park from above.though many indonesians don't really appreciate this place, for me personally this is a really good concept to...More  ",
  "tripadvisor_monas_340": "Taman Mini is an exotic day trip from Jakarta. perhaps originally intended to be a city attraction, teh poor traffic makes it a day long journey.It has well made replicasof life size of houses of a traditional variety from all over Indoineisa and its a pleasure to be introsuced to Indonesian culture through them.There is good museum to...More  ",
  "tripadvisor_monas_341": "Kids really enjoyed the cable car ride.... Loved the history, architecture, etc.Well worth a visit. Such a fabulous idea. Many excellent things to see. In need of a good...read more ",
  "tripadvisor_monas_342": "The Taman Mini Indonesia is nicely made. Its quite big so you would like to go there with a car. However, its not made for tourists, most museums and attractions are in bahasa. But if you've got some time to spend in Jakarta its worth a visit.",
  "tripadvisor_monas_343": "Taman Mini has seen better days. It would be a great introduction to Indonesia, but because it is so poorly maintained, I wouldn't recommend it. Trash everywhere and lots of walking. The museums are also worn down, dirty, and lack up-to-date information. Indonesia is a beautiful country with so much to offer, but Taman Mini does not do it justice....More  ",
  "tripadvisor_monas_344": "Kids really enjoyed the cable car ride.... Loved the history, architecture, etc.Well worth a visit. Such a fabulous idea. Many excellent things to see. In need of a good sprucing up. Maybe living history characters walking around and food places in each locality might make it more lively and fun... Great potential",
  "tripadvisor_monas_345": "Taman Mini Indonesia Indah is miniatur of Indonesia because the attraction of cultural from all provinces in Indonesia.",
  "tripadvisor_monas_346": "Far out from the city is my main concern when rating this attraction.I completely understand the fact that the massive space is the key since I believe you won't be able to find such place downtown.Besides that, it kinda seems like a little amusement park, which can be fun to hang around with kids.I certainly don't think...More  ",
  "tripadvisor_monas_347": "The very first time I visited Taman Mini Indonesia Indah was when I was a little girl. I finally had a chance to go there again with my husband. We guided the participants of Aviation Security Instructors Course to go around and enjoy the miniature of Indonesia. We only have few hours there, so we only stopped by at several...More  ",
  "tripadvisor_monas_348": "This miniature park is huge! I definitely recommend doing it in a car if possible. Walking between houses is fine but have the option of getting in the car when the heat gets overwhelming. The park is not something fantastic but it's a great way to see the diversity within the Indonesian archipelago. You can see all the different types...More  ",
  "tripadvisor_monas_349": "Biggest disappointment was the fact that to get anywhere you had to walk. There was no hop on - hop off mini bus etc. This prevents you from really seeing everything and exploring as much as you would like. There is the option to hire electric bike, tandems and scooters. You also have to pay for everything you do or...More  ",
  "tripadvisor_monas_350": "There is much to see and to learn for a free entrance attraction.Almost all cultures and traditional architecture were presented in Taman Mini. You need a whole day for it.",
  "tripadvisor_monas_351": "Come early and be prepared to walk great distances between each exhibit. We were fortunate to have a guide/driver to lead us through the many beautiful replicas of the buildings in the archipelago. Culturally appropriate costumes made for a fun experience and gave a focus for those traveling on from Jakarta. One need not pay for additional entry points -...More  ",
  "tripadvisor_monas_352": "Nice park with pavilions representing architectures of each province. Filled with many cultural items. There are also sometimes cultural shows.A lake in the middle has islands...read more ",
  "tripadvisor_monas_353": "Nice park with pavilions representing architectures of each province. Filled with many cultural items. There are also sometimes cultural shows.A lake in the middle has islands representing Indonesia, visible from the cable car.There are also science, transportation, energy museums...",
  "tripadvisor_monas_354": "Great introduction to the country but be prepared to walk a lot. Look for special music and presentations at each pavilion and skip most of the pay to enter pavilions. Go to the Indonesia museum at the entrance. Somewhat run down by Disney standards, but a super intro to the country. 100k rp by taxi from Jakarta central.",
  "tripadvisor_monas_355": "Our visit here was very worthy, just heard about many stories and admired great architecture of Minitature Park. The atmosphere was very relaxing and people was friendlt as well.",
  "tripadvisor_monas_356": "If you do not have the time and money to visit all of Indonesia this is a good alternative I think when you are in Jakarta anyway and you want to fill your time with seeing something else of Indonesia instead of going to the mall.. I have not been there a long time but in general it is best...More  ",
  "tripadvisor_monas_357": "This is a place where we can experience Indonesia in a day! TMII has miniature of each province and the type of house where people live. So interesting. At least then we have a picture about Indonesia and plan for anothet trip to visit real island and city. We wish TMII gets support from Government to make it interesting place...More  ",
  "tripadvisor_monas_358": "What to say about this relic of a bygone era? It is all that you would probably expect - a bit kitsch, a little quirky, and a curious insight into how Indonesia (still) sees itself. All in all, it's an interesting way to while away an afternoon in Jakarta.The centrepiece of the park is a small man-made (or more...More  ",
  "tripadvisor_monas_359": "Indonesia has a lot of different race and tribes. This makes Indonesiavery unique and rich in cultures and architectures.Taman Mini Indonesia is a great place to learn about the major tribes, cultures and architectures. There are showcases of houses, dances and others. Visitors are able to learn almost all Indonesian cultures in one day.",
  "tripadvisor_monas_360": "My young girls and I really had fun here. The bird park was definitely the highlight, followed closely byt the decommissioned DC-? Air Indonesia aircraft. Lots of Indonesians pickicking and enjoying a day outside. Watch out for the traffic clise to evening - we waited in long queues for almost 90 minutes to get out! Otherwise a lot of fun!",
  "tripadvisor_monas_361": "One of the good attraction to visit when you are at Jakarta, Indonesia. This place is a exhibit of the various cultures in Indonesia.It took an hour to reach from the Rasuna said area. Initially we took a free shuttle to roam around the place. Then near the entrance , we hired an motor bike for 2 hours ....More  ",
  "tripadvisor_monas_362": "Situated SE of Jakarta, the park is huge and very family friendly. It displays Indonesian house architecture from all parts of the country. Count 2 hours just for the architecture tour and one full day if you visit all the museums.",
  "tripadvisor_monas_363": "There are lots of things to see inside. The staff at the tourist information centre were helpful and quite friendly. There is a cable car for 40,000 IDR per person, which my...read more ",
  "tripadvisor_monas_364": "It is actually a beautiful park. The name is misleading. We thought it have all the famous building of the world in smaller size. It is more of a cultural village/park. In short, you see Indonesia in 1 day. Once inside the park, it is difficult to go round. They do have van/bus to take you round the park for...More  ",
  "tripadvisor_monas_365": "Depend if you are a foreigner, you can visit the differences between all the island in Indonesia. Good for indonesian or people interested with Indonesian culture.",
  "tripadvisor_monas_366": "I've spent one day and it is not enough to visit all of their provinces showroom which showing us each of every provinces culture details. Need maybe at least two days if you'll interested so much in Indonesia culture details, without hurry off course.",
  "tripadvisor_monas_367": "I have had many visits to Indonesia and only found this place by accident last year.Essentially this is representations from each on the Indonesian provinces of cultural aspects including dance, food, wildlife and art.It is well worth the visit and will take about 4-5 hours to see the whole attraction.",
  "tripadvisor_monas_368": "There is lot to see at this place although it is quite far from the central and north Jakarta (located at south east of city). You can find different living style buildings of all over Indonesia plus museums and mini zoo, plus water park. However once inside it is very difficult to get around the place which pretty much frustrates...More  ",
  "tripadvisor_monas_369": "There are lots of things to see inside. The staff at the tourist information centre were helpful and quite friendly. There is a cable car for 40,000 IDR per person, which my friend and I found a bit expensive for the amount of time it travelled, but we enjoyed it and we got to know the whole area before we...More  ",
  "tripadvisor_monas_370": "Fascinating insight into the various cultural groups and their ways of life. Spoiled by the fast food resto presence, could do better in the genuine food department",
  "tripadvisor_monas_371": "We took a bike and ride around Taman mini. The most spot that I took photos the most is reptile park, where komodo is there. Others just many style of houses in Indonesia.",
  "tripadvisor_monas_372": "you can learn a lot about their culture while visiting this place. In this miniature actually is not really miniature for me cause the houses was built base on their normal size. But I would like to suggest tourist not to miss this interesting place.",
  "tripadvisor_monas_373": "Taman Mini is a thematic park that shows the impressive cultural diversity found in Indonesia. There are representations/models of each culture way of living along the big park. It is possible to rent a bike to see it faster and some nice houses and temples can be seen.Main problem is that this park is not conceived for foreing tourist...More  ",
  "tripadvisor_monas_374": "Yes! Even the name of this park use \"taman mini\" meaning \"small park\", mm.. they have a huge area with represent all of province in Indonesia, inclusive traditional house, art...read more ",
  "tripadvisor_monas_375": "Taman Mini Indonesia Indah is a wonderful place in Indonesia. You can learn many cultures of Indonesia here. Clean and interesting. Taman Burung is a best spot here. Many museums are very interesting. I recommend this place for your learning place.",
  "tripadvisor_monas_376": "One of the worst tourist attractions i have ever been too. The model of each of the houses from Indonesian provinces were not worth visiting at all. The houses did not even have a proper sign board at the entrance describing the province name. None of the readme sections inside the province houses were in english. How are we suppose...More  ",
  "tripadvisor_monas_377": "Yes! Even the name of this park use \"taman mini\" meaning \"small park\", mm.. they have a huge area with represent all of province in Indonesia, inclusive traditional house, art, culture and also tradition.If you dont have much time to stay in Indonesia, and you want to know about many traditions of Indonesia. This Taman Mini is your solution....More  ",
  "tripadvisor_monas_378": "Must do the cable car ride - it costs barely US $2 and provides a spectacular aerial view of the Park.The attractions are well presented and very informative.",
  "tripadvisor_monas_379": "If u transit in jakarta for traveling gateaway. U should come here, u can see all the traditional house and all traditional museum in here. They also have full scale diorama for all traditional stuff.For people with family they also have lot of theme park and facilities",
  "tripadvisor_monas_380": "i have visited Indonesia with my wife for a few weeks ago, everything was great even food , place and people , i do select our last visiting at miniature park it was perfect to have landscape photo on the temple, nice green garden and the flower of indonesia , i will be back for next time with my wife...More  ",
  "tripadvisor_monas_381": "You need to pay a entrance fee Rp 9,000 per person, a huge area with lots of Indonesia rich culture, you will find different types of building constructions of Indonesia, a very good place for photographing, the weather is warm however we incidentally found out there are transport near Snowbay (one of the attraction inside) that offers buggy service (none...More  ",
  "tripadvisor_monas_382": "Good experience for those who wants to see Indonesia - I mean the whole 72 provinces and their local traditional houses in built smaller in size.I have been here 4 times and been bringing my overseas guests here and they loved it.You can drive in or take another form of transport inside. i.e Shuttle bus and little train...More  ",
  "tripadvisor_monas_383": "Beautiful Indonesia in Miniature Park or in Indonesian better known as Taman Mini Indonesia Indah (TMII) is a tourist attraction that illustrates the richness and diversity of Indonesian culture. There are 25 bridge art and culture of the 25 provinces in Indonesia and 1 gym Activities of Women (Woman Activity Centre). In every house there is a custom rig from...More  ",
  "tripadvisor_monas_384": "I have visited Taman Mini in November 2007. It resembles various cultures of Indonesia like Sumatra, Bali, Java, Papua etc. There are separate places for each culture center. Cable car is available from entrance to end of the campus. First, i went through the cable car and observed entire campus. We can see various cultural centers from cable car. In...More  ",
  "tripadvisor_monas_385": "Indonesia is a big country with thousands of islands and each has its own unique culture, tradition and customs. So while it maybe very challenging for one to visit the entire...read more ",
  "tripadvisor_monas_386": "We got the opportuntity to check out Mini Indonesia. It was extremely crowded and we were the only westerners there. We actually had our photos take by a number of the local people.We found it confusing and crowded.There were a lot of areas and things to see but it wasn't a highlight for us.",
  "tripadvisor_monas_387": "this park really gives you a feel for Indonesia and all the islands that make up the country. You can also rent tandems and drive around, it is very large!",
  "tripadvisor_monas_388": "I gained a lot of knowledge ~ There is a balinese style museum inside, which displayed the cultures of people from different part of Indonesia. I spent 5 hours to discover Indonesia.",
  "tripadvisor_monas_389": "This park presents an overview of the varied culture prevalent in the thousands of islands that constitute Indonesia through a series of pavilions each devoted to separate areas/regions of this vast nation. There are very well kept examples of local life, dress and customs of the various tribes. Spread over a large area one can only do justice to the...More  ",
  "tripadvisor_monas_390": "Indonesia is a big country with thousands of islands and each has its own unique culture, tradition and customs. So while it maybe very challenging for one to visit the entire country to have a taste of its diverse culture which will take up a long time, worry not! By visiting this TMII Miniature Park, will allow you to have...More  ",
  "tripadvisor_monas_391": "It's like exploring Indonesia in one place so it's best to spend a day here. The place is really huge and it's advisable to rent a bike or a bicycle to explore all the areas. There are many places to see and get to know the rich culture of Indonesia. It's worth your visit in Jakarta. You have to pay...More  ",
  "tripadvisor_monas_392": "It's really good to spend our time here for relaxing and get our mood booster in the weekend. Enjoy the traditional side, our beautiful culture here,,,",
  "tripadvisor_monas_393": "Go early in the morning.Thy the sky train and the Sumatra, Sulawesi and Bali islands .Check their calender before as I went twice and Mondays they do not open all houses.",
  "tripadvisor_monas_394": "We can see all representative of cultures and customs of big clances who live in separate islands all way long From Aceh to Papua. Characterized by unique and specific traditional houses built in a good shape, filled with sufficient heritage things from each clance.An also beside all of those, we still can enjoy many others modern information and attractions...More  ",
  "tripadvisor_monas_395": "Nice place to visit if you're in Jakarta for the first time. I liked the map of Indonesia you see on the sky ride.",
  "tripadvisor_monas_396": "been here many times with my family. having 2 boys at age 5 & 2. we loved to go swimming at taman mini. my older son loves the sky train. sometimes twice is not enough!",
  "tripadvisor_monas_397": "been here many times with my family. having 2 boys at age 5 & 2. we loved to go swimming at taman mini. my older son loves the sky train. sometimes twice is not enough!",
  "tripadvisor_monas_398": "Gives you a full if a bit superficial over view of the different styles and cultures around the Archipelago",
  "tripadvisor_monas_399": "When in Jakarta if you have a day and wish to do see mini indonesia then head for this place. Many interesting buildings to see.",
  "tripadvisor_monas_400": "If you are interest in cultural objects and limited time to see them all over Indonesia, then visit this place is a must. Full of heritage building,arts and attractive lication t ok rake pictures, and off course souveniers can be collected here.",
  "tripadvisor_monas_401": "Amazing experience the way all different cultures and religions of Indonesia are placed in the single premise. The shopping experience of Indonesian art and craft is real value for money inside the park(much economical than in malls).The miniature bird park inside is like a added bonus to overall experience.The most amazing thing here is the multicultural and multi...More  ",
  "tripadvisor_monas_402": "In my opinion,TMII (Beautiful Indonesia in Miniature Park) is worth your time.Although it's true not every \"anjungan\" is in pristine condition and government surely could something about it, but there are still knowledge to gain from coming to TMII. We can see Indonesian culture in nutshell in that place.Word of caution, TMII is a huge place,so if you are interested...More  ",
  "tripadvisor_monas_403": "All these reviews must be paid or something. This place has cool buildings, yes, but they are not well kept. Also most of the areas are closed off and there is no information about them or the culture. We went to the \"reptile museum\" and it was a mistake. Poorly taxidermied animals that were falling apart inside and the live...More  ",
  "tripadvisor_monas_404": "I think one day is not enough if you want to see TMII or Taman Mini Indonesia Indah. Indah = Beauty. So to see the beauty you need to spend more time. Cable car ride for above almost all the islands gave us a great idea about different islands, the style and shape of houses and palaces they have. Passed...More  ",
  "tripadvisor_monas_405": "Was a great day looking at the various types of historical Indonesian dwellings. Was quite a lot of ground to cover on foot. We LOVED the reptile zoo. You are able to handle a variety of reptiles and touch a komodo dragon if it is a safe day to do so. At some point you can be overloaded by historical...More  ",
  "tripadvisor_monas_406": "Indonesia is a well-diversed country. This miniature shows how diverse is Indonesian culture. You can find a lot of attraction here. There are traditional houses (in normal size) of all province in Indonesia. Aviary, Aquarium, many kinds of museums, and much more to see.Been here 3 times, and still impressed with how big the place. I think you will...More  ",
  "tripadvisor_monas_407": "This place is probably the best if you are actually interested in knowing more about Indonesia. The place is very well designed with miniatures of actual attractions and houses...read more ",
  "tripadvisor_monas_408": "we went there when i was little with my late father, went there again recently with my little family, every pavillion of every provinces still have the strong magic to visit them, so unique in one place, even many new attraction offered my the company however the main attraction still mini culture and mini pavillion as the most fascinating one,.the...More  ",
  "tripadvisor_monas_409": "We went here various times throughout our 4 year stay. Wonderful Indonesia in miniature yes but they have buildings of different regions of Indonesia in normal size. You can visit them and learn a lot about the whole country in one visit. There is also a beautiful aviary & zoo. There are many small cafe's but only serve local food....More  ",
  "tripadvisor_monas_410": "This place is probably the best if you are actually interested in knowing more about Indonesia. The place is very well designed with miniatures of actual attractions and houses across Indonesia.Very interesting concept and you actually get to know how wide spread the country is with such diverse culture.",
  "tripadvisor_monas_411": "We were looking for something different to do in Jakarta that didn`t involve shopping. This is a lovely place to spend a few hours, it is huge! We drove around the facility and got out to walk around the display houses. The exhibitions are beautiful and provide a great view of the history of Indonesia. We also visited the reptile...More  ",
  "tripadvisor_monas_412": "We were able to see the costumes and houses of many areas in this vast country without having to travel from Jakarta. It was recommended to us by a friend who arranged for a guide, which I would suggest for any foreigner. You can spend anywhere from a couple of hours to an entire day.",
  "tripadvisor_monas_413": "Indonesia is very big archipelago with 13.000 islands, 34 provinces, 300 ethnics and hundreds of local language. It's sounds complicated. here, Taman Mini or Indonesia Miniature Park introduce you in fun and interesting way. You can see the architecture of each traditional houses, then traditional clothes, handicraft, attraction and many things!. This outdoor museum will introduce you about Indonesia in...More  ",
  "tripadvisor_monas_414": "This place was great to see and get a feel for the whole country of Indonesia. Very cool seeing how the housing differed from each different island. Definitely recommend visiting here!",
  "tripadvisor_monas_415": "A great place to visit to see all the architecture of the traditional villages and homesteads from all around the country, though I Differently recommend you rent a pick to see it all",
  "tripadvisor_monas_416": "The name Taman Mini (Mini Garden) sums it up basically. But do not be fooled my the name because it'll take several hours to properly explore the place. It contains buildings of all the different tribes, cultures and religions in Indonesia. If your visit to Jakarta is a brief one, you should definitely check out this place!",
  "tripadvisor_monas_417": "How unfortunate that we just passed by and managed to enter a few places in there. I will try to visit it again next time.......",
  "tripadvisor_monas_418": "Indonesia is an archipelago with over 17,000 island with diverse cultures and traditions. If your trip is restricted in Jakarta for some reasons, the only best way to get the feel...read more ",
  "tripadvisor_monas_419": "It is like seeing Indonesia in one day. Lots of Indonesian architectures, greenery and history in one place. It is very big, lots of walking around but there is a downside that everything is written in Bhasa Indonesia only. The cable car ride is very nice, you need to have cash to pay for ride and all features inside the...More  ",
  "tripadvisor_monas_420": "Indonesia is an archipelago with over 17,000 island with diverse cultures and traditions. If your trip is restricted in Jakarta for some reasons, the only best way to get the feel of Indonesia is to visit this Park. But don't be misled by the word \"miniature\". It's is enormous. You can't cover the park walking in one day. You need...More  ",
  "tripadvisor_monas_421": "you want to know about indonesia on miniatur? then you should go to this place. not only entertainment you'll find here but also about indonesian culture with traditional house of each province in indonesia",
  "tripadvisor_monas_422": "We came here with short search of places and Im glad that we did. This is very good place to know the beautiful cultures in Indonesia and visit places.",
  "tripadvisor_monas_423": "I strongly recommend visiting Taman Mini; you may not love it all, but there are elements that will enchant you. This enormous park--which contains everything from model houses to a museum of telecommunications to an aviary to a water park--was the brain child of a former First Lady of Indonesia and is sort of like a massive Pleasure Palace for...More  ",
  "tripadvisor_monas_424": "Beautiful Indonesia in Miniature Park or called \"Taman Mini Indonesia Indah\" is a government project for developing the culture of Indonesia. It is located in East Jakarta, and you can find 34 provinces attraction of Indonesia, 5 house of prayer (a mosque, a cathedral, a church, a temple, and a monastery), and also many museum.What I love this place...More  ",
  "tripadvisor_monas_425": "You can have all provinces here. The IMAX also is nice. It is recommended place for educational recreation.",
  "tripadvisor_monas_426": "\"Beautiful Indonesia in Miniature Park\", or Taman Mini Indonesia as it is properly known, isn't lots of Lilliputian houses and the like but life-size - even oversize - simulacra of housing styles from across the archipelago, with a science and technology museum and an old Garuda plane - amongst other oddities - thrown in for good measure. Some of the...More  ",
  "tripadvisor_monas_427": "Really nice place to go and see all Indonesian styles in one place. Even the lake has the shape of Nusantara.",
  "tripadvisor_monas_428": "Mini INDONESIAwant to know about Indonesia so you better visit thisand its a full day tourprepare anything like sun glasses , shirt , f & b etc",
  "tripadvisor_monas_429": "Interesting collection of what is best in the culture and islands of Indonesia. Thoroughly worthwhile expose to the diverse region and its many attractions",
  "tripadvisor_monas_430": "Interesting collection of what is best in the culture and islands of Indonesia. Thoroughly worthwhile expose to the diverse region and its many attractions",
  "tripadvisor_monas_431": "This park was originally built on idea representing the whole Indonesian archipelago. So there are many spots/area with Indonesia traditional houses, and of course occasionally traditional show such as musical or dance will be held on those spots. But now this park also have many other attractions such as Snowbay (Swimming Pool with Artificial Wave), Keong Mas IMAX and 4D...More  ",
  "tripadvisor_monas_432": "If you don't have enough time to explore Indonesia, try visit Taman Mini Indonesia Indah (TMII) in East Jakarta. You can find samples of culture from every province in Indonesia from Aceh to Papua.A day in Taman Mini would be enough to get to know the beautiful Indonesia and it's diversity. Try the cable car to see what the...More  ",
  "tripadvisor_monas_433": "I love the way how the traditional houses built. I brought some friends from Switzerland to go here and they just amazed with the architecture of those traditional houses. Don't forget also to eat the food in Anjungan Sulawesi Utara or North Sulawesi traditional house area. The food taste amazing and cheap. I only recommend this place to eat in...More  ",
  "tripadvisor_monas_434": "This park is built based on the Indonesian archipelago and its thousands of culture. You will see almost all traditional house, clothe, souvenirs in this miniature park. Take time to visit the place though it's a bit far from the downtown Jakarta. It is located on the east side of Jakarta. Not to mention the traffic you have to deal...More  ",
  "tripadvisor_monas_435": "Taman mini is indeed one of the most appealing destinations that you could never deny. It must take at least half a day discovering Taman Mini by motorscooter, or the whole day if you're going to go on foot. The complete exhibition of Indonesian culture, society & tradition makes Taman Mini a hard-to-deny attraction for those who love to get...More  ",
  "tripadvisor_monas_436": "Great place for the whole family. Although a but tatty now I still love the place. Essential for anyone visting Jakarta",
  "tripadvisor_monas_437": "Imagine big park with a lot of Indonesian traditional houses, many museums, bird park, spacious area with trees, a must try cable car (using this you might see the map of indonesia), unfortunately all still written in bahasa. Indonesian heritage, this is the shortcut. Have a great historical journey!!!",
  "tripadvisor_monas_438": "Highly recommended for newcomers to Indonesia, so they will get a taste of culture and diversity of Indonesia. Visit the pavillions of the provinces. Check the cultural and arts programs ahead of time. Don't miss the IMAX movie on \"Beautiful Indonesia\" showing once daily at noon time. Get the map and program booklet at the tourist information center. Plan to...More  ",
  "tripadvisor_monas_439": "Difficult to describe adequately, how to condense the essence and diversities of Indonesia into a themed attraction, well don't make it to formal (achieved) not to expensive (achieved) need a lot of space (its huge) Bit of architecture (from each tradition and region) Artefacts (by the boatload)Costumes and traditions (static and dynamic) something for the kids (attractions and theme...More  ",
  "tripadvisor_monas_440": "Indonesia is large in size - if you want to see Traditional houses of Indonesia - this is worth visiting. They also have a bird park ,a flower garden plus an Imax theatre.",
  "tripadvisor_monas_441": "Cheap tickets.Have big area with all the threes around.Try the cheap Sunday market and do some walk around the area.You can walk, run or biking.Stop where ever you see traditional houses with lots of traditional things inside.Best parts:Traditional dance shows on Sunday in some of the houses.Snowbay WaterparkMuseum Air Tawar (Fresh water...More  ",
  "tripadvisor_monas_442": "Indonesia is large in size - if you want to see Traditional houses of Indonesia - this is worth visiting. They also have a bird park ,a flower garden plus an Imax theatre.",
  "tripadvisor_monas_443": "The museum and various living styles gave an overview and appreciation of the cultural makeup of this diverse country. Some things were well done, others a bit tacky. There is a whole amusement park area that is very touristy and dirty. We had an English speaking guide who added a lot to the understanding as signage is limited in English.",
  "tripadvisor_monas_444": "A place one should not miss to visit in Jakarta. At least need 2 days to completely see the traditional history of Indonesia. Even though it was Sunday, crowded with locals and bit hot and humid, We had a great time. Don't miss the Indonesian Museum where a good guide (Mr. Mohideen) explained deeply and nicely about the pre and...More  ",
  "tripadvisor_monas_445": "Don't have enough time to travel around Indonesia? Don't hesitate to visit this place. You can you and explore the miniature of provinces in Indonesia. Easy to get there with public transportation. Just take TransJakarta from everywhere to Halte Busway Tamini then from there continue with Red Angkot number T01, T02, or 40.",
  "tripadvisor_monas_446": "Indonesia Miniature Park... well know in Bahasa Indonesia as Taman Mini Indonesia Indah.Located in the Eastern-part of Jakarta.Basically the original designed of this park, consist of a model of the houses from the 27 provinces of Indonesia, including East Timor that time. But nowadays the East Timor pavilion changed its status to become the Museum of East Timor....More  ",
  "tripadvisor_monas_447": "Very well maintained Park with amazing insight to Indonesian architecture and culture. Lot of museum which depicts history of different parts of very cantons of Indonesia. One must take the cable car ride. Only drawback is everything is in Indonesian , they should also have notification in english also. To roam around the park suggest to hire bikes which is...More  ",
  "tripadvisor_monas_448": "Used to be there several times but the last didn't like this place much. A lot of people a lot of cars that are now allowed to enter to the whole territory of the TMI and you can't walk peacefully. A lot of objects are still under reconstruction. But anyway this place is worth seeing if you come for the...More  ",
  "tripadvisor_monas_449": "Beautiful walk.. Birds park was wonderful and the houses from different regions were amazing.. The telefric across the lake was also enjoyable..",
  "tripadvisor_monas_450": "This park is worth spending a few days to see. We only had one day but stopped by the information Center and got a guide to come along to show us four of the houses and to explain about the variety of cultures in Indonesia. He was a walking encyclopedia of information. The park contains houses that represent almost every...More  ",
  "tripadvisor_monas_451": "An excellent place to observe the intricate and unique architecture of Indonesia. You'll need at least half a day to see the houses. We skipped all the other parks (bird, reptile...read more ",
  "tripadvisor_monas_452": "Went on a Monday and there were not very many people there. I thought the place was fairly run down and a lot of the houses we couldn't go into. Maybe try to go on a day where there is something happening...? We went in the bird park (again no one at the ticket booth), walked through and although there...More  ",
  "tripadvisor_monas_453": "An excellent place to observe the intricate and unique architecture of Indonesia. You'll need at least half a day to see the houses. We skipped all the other parks (bird, reptile, etc.) and museums. Would highly recommend that you hire a car/driver through the hotel to get there and to take you around the park at your own pace. The...More  ",
  "tripadvisor_monas_454": "The park is well maintained except for the bathrooms. There is a 3 star hotel in the park if you need to use the toilet. But overall its a very interesting and unique place to see all the cultures of indonesia. They have a reptile park, bird park, freshwater aquarium, space museum, armed forces of indonesia museum, science museum, electricity...More  ",
  "tripadvisor_monas_455": "Took a short tour, which was informative. The Museum and the traditional houses were fun to see. Didn't visit the water park, no kids, but from the looks of it, it doesn't look like it would be much fun.",
  "tripadvisor_monas_456": "I suggest hiring a car for the day to come visit Beautiful Indonesia. It is a distance from Jakarta and a taxi trip will cost quite a few rupiah. The park is spread out over a large area and having a car to move from one section to another is a great option. If you take a taxi you can...More  ",
  "tripadvisor_monas_457": "The miniature tour of Indonesian showcase of culture and diversity is worth a visit.Well laid out state wise galleries and actually we found souvenirs relatively cheap and ended with a cable car trip.",
  "tripadvisor_monas_458": "We were in the Park at very bad period, after the end of Ramadan, as it is the time that the Indonesians take vacations-everything was full of people. We were hours and hours in queues, was horrible.Although the Museum and the traditional houses are not to be missed - very interesting .Avoid the chairlift, which has no interest...More  ",
  "tripadvisor_monas_459": "if you only have short time to visit indonesia, please come to this place to experience the beauty of indonesia in one place. its a huge park, so you have to wear something comfortable include hat or umbrella because most of the area is an open space. do not forget to bring your camera to document every traditional houses that...More  ",
  "tripadvisor_monas_460": "The Komodo Dragon bldg was gorgeous and for a little extra you can touch a live but well fed Komodo dragon for the thrill of a lifetime. The acquarium was fascinating. We hand fed some fish. The aviary has a lot of birds with well fed rats running around. It's a well worth day although more English would help us...More  ",
  "tripadvisor_monas_461": "Taman Mini Indonesia Indah, which is located at the Southeast corner of Jakarta with an easy access from the Toll, is the place where tourists or locals would like to take a half day visit for a short glance of what Indonesia is made of. It's ambition and design to put in all of Indonesia's district cultures and architectural characters...More  ",
  "tripadvisor_monas_462": "The construction of different tribal houses in the miniature park are beautifully built in the traditional Minangkabau architectural style",
  "tripadvisor_monas_463": "The construction of different tribal houses in the miniature park are beautifully built in the traditional Minangkabau architectural style",
  "tripadvisor_monas_464": "Awesome place with an unforgettable climate. The maps could be a bit clearer and many places are not easily found based on the ones offered at the tourist information. The air lift around the lake is a must :)",
  "tripadvisor_monas_465": "It's an educational place for kids. Learn about any kind of ethnic house from all ethnic in Indonesia. It also has a science museum. For me, it's a nice place to learn but not to vacation.",
  "tripadvisor_monas_466": "On my last trip to Indonesia I had the pleasure of visiting Taman Mini. What a wonderful place if you are after an Indonesian experience this is the place to get all of Indonesia in one place. All of the exhibits are located around a beautiful lake, which I discovered after a monorail ride, is an exact replica of the...More  ",
  "tripadvisor_monas_467": "this place is educational somehow because we get to see indonesia the whole country in just one place. AS a huge archipelago in asia going to those places take hours or days, so this tourist spot they made will make you thinks or plan where to go next in indonesia. their representation of every culture in every place was great...More  ",
  "tripadvisor_monas_468": "Taman Mini Indonesia Indah as it's named, has been an effort to show the world about Indonesia at a glance, culturally and geographically. Although I used to work in one of the two hostels here, I visited it again last month, and I still think TMII is a worthwhile to visit when you are in Jakarta and it's surrounding.",
  "tripadvisor_monas_469": "I went to this park during the celebration of Iedul Fitri with my family (total 9 peoples). The place was crowded with people. Since we arrived late and the weather was also not really good (dark cloud and drizzling), we didn't really see much. We opted to take the sky train cable. The scenery from the top was good, but...More  ",
  "tripadvisor_monas_470": "Less then we expected.It's a wide display of the Houses architecture and the Traditional dresses.We did enjoy the Tele-freak but the seen wasn't very different.I enjoyed the national museum , it was nice very informative in spite of the simple items displayed and the tour was extremely helpful and cooperative.",
  "tripadvisor_monas_471": "Lots of interesting museums representing the different cultures of Indonesia . Many exhibits and representative to speak with while walking around. A lot of walking but worth it after a long plane ride",
  "tripadvisor_monas_472": "I saw the same ideea in Bangkok ,but is a huge difference between this two. The ideea is great,because tyou can see buildings from all the regions,or museums from all domains,wich is good,educational speaking... But !... Who was the genius who approved the use of the cars and motorcycles on the alleys of this park? Instead of watching to the...More  ",
  "tripadvisor_monas_473": "Must go place in Jakarta i found the miniatures beautifully made giving complete picture of what Indonesian culture is specially the museums showing the traditions and the dresses...read more ",
  "tripadvisor_monas_474": "we visited recently and were impressed and disappointed at the same time, yes it's big and has loads to see but most of it has been allowed to fall into disrepair ,it could be such a beautiful place , but the waterpark looked good and well supported",
  "tripadvisor_monas_475": "For the Dutch readers I would explain Taman Mini as a kind of Madurodam, except that the landmarks are far bigger than they are in The Hague. For all others: Taman Mini is a themepark where famous landmarks of Indonesia are portrayed per province.I would especially recommend renting a bike, since the park is rather big. In the bird...More  ",
  "tripadvisor_monas_476": "you can touch Komodo Dragon here. go to reptile museum inside the park find the Komodo Handler & ask if Komodo can be touched today.sometimes Handler is not on duty & you can go into Komodo Cageeven if the Komodo has been living with human since baby, but... still... be careful, listen to handler instructions.have fun",
  "tripadvisor_monas_477": "Good choice if you have a day to spend in Jakarta and you have already visited the old Batavia. Here you can see the whole Indonesia in one place, with the different Islands of Indonesia represented together with their traditional houses and costumes. You can also rent a bike and go around, take a tour on the cable car (not...More  ",
  "tripadvisor_monas_478": "Must go place in Jakarta i found the miniatures beautifully made giving complete picture of what Indonesian culture is specially the museums showing the traditions and the dresses on different occasions... Its good to go when the weather is nice and make sure to have comfortable shoes if u plan to walk around otherwise there are buses to take around...More  ",
  "tripadvisor_monas_479": "this is the place to look more into many Indonesian cultures. you can see the cultures from different islands that are spreading withing Indonesia territory.",
  "tripadvisor_monas_480": "Located in Southeastern Jakarta, this is a must stop for all tourists into Jakarta to see all of Indonesia in one place, as Indonesia is a large country to visit for many. Each provinces of Indonesia is represented here with a museum inside its respective traditional houses.Be sure to visit the Komodo Dragon museum as you might be able...More  ",
  "tripadvisor_monas_481": "This is a huge cultural, educational and entertainment park, all in one place, here we can find a complete pictures of Indonesia's rich cultures. There are traditional houses from every provinces in Indonesia, 27 are in a real size while the other 6 are a little bit smaller than the real size. There are lots of museum like transportation museum,...More  ",
  "tripadvisor_monas_482": "WOW,, what a great place to visit .. one can see Indonesia from sabang till merauke .. It represent indonesian cultures",
  "tripadvisor_monas_483": "i can find all indonesian cultures with 'rumah adat', and enjoy playing ground with 'snow-ball' water boom, 4D theater, sky-bridge, etc. spend my valuable time to take a rest and gather with my family",
  "tripadvisor_monas_484": "Pro : This place will Spend your time to study anthropology about Indonesia archipelagoCons : Actually the model is not really up to date",
  "tripadvisor_monas_485": "We went on our 3rd day there with my 3 kids, and this was a fun way to educate us all about all the peoples and cultures of Indonesia. We had a tour guide for an hour who was very informative. Seeing the range of lifestyles, cultures and religions across the region in model buildings from the different regions with...More  ",
  "tripadvisor_monas_486": "Pro : This place will Spend your time to study anthropology about Indonesia archipelagoCons : Actually the model is not really up to date",
  "tripadvisor_monas_487": "In a beautiful setting, many styles of Indonesian houses. Different islands have different architecture and all are represented here. Full size buildings very ornate carvings and good access to them all. Many steps and much walking necessary. There is a train/monorail quite an exciting ride but the windows were plastic and very scratched so visibilty was not good. We took...More  ",
  "tripadvisor_monas_488": "This is really a nice place to know about the places in Indonesia. It would be better if the place is well-maintained and comes with a shuttle service.",
  "tripadvisor_monas_489": "A fantastic day out and a snapshot of all the different cultures that are spread across the very diverse Indonesia",
  "tripadvisor_monas_490": "I used to be amazed by how colours and attractions in Taman Mini always excited me. I was aware the last time I went to the park was like sometime in 1993. Twenty years after that, I am no longer excited. First because there's nothing changed there, nothing really new and exciting, some attractions applied admission while some are not....More  ",
  "tripadvisor_monas_491": "When I went it was liburan(schools holiday) so it was packed with people that we could barely walk ! the traffic towards Taman Mini took us 2hours from Jakarta city centre and we were there for an hour just because we could not find any place to go as of too many people everywhere. When getting in by car to...More  ",
  "tripadvisor_monas_492": "this place is huge. it is advisable to get a map and latest happenings or programme before getting there. this way, you can save time and still be able to join in the scheduled event, avoid large private gathering etc.for me personally, I came here once before in 1983. This is a trip down memory lane. At that time,...More  ",
  "tripadvisor_monas_493": "For those who want to learn more about the culture of Indonesia races and how they live, should come to Taman Mini Indonesia Indah(TMII or rough translation is Mini Beautiful Indonesia Park). This park is consist of all the houses from Sumatra to Papua. It also have museum, such as Transportation Museum(where alot of antique and old train is being...More  ",
  "tripadvisor_monas_494": "It should be a wonderful place to visit,here we can see the representative of Indonesian culture. Besides that there are many interesting museums also but now is lack of maintenance.Very sad...",
  "tripadvisor_monas_495": "There are various pavillions, museums, and buildings to see. You can't see everything in one day.We liked the fresh water museum. Museum comodo was so-so.We rented an electric...read more ",
  "tripadvisor_monas_496": "Beautiful mini Indonesia what a pleasant way to see the diversity of cultures of Indonesia. One visit is not adequate. Highly recommended.",
  "tripadvisor_monas_497": "There are various pavillions, museums, and buildings to see. You can't see everything in one day.We liked the fresh water museum. Museum comodo was so-so.We rented an electric motorcycle. At the information center, they told us it's 30,000 rp but the actual rental guy said 50,000rp. We kind of felt cheated but paid 50,000/hr anyway.We spent about...More  ",
  "tripadvisor_monas_498": "A park with interest for all ages. We opted to hire a scooter taxi and were whisked around the large and sprawling park with ease. Plenty of places to grab food or a coffee and retail outlets full of souvenirs. We visited the flora and fauna museums and aquarium and the transport museum. All were good although very few live...More  ",
  "tripadvisor_monas_499": "I visited here with Indonesian friends of mine. Huge complex and lots of museums here. We spent the whole day here and the place is very big. We only got through half of it.It exhibits Indonesian unique traditional houses and culture of all provinces of Indonesia. Inside there are also various museums, play parks for the kids, bird parks and...More  ",
  "tripadvisor_monas_500": "For first traveler to Indonesia, you gotta see this first to know about various of Indonesia culture and what best of Indonesia.",
  "tripadvisor_monas_501": "Great place! It is a quick preview of the Indonesian culture and the architecture of all the provinces of the archipelago. You can see how a typical house from Sumatra, Kalimantan, Papua, etc. looks like and find out a bit more about their daily life. There are also different museums, parks and temples, that are all worth to visit. We...More  ",
  "tripadvisor_monas_502": "Taman Mini is a Miniature Park of Indonesia located at south east of Jakarta. It exhibits Indonesian unique traditional houses and culture of all provinces of Indonesia. It provides general information about the large ethnical living tradition in each provinces such us art product, musical, wedding dress and other unique traditions. Inside there are also various museums, play parks for...More  ",
  "tripadvisor_monas_503": "We went (3 person) to see again this place on the first of May, this is for me the best place to see in Jakarta, you can learn and see how people around Indonesia live and their cultural places.Is really great, plus there is a very nice aquarium a butterfly/insect museum and several big huge cages with beautiful birds...More  ",
  "tripadvisor_monas_504": "Taman Mini (Miniature Park) Indonesia is a one-stop cultural exhibition. The park is divided into small compounds and each compound features a unique culture from major parts of Indonesia.There are several ways to explore the park: monorail, cable car, a trolley/train or on foot. Our group first walked about on foot, but when we tried to take the monorail...More  ",
  "tripadvisor_monas_505": "Taman Mini was built in 1975 and is really showing its age. Most of the buildings are in decent shape, but there doesn't seem to be any organiztion to the place. Entry was 10,000 Rp,or about 86 cents. It's unclear why they bother with an admission except to keep eveyone from squatting in the place. Taman Mini struck me as...More  ",
  "tripadvisor_monas_506": "A bit old. But we can learn many things from 1 place. The science center was cool. And the giant golden snail theatre.",
  "tripadvisor_monas_507": "A bit old. But we can learn many things from 1 place. The science center was cool. And the giant golden snail theatre.",
  "tripadvisor_monas_508": "It's a good destination, especially for foreigner to know more about indonesia in a very limited time. It's really the miniature of indonesia.",
  "tripadvisor_monas_509": "Indonesian people very proud of monas (monumen nasional). It is not only the landmark of Jakarta, but also historical monument of Indonesia. from the top of Monas, the landscape is very exceptional. You can see the city of Jakarta in all directions. I recommend Monas to those who want to learn the history of Indonesia",
  "tripadvisor_monas_510": "It gives you lots of infos about Indonesia from West to East. If you have time try to visit East Java area, they have some good food stall and worth to try!",
  "tripadvisor_monas_511": "If you appreciate culture and have a day to spare in Jakarta, it would be hard to beat spending the entire day at Taman Mini (or TMII). Taman Mini is first and foremost a cultural park, secondarily a Disneyesque amusement park, and thirdly a concentration of museums. On Sundays there tend to a fair number of musical shows on various...More  ",
  "tripadvisor_monas_512": "Must make a point in visiting this place. Huge and well setup park where you can get a glimpse of the diverse cultural Indonesia and other attractions.You could spend a whole day here.I am impressed.",
  "tripadvisor_monas_513": "It was a combination of whole indonesia. It was good to know about various states, plus there cultural. But it is so huge that we selected the pavilions in which we were interested. We went to few museums, reptile park and bird park. Museums were good, Though we were disappointed with the conditions of animals in reptile park. There were...More  ",
  "tripadvisor_monas_514": "Very nice attraction parc representing all the provinces of Indonesia. Each province presents his characteristic archictectural style. Inside the premises they present local culture. The quality of the exhibition inside is very different from one to an other province. Taman mini Indonesia indah gives a very good and nice overview of the major Indonesian cultures. Visit takes at least 5...More  ",
  "tripadvisor_monas_515": "Been there with friends for a whole day.It might have been great...in the past.First of all, the reptile house is SCANDALOUS! Animals are just dying out there:- Sea turtle in a ridiculously small aquarium- Snakes all dried out in their tank- Crocodiles in low level muddy and polluted water place- Komodo dragon dying with...More  ",
  "tripadvisor_monas_516": "A environ 45 minutes du centre de Jakarta, le parc est forme autour d'un lac et entoure de maisons de differentes regions d'Indonesie. On peut y passer de 2 heures a toute une journee. De nombreux endroits pour pique-niquer et de buvettes partout. Une jolie facon d'avoir une idee de l'architecture variee de ce pays.45 minutes drive from the...More  ",
  "tripadvisor_monas_517": "This is a collection of full size structures and historic artifacts from all over Indonesia. They are not really miniatures, only the representation of Indonesia is in miniature...read more ",
  "tripadvisor_monas_518": "This is a collection of full size structures and historic artifacts from all over Indonesia. They are not really miniatures, only the representation of Indonesia is in miniature. Our time was limited here and you really need a full day to see a majority of the park. We especially enjoyed seeing the different types of houses from the various islands...More  ",
  "tripadvisor_monas_519": "The place has a lot of unrealized potential. Some of the pavilions are interesting, but it's generally a bit run down and chaotic.",
  "tripadvisor_monas_520": "Wonderful park with cultures, buildings from all over Indonesia. After I visited the place, I had an instant knowledge about Indonesian people, geographic, and even a bit of history. Very recommended to people who travel to Jakarta Indonesia the first time.",
  "tripadvisor_monas_521": "You can see many things about Indonesia in this park, building style, traditional costumes, and a little bit of culture. This park is a good place for sight seeing but not much hands on activity. There are also some museum in this park, in my opinion the best is Bird Park Museum, it has so many collection (it has more...More  ",
  "tripadvisor_monas_522": "It's an out-and-out touristy area, but gives a peek into the indigenous homes of the varied native populations of Indonesia.A couple of the pavilions house artifacts that help understand the way people live in these areas, but most are mere buildings.Sheer curiosity took us there, but it's not much you miss if you don't make it a part...More  ",
  "tripadvisor_monas_523": "I had a few college friends came to Jakarta, Indonesia to visit me on February 2014, it was such a short trip. They wanted to see something cultural and so Indonesian. So, Taman Mini Indonesia Indah was the perfect place to go! It was like visiting the whole Indonesia in a day, literally..because you can find the miniature of Indonesian...More  ",
  "tripadvisor_monas_524": "This is a park of miniature Indonesia that showing culture of most provinces in Indonesia. The location is in East of Jakarta",
  "tripadvisor_monas_525": "Surprisingly taman mini indonesia indah got so many things to offer. As you might know, Indonesia is multicultural country. TMII is the right place to know it all. Each traditional house are made with details and located side to side. You also can enjoy traditional performance from many different province.",
  "tripadvisor_monas_526": "Don't have to spend a lot of money to go around indonesia, just go to taman mini Indonesia then you can see a lot of cultural attraction or cultural building then you can learn something from that",
  "tripadvisor_monas_527": "Just visit indonesia in one place,No need to know what is the circumference Indonesia because all there is",
  "tripadvisor_monas_528": "Initiated by the late Mrs. Tien Suharto (wife of former President Suharto), Taman Mini is located South East of Jakarta City.It is actually a terrific place for overseas visitors...read more ",
  "tripadvisor_monas_529": "Initiated by the late Mrs. Tien Suharto (wife of former President Suharto), Taman Mini is located South East of Jakarta City.It is actually a terrific place for overseas visitors to be able to see Indonesia in Miniature. There are carriages to drive visitors around and visit various buildings representing the various parts of Indonesia. Don't go there on weekends as...More  ",
  "tripadvisor_monas_530": "We were rushing to Taman Safari. We spent little time there but managed to see some of the houses and from what I understood from the driver, some of the tribes actually make the houses as their centre where they gather most weekends to do cultural activity with their clan. I had the opportunity to see one of the tribes...More  ",
  "tripadvisor_monas_531": "TMII is absolutely worth going to for the Bird Park alone, which is really great (despite the birds outnumbering the rats by only about 2:1). The hornbills and cassowaries alone are worth the trip. And go see the 12:00 Imax show \"Indonesia Indah\", in its full Soeharto-era glory. And the Bug Museum and FW aquarium are worth the visit. That's...More  ",
  "tripadvisor_monas_532": "Taman Mini Indonesia is for sure NOT a dreamland or an amusement park in the classical meaning but still is worth it, you can have an idea how wide and different Indonesia can be, see some of the typical houses and have some nice games to play here and there! the park itself is very big you'll need lots of...More  ",
  "tripadvisor_monas_533": "Look indonesia archipelago . you can know about indonesia culture. Kereta gantung is my favorite game",
  "tripadvisor_monas_534": "Far away from city, not much happening exhibition wise except zillions of families driving through(!) the park on motorcycles and cars.",
  "tripadvisor_monas_535": "This is a nice place to learn about Indonesia. It is outline of virtual aspects of the cultures and heritages of Indonesian people.Notes•It’s better to visit Taman Mini Indonesia Indah on weekdays to avoid the crowds during weekend.•wear flexible footwear for easy take off and put on since you’re not allowed to wear footwear to enter the...More  ",
  "tripadvisor_monas_536": "Its a little far from the City but totally worth visiting. Start early from the city otherwise there is a good chance that you may be stuck in the traffic.Try the cable car to enjoy the view & dont miss the Imax screen.I saw 'Rescue' which is american documentary with Indonesian language dubbing. It was funny !!",
  "tripadvisor_monas_537": "Nice place to see and you can visit komodo dragon musiem.I enjoyed it. You guys can take public transport. Cost you only RB 3500. Take transjakarta bus",
  "tripadvisor_monas_538": "Best way to get a feel for Indonesia and to learn more about this wonderful country!Time spent here is time well spent!!",
  "tripadvisor_monas_539": "Not a bad place to take a break and make some good photo.Spend few hours here. Will come back again with few lens since only carry one lens today and visit all the park and...read more ",
  "tripadvisor_monas_540": "I like the atmosphere. it was very friendlyit is better to rent a car to go around and skip the part you dont want.not much choice of food.It was fun to do the telecabin ride and see the mini-map of indonesia made on the small lake.overall it is a a fun day out to do on...More  ",
  "tripadvisor_monas_541": "Not a bad place to take a break and make some good photo.Spend few hours here. Will come back again with few lens since only carry one lens today and visit all the park and provide full review of the park.",
  "tripadvisor_monas_542": "If you do not want to go far away from Jakarta but want to have much fun - you should definitely come here. It take about half an hour by taxi from Jakarta center and this is a place you will spend a whole day. You can enjoy the first cable car in Indonesia seeing a map if the country...More  ",
  "tripadvisor_monas_543": "Nice for an afternoon off, with typical buildings of different parts of Indonesia, a very nice aviary and other museums.",
  "tripadvisor_monas_544": "This was our first day in Indonesia, which we had ‘spare’, and as the guide books did not encourage us to spend the time in Jakarta itself we had booked a car to take us to Bogor for the day. However our driver suggested that we stopped here for a few hours first. I am glad that we did as...More  ",
  "tripadvisor_monas_545": "This park actually has several good spot but mostly need more attention. it's getting old and broken.",
  "tripadvisor_monas_546": "It is a huge park spread over a vast area and depicting the various areas of Java and Sumatra-the way the people live, their houses etc.One could see hordes of locals picnicking here. There are various modes of transport inside to cover the entire area-cable car, open cars etc etc",
  "tripadvisor_monas_547": "This has to be seen, While it is about 45 minutes drive from Central Jakarta it provides a unique insight in to a number of provinces that make up Indonesia all under one roof. There is also a theme park, a water park, cable car, fast food, local food, bicycle and scooter rentals. Very good day or even days out...More  ",
  "tripadvisor_monas_548": "When in Jakarta , indonesia, one should not miss going to this park, it is a great combination of history,geography and science. I believe it is a copy of the Philippines Nayong Filipino, which was built first but smaller compared to Taman Mini. It is so big for despite the three times I have gone to this place, I think...More  ",
  "tripadvisor_monas_549": "Indonesia is a land with thousand islands and some are not easily accessible but Indonesia is rich in culture and tradition and despite the colonization by the Dutch in the past, the culture and heritage remains intact. To many travellers who are in a hurry and stay only in Jakarta and pretend to know all about Indonesia, it is best...More  ",
  "tripadvisor_monas_550": "Reptiles, for me the highlight was comodo dragon and huge python which i held in my hand first time in my life. The aquarium was decent.",
  "tripadvisor_monas_551": "Reptiles, for me the highlight was comodo dragon and huge python which i held in my hand first time in my life. The aquarium was decent.",
  "tripadvisor_monas_552": "This is an amazing place you have bit of everything here... Waterpark... Famous buildings... Boating... animals... Komodo Dragon.. Just hire a bike and go around the place... If you are traveling with kids they will love it.. every attraction has a price ranging from 5000 to 130000 IDR...",
  "tripadvisor_monas_553": "A very good combination history and geography and amusement park. all in one place located southeast of jakarta. it has buildings from all the indonesian islands and a nice mini island based representation of the islands in a man made lake. Very busy on weekends and holidays so come early. The swimming complex is very expensive by Indonesian standards but...More  ",
  "tripadvisor_monas_554": "I never expected that you can build a whole country, but then when I saw this place just loved it.make sure that you either rent a bike or a scooter to travel the place, else they wont help you with the pain balm.dont forget to take the ropeway.",
  "tripadvisor_monas_555": "We really enjoyed to see this place but far from the city center.We were amazed of the style and since we couldn't visit all the places in indonesia atleast here we see some of indonesian houses.",
  "tripadvisor_monas_556": "Beautiful and they have different entertainment from water park to theater inside, and you can get an idea about indonesian culture and the attendans were very informative. The only drawback is d food stall, quite expensive for indonesian standard, tastes okay and very small portion. Should visit if you're in Jakarta!",
  "tripadvisor_monas_557": "If you want to take a glimpe look of what Indonesia is like, this is it. The huge complex houses each province's pavillion decorated with each architectural traditional house with some exhibition as well. Besides those, there are several museums worth visiting as well.Imax theatre called Keong Mas, has some movies about Indonesia, which is a \"can't miss\" attraction...More  ",
  "tripadvisor_monas_558": "If you want to see all of Indonesia in one day then look no further than here. Every Island and province in Indonesia is showcased by way of their traditional houses and dress. There's a cable car also for the people who want to see it without working up a sweat. stuff for the kids too! Great cultural day out.",
  "tripadvisor_monas_559": "Very nice place, green, all Indonesian culture bring together, require full day to round all the area.",
  "tripadvisor_monas_560": "great buildings, cultures and architectures,, you will know indonesia in just 6 hours.. need more active traditional activities such as musical, dances, and other cultural performances esp. during the weekdays.",
  "tripadvisor_monas_561": "The place has a lot of miniature of Indonesia's traditional house from all around Indonesia. They have also some place such as Istana Boneka, Musium IPTEK (one of my favorite...read more ",
  "tripadvisor_monas_562": "The place has a lot of miniature of Indonesia's traditional house from all around Indonesia. They have also some place such as Istana Boneka, Musium IPTEK (one of my favorite place), Taman Burung.But the management need to more focus on maintenance, some miniature and place need to repair and repainting.",
  "tripadvisor_monas_563": "I visited here with my local friends and saw diverse cultural heritage of Indonesia. The park is massive with real size houses of different parts of Indonesia and a collection of museums. I had only a few hours and wish I had all day.",
  "tripadvisor_monas_564": "This is a wonderful day trip, especially for groups and families. I visited with some Indonesian friends who explained that the park was built by Suharto in the 1970s as a kind of permanent exposition of the various cultures and regions of Indonesia. Each province has it's own pavilion, some including restaurants. There are also several mosques on site, where...More  ",
  "tripadvisor_monas_565": "I was unsure about what to expect but the animals looked in good health and good humour...I liked to see them wandering about and not penned....up close encounters with zebras and ostrich...and the petting zoo was not crowded at all and the animals we're calm and cuddly....",
  "tripadvisor_monas_566": "We visited on a Monday and the areas open were excellent in showing buildings and life from various parts of Indonesia. We concentrated just on Sumatra and Java displays and will come back again for other displays. Miniatures of significant monuments, such as Borabadur, added to the experience. It was wonderful to see Indonesians finding out more about other parts...More  ",
  "tripadvisor_monas_567": "Went with my wife and two daughters and really feel awed by how one place could portray the wide diversity of the Indonesian cultures. I think all the ethnic groups of Indonesia is represented here. For the kids they have quite a number of activities in some of the places.If you really have the time, you could have a...More  ",
  "tripadvisor_monas_568": "Indonesia is a so big and well spread. To see most of the baetiful places could take at least a month, tiring and naturally expensive. Visit this park and you will really see Indonesia in miniature. Foreign tourists should get a guided tour.",
  "tripadvisor_monas_569": "We went to Taman Mini Indonesia Indah (TMII) on Monday, a non-holiday day as a party of 3 adults, 4 kids (2-8). IDR 30,000 to get in. If you are at the main entrance, best thing to do is visit the Information centre and get a map of the place - it is huge. Be aware if you don't speak...More  ",
  "tripadvisor_monas_570": "This place is huge, and seems like indonesia packed in one place. you can have Bali and papua next to each other here. They have tons of museums covering everything from A to Z of indonesia. Its better if you have a tour guide, so you can keep track of where you've been and won't get lost.",
  "tripadvisor_monas_571": "This place is huge and is overwhelming especially in the warm weather if you do not have a plan. The houses representing the different islands and regions of Indonesia are very interesting to walk through. Some have better exhibits than others. Not all of them are always open and sometimes it is hard to tell until you walk up the...More  ",
  "tripadvisor_monas_572": "This is a very large park with replica buildings each reflecting the culture and architecture of a specific region of this vast country. Some are large museums others just small...read more ",
  "tripadvisor_monas_573": "This is a very large park with replica buildings each reflecting the culture and architecture of a specific region of this vast country. Some are large museums others just small houses. It is very large but well laid out with a train track and a cable car for when you get tired. Beware if you don't ask to get out...More  ",
  "tripadvisor_monas_574": "After the main person who build and make this place famous passed away, they start to run it as long as it runs. no good maintenance, no improvement. all run down.Hope they can get better with it.It's so famous that you can see the mini indonesian archipelago here, and also all the culture from all over indonesia here....More  ",
  "tripadvisor_monas_575": "I liked that we were able to move around in our vehicle, and stop when we felt like going to look at a particular house! (This is especially important if you have old folks travelling with you). The place is huge and the design well-thought out, with a replica of Indonesia in the form of islands in a huge lake...More  ",
  "tripadvisor_monas_576": "It is a great place to learn about Indonesia. You can find all of Indonesian traditional houses, museums etc. here. Entrance fee is 9,000 rupiahHow to go there:A. Through Busway (costs 3,500 rupiah) – Drop off at Garuda Taman Mini. Then ride Angkutan Kota (Angkot) red car number 01 or 02 (costs 3,000 rupiah). Ask the driver to...More  ",
  "tripadvisor_monas_577": "I visited to Taman Mini Indonesia Indonesia or TMII with my colleges four times. All of my purposes are to introduce Indonesia regions to my friend from abroad, such as traditional life, house, tribe cloths, etc. Usually, before they visit a part of Indonesia, I can introduce firstly to them, so they will interest to visit it. May be, TMII...More  ",
  "tripadvisor_monas_578": "As most things in Jakarta the place is based on a nice idea but execution is bad. However if you are interested in traditional Indo architecture its worth a visit. Avoid weekends as it will be bursting with families. Also beware of traffic. It's not worth to be stuck in traffic going there and back for hours on end.",
  "tripadvisor_monas_579": "I live in Jakarta so I know the place. It was very famous and in a good hand when our former 1st lady still alive. The park has many Indonesia traditional houses and handy crafts.Although the whole area is not well maintained currently, but you can still see several attractive museums such as butterfly museum. Instead of snakes and...More  ",
  "tripadvisor_monas_580": "Do not expect to see mini building, or be a Gulliver, practically, this park is the venue or \"anjungan\" for each province in Indonesia to represent their traditional house and handy craft. The way I see it, its more like an expo, but permanently.if you happen to be there, just visit the park or \"taman\" , some of the...More  ",
  "tripadvisor_monas_581": "Avoid this in weekends, it will be over crowded.Not bad to get an insight of what Indonesia has on offer, but I would recommend to see it all in real time, not in this park.",
  "tripadvisor_monas_582": "You will need to spend at least half a day at this attraction. There's plenty for kids, but there are also some very good museums, although the standard of the facilities is poor. Interesting to see all the different styles of traditional housing from around this diverse and fascinating country.",
  "tripadvisor_monas_583": "This place is a good place to get first hand feeling abaout how diversified is Indonesia, although this was built during the old days when Indoneisa is consist of 27 province but...read more ",
  "tripadvisor_monas_584": "Well done so many years ago. not perfect but visitors can get an over view of house styles from all over this huge country in a five hour visit.Well done GOI!",
  "tripadvisor_monas_585": "Here we can see all traditional houses of all provinces in Indonesia. Lots of attractions we can see here. Lots of playing grounds that our children can play. It is very nice place for visiting in Jakarta.",
  "tripadvisor_monas_586": "I always bring first time visitors to TMI as this gives a good glimpse about Indonesian culture. Our visitors always have a good reaction to the different reproductions of traditional houses. But that's about it for me. It seems though that it is still very popular site for local tourists so please don't visit on a weekend or a holiday...More  ",
  "tripadvisor_monas_587": "This place is a good place to get first hand feeling abaout how diversified is Indonesia, although this was built during the old days when Indoneisa is consist of 27 province but ut is still very much represent the real Indonesian archipelago.",
  "tripadvisor_monas_588": "Actually this place is okay, but too huge and i think its boring if you dont enjoy the national things of Indonesia from the traditional side. But if you look for our cultural things, then this would be a good idea to go around taman mini.",
  "tripadvisor_monas_589": "This is a huge place with lots of things to see and do, not far down the toll road. Bring your visitors here. I explored the traditional houses, learning about their musical instruments, wedding costumes, weapons and more. Not all the information is in English, but some of it doesn't need to be either. You were able to take photos,...More  ",
  "tripadvisor_monas_590": "The place is big..but dont expect to see the original traditional houses of indonesia there..Most of the houses are modern motif made of cement..But i do like the bali tarditional house but dissappointed because we go on MONDAY..certain house are close on monday..u can only see from outside only..try the cable car cost 35000 per person..u can see the whole...More  ",
  "tripadvisor_monas_591": "Just today, i visit TMII after a long time never visit. It was, a lot of visitor. In some area there was marriage function too. For today, there was some attraction, some dancer from each tribe or province was dance. They were perform in front of army and government. I just see the dancing from many people feom upside using...More  ",
  "tripadvisor_monas_592": "After a long 1.5 hrs drive from Jakarta to this place you really have nothing much to do. The place is frequented by locals and is more a fair like atmosphere. there is hardly any information flowing in English ( Typically Jakarta) and left wondering what you would want to do here. Even the information desk was hardly any help....More  ",
  "tripadvisor_monas_593": "We can learn a lot about tradition of Indonesia through Miiature Park . We can see many old temples . We enjoy traditional performance by professional dancers . Their customs are so nice and golden. They are so beautiful when they do . We also see the green view covering the park. We are so excited about this trip.",
  "tripadvisor_monas_594": "Well arranged to give you a sneak preview of a vast array of Indonesia.Make sure to read all the story behind each every tradition/culture or..... bring a cam and your best hair...read more ",
  "tripadvisor_monas_595": "Visited from the morning to the afternoon. Ride the cable car cost Rp. 30,000/person. It was weekdays but Idul Adha holiday and it was not crowded. Very spacious, you can go around with your own vehicle inside. We went to PP IPTEK, this is a science center, the kids had their most fun here with many interactive science games. To...More  ",
  "tripadvisor_monas_596": "Well arranged to give you a sneak preview of a vast array of Indonesia.Make sure to read all the story behind each every tradition/culture or..... bring a cam and your best hair do..and click a whole lot of selfie!",
  "tripadvisor_monas_597": "Well you must not miss this plac if you are in Jakarta for a short trip especially, and if you can't travel around the country much. The place is a display of every little piece of Indonesia, there are various places and museums that you can try visit and see, the place is also pretty huge so you can spend...More  ",
  "tripadvisor_monas_598": "Wonderful overview of the difference in buildings and culture in Indonesia.Nice place to walk around and see the Indonesian style of life on the different isles.",
  "tripadvisor_monas_599": "To see all the different parts of indonesia in one miniature park was very impressive. One can get a fast overview of the different cultural influences in indonesia.",
  "tripadvisor_monas_600": "When time is short to see all culturally on offer Tamran mini offers a very good insight of Indonesian life past and present.",
  "tripadvisor_monas_601": "It is very spacious, so the best thing is to rent a bycicle to see it all. Most of the places are quite basic, but quite well done. It does not take too long to see, but it is a great place to bring kids",
  "tripadvisor_monas_602": "If you visit Indonesia for the first time and having not enough time around, Taman Mini Indonesia Indah would be the right place to see as it gives you an introduction of what you can see in each provinces of Indonesia.Although the introduction is very brief, but you can catch the glimpse of attractions that will make you to...More  ",
  "tripadvisor_monas_603": "Here you can see fire eaters, dancing boys and exotic gardens and architecture.You can swim, travel by cable car, go boating, enjoy various children's rides, watch a film and listen to music shows.The best day to visit is Sunday.A cross section of Jakarta visits this place - happy families, tubercular old men, girls in exotic costumes...My...More  ",
  "tripadvisor_monas_604": "On a business trip to Jakarta we opted for a tour of Miniature park one day.It is largely a place for family with young kids with models of Indonesian places as all the Indonesian islands are reproduced. You can also see traditional architectures and houses that native people make in various provinces of Indonesia.In all the park I...More  ",
  "tripadvisor_monas_605": "My Husband and I thoroughly enjoyed our time there we went on the cable car and the buildings and different areas of Indonesia was very interesting.",
  "tripadvisor_monas_606": "My Husband and I thoroughly enjoyed our time there we went on the cable car and the buildings and different areas of Indonesia was very interesting.",
  "tripadvisor_monas_607": "The park is 1 hour drive from the downtown Jakarta.The park area is huge, but there is nothing to do there...A lot of motorcycles and cars in this park... which makes it difficult to walk in there...Everything is quite dirty and poor maintenance...We stayed there for an hour and then decided to leave...The only one...More  ",
  "tripadvisor_monas_608": "i like taman mini Indonesia, in taman mini there are manykinds food, traditional dance and costum from every province in indonesia.",
  "tripadvisor_monas_609": "We visited Taman Mini Indonesia Indah mid week. The museum was good to see the various wedding gowns of different regions and other traditions, although you probably don't need a guide as the signage is in English and Bahasa. Spend some time wandering around the streets to view the typical housing (life size) of various regions. Many of these need...More  ",
  "tripadvisor_monas_610": "Although it took an hour drive from Jakarta going to this Taman Mini Park, it is worthwhile a trip. The park showcases the various replica houses of Indonesian provinces. Try to take a cable ride to view the whole park below. Don't miss this attraction while in Jakarta.",
  "tripadvisor_monas_611": "Indonesia is known in its diversity of culture from thousands of islands and a lot of different tribes. The TMII very well represent these diversity. Visiting is also amusing, since different culinar are also represented.",
  "tripadvisor_monas_612": "Not a lot going on here, quite run down, maintenance is an issue. Water park busy with locals. The Imax is good, catch the show on Indonesia (although it is not in English only Bahasa Indonesia) still worth it.",
  "tripadvisor_monas_613": "Trust me, this is not a miniature park as its name says. It's absolutely huge! They have lifesize buildings/houses of the different provincial ethnic groups, showing their diversity in culture. Besides that, they have museums for almost everything - from Indonesia museum, Museum of transportation, museum of telecommunications, etc. to Komodo park, bird park, Istana Kanak-kanak (children's palace). Basically this...More  ",
  "tripadvisor_monas_614": "It's incredible to me on that day visit to indonesian,ifact there cultural dance seem to be in me as if I'm in heaven? their girls are friendly to foregin peoples like me. I have a good lunch to that suite me likewise in my country health and I enjoyed there train very well.",
  "tripadvisor_monas_615": "As soon as you reach, first, take a map of the place.then, take the toy train to reach out a couple of destinations. once you have a hang of what the place is like, either call for your car inside (is what we did), or decide to walk to select locations.do not get over optimistic, it is impossible...More  ",
  "tripadvisor_monas_616": "An insight to the diversity of indonesian architecture and cultures,there is so much to see and you can relax by the lake,take a picnic lunch....really enjoyed this venue",
  "tripadvisor_monas_617": "An insight to the diversity of indonesian architecture and cultures,there is so much to see and you can relax by the lake,take a picnic lunch....really enjoyed this venue",
  "tripadvisor_monas_618": "get the cable car, lorry tram, motor taxi, or monorail to explore the park. enjoy lunch at CFC fast food which is delicious and 'hot'. purchase souvenir at the shop next to the CFC.",
  "tripadvisor_monas_619": "Limited time? This I a great way to see all of Indonesia in a matter of 5 to 6 hours. We rented the electric scooters and that was fun too. You need some way to tour the facility as it is huge. Other option is to rent a taxi and have that take u around. Great picture spots. Loved the...More  ",
  "tripadvisor_monas_620": "I sincerely think TMII is overrated. Or probably since I was expecting a lot, my hopes were crushed somehow. It was fun, some temples (the same that I saw at Bali) were interesting. However the museum I saw (Indonesia museum) was too small and sincerely boring. The only thing fun we find there was the cable car. It was fun...More  ",
  "tripadvisor_monas_621": "Yuppp...Thats Right...TMII or Taman Mini Indonesia Indah or Mini Indonesian Park...is abundant of Indonesian Culture and Traditional Tribe all in one place...although some of the places or in this case a region place is not very well maintain but its a nice place to know Indonesia rather to go to individual places.For our holiday or leisure time, many...More  ",
  "tripadvisor_monas_622": "You can see the whole indonesian culture in miniature here such as the traditional home, traditional dresses, and so on. In here you can also see the miniature landscape of this country. You can see the whole area from the top by gondola. You will never feel bored visiting this place is full of cultural diversity..",
  "tripadvisor_monas_623": "Don't left this place in Cibubur, around 1 hr from Jakarta if a little traffic on the way. U must go here, awesome.The Keong Emas theatre is a very special place to see.Welcome & Visit Indonesia to Taman Mini Indonesia Indah.",
  "tripadvisor_monas_624": "It's tragic really. After visiting Taman, you can imagine how incredible the park could be if it was executed properly. But, it's not. Also, I got the feeling it's really geared more to Indonesians than foreigners which I think is a shame. It was exciting to see the traditional structures in real life however they are in bad shape. Also,...More  ",
  "tripadvisor_monas_625": "This place is huge, you can't explore the whole of it in one day. But don't worry, not every part is quite worth a visit though. My favorite is the one with the traditional pavilions!Pros :- An excellent introduction to the country.- Very cheap entrance fee! I can't remember how much exactly, but I think it was...More  ",
  "tripadvisor_monas_626": "No time for exploring Indonesia? no worry... just come to Taman Mini (miniature park) which located in East Jakarta.. 33 province with their traditional house, culture, dance and music performance, traditional clothes and any other stuffs... since it's very big place, just ensure you use car to go around otherwise you need to go around by walk or sky train...More  ",
  "tripadvisor_monas_627": "This place was good. It gives visitors an idea about the different styles of houses throughout Indonesia.",
  "tripadvisor_monas_628": "This place was good. It gives visitors an idea about the different styles of houses throughout Indonesia.",
  "tripadvisor_monas_629": "this is the perfect place to see Indonesia in one day, from Aceh to Papua, there're also some museum, my fave are science and komodo museum. enrich knowledge, and fun. remember my mom always take me and my sister here beside bookstore when we were kids.",
  "tripadvisor_monas_630": "This is the place where you can explore Indonesia in 1 day. You can visit each province here, from Aceh until Papua, until the newest province in Indonesia such as Banten, Maluku Utara, etc. Even some other provinces are still being rebuilt, we can also ask how the culture and everything we want to know in one or more provinces.Don't...More  ",
  "tripadvisor_monas_631": "It's a very good place to learn and know about Indonesian culture, traditional houses, archipelago, museums of fish, orchids, and many more. My foreign guests always enjoy their visit to Taman Mini Indonesia Indah. My advice is better NOT to visit this on weekend as there are so many people and too crowded, can't enjoy the sites well.",
  "tripadvisor_monas_632": "By visiting Taman Mini, you'll get a glimpse of all provinces of Indonesia within half day. It has other attraction too like the fresh water aquarium, the bird park and the butterfly park. I always bring my foreign guesses to Taman Mini where they could enjoy the miniature houses from all over Indonesia",
  "tripadvisor_monas_633": "Taman Mini Indonesia Indah is a good place to visit for those who would like to cover places in Indonesia in a day . Here , you could notice and observe many different houses from many provinces in Indonesia that come with their own unique and distinctive features . This will give you a glimpse of the richness and the...More  ",
  "tripadvisor_monas_634": "This is the right place where you can see islands of Indonesia by using cable car. You can also visit traditional house in TMII.",
  "tripadvisor_monas_635": "If you do not have much time to go all around Indonesia, this is the place where you can explore Indonesia in 1 day ... you can see the difference from 33 province in terms of house, clothes and the most important thing : culture .... not only the 33 difference provinces but you also can enjoy the cable ride...More  ",
  "tripadvisor_monas_636": "This is the right place to know about Indonesian culture and architecture in short time. The location is great, not very far from center of Jakarta. With a lot of museums this park is one stop for all to know about Indonesia. I like to take friends who want to know about Indonesian culture to this park. Some of the...More  ",
  "tripadvisor_monas_637": "Good place to learn/see the culture and tradition of Indonesia and some amusement rides for children.Very crowded over the weekend as its a getaway venue for the locals.Best way getting there is by taxi (bluebird) for safety and to avoid hassle,traffic jam.",
  "tripadvisor_monas_638": "the area of this park is very huge, and i think you will need 1 day to complete to visit all area in this place.you can find the mini of indonesia, of each province in all...read more ",
  "tripadvisor_monas_639": "the area of this park is very huge, and i think you will need 1 day to complete to visit all area in this place.you can find the mini of indonesia, of each province in all sector indonesia, from aceh culture until papua culture, you can find their ethnic building of each province of indonesia.not only culture bulding,...More  ",
  "tripadvisor_monas_640": "Suitable for tourists who r interested in cultural experiences, esp. in architectural. It's comprised of dozens of area which represent each province's culture. Also, it's a great spot for photo shoot.Better visit on weekdays. Always packed on weekend",
  "tripadvisor_monas_641": "If you are a tourist don't expect much and I would not recommend it as its old,far and most of the time the traffic to go there is Terible",
  "tripadvisor_monas_642": "If you are a budget traveler or don't have much time to tour around Indonesia, the 4th largest country in the world, then Taman Mini is a place for you. Here you might see and learn traditional architectures, cultures, and way of lives of people from different part of Indonesia. If you're lucky, sometimes there is traditional performance in one...More  ",
  "tripadvisor_monas_643": "very big park at about 20 minutes from South Jakarta. Great place to spend time with your family. I have been there many times. After spending few hours playing in Snow Bay I like to go around and looking at all these magnificent traditionnal Indonesian houses with amazing and colourful architecture.",
  "tripadvisor_monas_644": "Good place to go to start understanding variety of culture in Indonesia. All traditional houses are there. Not very well maintained, but it could be worse. Birdpark also in the area and waterpark as well. You could rent and bycycling around the compound too. New attraction include chinese house. Not all atraction included in the entrance fee. But you could...More  ",
  "tripadvisor_monas_645": "I've gone to this park once, it was okay. I mean, as a local, I've always known what a traditional house was like, but it's refreshing to see houses from other ethnic groups, this allows me to learn without going to another city (I am currently studying, unemployed, so my budget is limited). It's nice, and the people are very...More  ",
  "tripadvisor_monas_646": "Indonesia in Miniature Park is represtative place to know about Indonesia which consists of islands. Each island has its own culture. Indonesia is an amazing countries which having diversity of cultures. By visiting this miniature place, at least you know a big picture of Indonesia.",
  "tripadvisor_monas_647": "Highlights:1. Komodo dragon (don't be scared to take a picture with the big fella)2. Cable car ride (should be done at the beginning, so you can see the entire area and decide what you want to cover)3. Tandem bikes/ rickshaws etc. super fun with kidsBeware of:Dehydration!!Going round and round without actually seeing anything!Don't...More  ",
  "tripadvisor_monas_648": "For foreign visitors or non local, it worth a visit ☺Traditional houses and culture of Indonesia from west to east all in one place",
  "tripadvisor_monas_649": "Best for people with limited time...they show various architectures & brief culture of each differing areas in Indonesia.For 1st time visitor's, it a good starting point since...read more ",
  "tripadvisor_monas_650": "Best for people with limited time...they show various architectures & brief culture of each differing areas in Indonesia.For 1st time visitor's, it a good starting point since it'll allow them to have some ideas which area is of interest.",
  "tripadvisor_monas_651": "Taman Mini is a great place to learn about Indonesia, which each province has its own culture and language. In Taman Mini (TMII) you can find all of Indonesian traditional houses, museums, and some attractions. you can also see performance like traditional dances, wayang (puppet show), or culinary festival depends on the schedule (you may check the schedule in www.tamanmini.com)....More  ",
  "tripadvisor_monas_652": "It take very little time to visit and learn some history of Indonesia. Nothing to dislike but the visit take a few minutes to half an hour.",
  "tripadvisor_monas_653": "We're probably among a few visitors who visit this park almost every year.After suceeding trying the air balloon, the new attraction in the park last year, this year we returned with the new mission. Browsing the park from the vehicle. Not by car but by skylift, mini train and definitely a monorail on the same day. It was a...More  ",
  "tripadvisor_monas_654": "a little jam journey from central Jakarta but its very interesting place to visit and experience all the different style of architecture displayed at once in the park!",
  "tripadvisor_monas_655": "The ropeway travel is excellent. You can enjoy the visit there and will get know the culture of Indonesia.",
  "tripadvisor_monas_656": "Having problem to explore Indonesia? simply visit this place and you will get lot of information about Indonesia. a have to visit place.",
  "tripadvisor_monas_657": "There are many miniature houses from different park of Indonesia in this park and each house we spent about 5-15 minutes. there are many other entertainment and museum located in this park too. Overall may required for more than a day for those who wish to visit in detail for the whole park. You can find some local food stall...More  ",
  "tripadvisor_monas_658": "the tour of miniature Park was good, lots to see and do, some down sides the park is not maintained well, lifts out of order, and lots of steep steps, reptile park was a little sad, a lot of the in closures were not well maintained, can see where people threw rubbish into where the turtles swam, a lot of...More  ",
  "tripadvisor_monas_659": "Visit this park last week. Took blue bird taxi in the morning from CBD area, there was not traffic jam and the ride was about 45 mins.The park is big in land area and has a portioned themed houses or buildings hence the name Mini Indonesia.We didn't know the landscape was so vast and alighted from our taxi...More  ",
  "tripadvisor_monas_660": "Very good for some knowledge about the several islands. We did it at the end of our holiday and could 'prepare' for the next in indonesia. There is a lot to see in this...read more ",
  "tripadvisor_monas_661": "Indonesia have so many differents island in 1 beatiful asian country, with their all kind of differences, such the famous traditional foods - clothes - dances - houses - languages, and so many interesting more. But what makes Indonesia is so great tourism places, some of the them like for an example, they could communicate with 1 common language named...More  ",
  "tripadvisor_monas_662": "Is the place to learn about Indonesia, especially when you don't have time to visit all Indonesia with more than 13,000 island, so will find here the miniature of Indonesia, the whole 33 pavilion representing all provinces in Indonesia. You will find all culture from each province.The middle of the park there is a lake with a miniature archipelago...More  ",
  "tripadvisor_monas_663": "Very good for some knowledge about the several islands. We did it at the end of our holiday and could 'prepare' for the next in indonesia. There is a lot to see in this park!Houses are 'small museums', but for people who are interested to see some musea, there are quite a few!Park is clean.Best way to...More  ",
  "tripadvisor_monas_664": "A completely strange but must see part of traditional Indonesia houses at 1:1 scale. It is worth visiting, but avoid the middle of the day because it is really hot in the park. The reptile zoo is quite sad, but the collection of model housing types, arrayed as a park around a model island of Indonesia in the lake, is...More  ",
  "tripadvisor_monas_665": "Excellent display of the diversity of Indonesia. Could see the different architechure of the different regions of Indonesia. Many museums, too many to see in one day. Also the man made lake as a map of the main Islands of Indonesia can be seen from the cable car.",
  "tripadvisor_monas_666": "Taman Mini, as the locals call it, is such a blast! We got to see some lovely buildings and museums, LOTS of food vendors, There are always many, many people here, so expect to get a LOT of greetings and Halo's. There is also a wonderful zoo with indigenous creature to Indonesia. I even had my photo taken with a...More  ",
  "tripadvisor_monas_667": "Pleasantly suprised with the facility. Getting there is easy by taxi. Entrance fee $2 and return trip on the Sky Lift from one end of the park to the other is $5 where you can see the whole park from the air. The park is very big and there are maybe 20 or so small compounds depicting the house and...More  ",
  "tripadvisor_monas_668": "If you're not an Indonesian and love culture-history, this is a must-visit in Jakarta. Popularly known by local people as TMII: you won't be able to walk the whole park in one full day since it is very huge in area. Besides 33 custom houses from each district of Indonesia, there are several museums such as techno, birds, electric, etc....More  ",
  "tripadvisor_monas_669": "and pay attention especially on each province cultural events that must be arranged in such a way that attracts people to come and love the country more...",
  "tripadvisor_monas_670": "It 's surprise to find the complete entertainments in one park. a lot of museums, attractions, shows, even only for sight seeing. my kids were very excited to go there, and keep asking to go there again. one day will not enough. Just visit few attractions in 5 hours, ride the sky lift, dunia serangga (bugs world) and Dunia Air...More  ",
  "tripadvisor_monas_671": "Sunday morning come before 7 am, get half price... For BRI card holder there is a discount for snowbayThis a great place to learn indonesia culture.",
  "tripadvisor_monas_672": "Sunday morning come before 7 am, get half price... For BRI card holder there is a discount for snowbayThis a great place to learn indonesia culture.",
  "tripadvisor_monas_673": "4 times are not enough to explore this area.My child, 3 years old, always excited when I ask him if he want to visit TMII.Our last visit were Istana Anak-anak and Museum Iptek, unfortunately Museum Iptek is much more interesting and maintaned for children.Taman Burung and Aquarium Air Tawar also give more experiences to children about animals.",
  "tripadvisor_monas_674": "Great park with history, traditional buildings and animals. I like talking parrots. It's located a little far from the centre. But very nice for a day trip!",
  "tripadvisor_monas_675": "I like to see architecture in Taman Mini. You got to see many things in one place. If you enjoy the heat, you would love to walk around there but for me I rented a minivan from downtown and stopped at only some place I really like. Despite of the hot weather, the trip takes half a day and it...More  ",
  "tripadvisor_monas_676": "TMII is one of the biggest park in Indonesia. This park is a great way to get to know Indonesia's culture. You will be presented the Indonesia's islands from Sumatera to Irian Jaya, traditional buildings, traditional dancing, etc.The entrance fee for the park is IDR 9,000 per person (without car). Whenever you want to ride sky-lift, mono-rail and train...More  ",
  "tripadvisor_monas_677": "If you want to have a quick and superficial look at indoenisa's culture in various region, this is a place to go. Big complex and cheap ticket. Problem is too far from downtown jakarta, which at least means after a whole day explore there, you almost must face traffic jam when you back to city. Generally, it's worth to visit.",
  "tripadvisor_monas_678": "We had a two day seminar and not just the speakers but the place was a good introduction for us since we just moved there. Indo is too big to visit all of the interesting places, here you could get a feel for it and sure got my interests visiting many of the places we were briefly introduced. We would...More  ",
  "tripadvisor_monas_679": "I had wanted to go here since I was in school, and wasn't disappointed.It's great to look at all the different architecture, and sometimes they have traditional displays and dances. There are lots of different museums and zoos within TMII that have small entrance fees. The cable car is well worth it - Indonesia's answer to Dubai's world map...More  ",
  "tripadvisor_monas_680": "It has everything you need to get to know/introduce Indonesia.Has many many good museums (try museum Indonesia at first), parks (bird park, butterfly park, etc), amusement (keong mas, rumah boneka, etc) and most importantly: miniature of Indonesia's traditional houses that you can enter.You also may want to check some event held here as you may get chance to...More  ",
  "tripadvisor_monas_681": "This is definitely not a \"mini\" park, but HUGE park. You may need 3 or 4 days to complete the entire park to visit.Very heavy traffic if you go to the park on weekends. Best if you can get a taxi for one whole day so that the driver can drive you to all the places you want to...More  ",
  "tripadvisor_monas_682": "I was really missed the chance to explore the whole area due to time constraint. As I can see it, TMII was a huge area and one needed whole day to experience the great park, at...read more ",
  "tripadvisor_monas_683": "I was really missed the chance to explore the whole area due to time constraint. As I can see it, TMII was a huge area and one needed whole day to experience the great park, at least. You doesn't need to travel to the whole Indonesia and by coming here you can get the glimpse of the whole Indonesia.Will be...More  ",
  "tripadvisor_monas_684": "If all you have is one day, or two days, or a very short trip and you're not sure if you're going to be returning to Indonesia in the near future, then you must visit the Taman Mini Indonesia. It is a park that features traditional houses depicting the designs and styles of the different islands and regions of Indonesia,...More  ",
  "tripadvisor_monas_685": "TMII is in fact a huge area where you could view all different houses from different provinces. To walk to all the mini houses will takes you forever but in order to viewed all the houses without long distances you could travel by car and TMII has provided cable car which you need to pay an extra of IDR 25,000...More  ",
  "tripadvisor_monas_686": "By visiting this park the visitor to Jakarta get a good oppertunity to learn about the culture,buildings and dresses from different islands of Indonasia . It is really nice. Either you can walk or take a cable car to see from above. Our tour guide took us to a hotel inside the park and the food was expensive and useless.Except...More  ",
  "tripadvisor_monas_687": "I had to spend few days in Jakarta and Indonesia in Miniature is a good option to learn more about the cultural diversity of the country. I went by taxi, some 50,000 Rps from Sarinah, and focussed on the pavilions, the first ones are the most interesting as they seem to be better mantained. The area number T on Bali...More  ",
  "tripadvisor_monas_688": "It's a good place to learn about Indonesia & its cultures. But the area is don't really amusing, at least for Indonesian people.",
  "tripadvisor_monas_689": "this park was quite large, and, I only saw some of the areas. There were lots of toilet facilities, handy!! Bring your own toilet paper, though!! I was quite impressed with the vastness of this park...I rode the cable car to see it from \"above\", too!! There was area's which seemed to cater to children, too.(I was on a...More  ",
  "tripadvisor_monas_690": "Its a nice place must visit during holiday in Jakarta. A lot of attraction to go there, it was fun and you will enjoy. There are can explore all traditional houses and culture from all indonesian province. However, its usually crowded during weekend or public holiday.",
  "tripadvisor_monas_691": "great place to see all of indonesia in one park. this place is huge so i would advice you to plan the whole day there. sometimes it can get a bit hot so bring water.",
  "tripadvisor_monas_692": "Its a fun place to go with your children. They'll love it. its very large place with a lot of attraction and museum to go there. for example, swimming pool, flower garden, fresh water aquarium, birds park, stamp museum, comodo museum, keong mas theater, fishing pool, traditional houses from all of Indonesian province, etc. Trust me, one day won't be...More  ",
  "tripadvisor_monas_693": "This is a place to see Indonesian Culture, their building pattern in different area & peoples life style in one place. Its quite big & difficult to complete in one day. Besides...read more ",
  "tripadvisor_monas_694": "Being an Indonesian with a high nationalist sense, I really like to write a wonderful review about this place. But sadly, lip-service will do no one any good. As a concept, this place is really good. Visitors can get a glimpse of feeling about all things Indonesian. The culture, the heritage, the archipelago, and even some of its wildlife. But...More  ",
  "tripadvisor_monas_695": "i loved it as it gave me an insight about the country. my own country, india has this diversity. i loved the costume displays, the architechture styles, and ways of daily living. we have this kind of dioramas in gauhati museum in assam , india",
  "tripadvisor_monas_696": "It's quite a journey to get there , but it is worth it. The entrance fee is 9000 Rp per person. I found this place very interested because I just stopped in Jakarta and Bali, so It gave me a chance to see the traditional houses from other area in Indonesia . In each of them , there is furniture,...More  ",
  "tripadvisor_monas_697": "\"The Wonderfull Place Of Indonesia\"It`s very strategic place. A lot of museum, art of indonesia, cultureristic of Indonesia are available in here. This place also gave me an educational things, such as ehtnic of Indonesian`s people (sundaness, betawinesse, javanesse, and etc). My last visit to TMII, i have showed Indonesian`s culture to my friend. My friend come from France....More  ",
  "tripadvisor_monas_698": "there is a collection of Indonesian houses from all provinces, if u visit Indonesian u can try to visiting Taman Mini Indoneisa Indah for know indonesian.Taman Mini Indah Indonesian is large and you will need at least 4 hours to see most of it. Food is almost totally local. The entrance fee and entrance fees for museums etc are...More  ",
  "tripadvisor_monas_699": "This is a place to see Indonesian Culture, their building pattern in different area & peoples life style in one place. Its quite big & difficult to complete in one day. Besides their birds park & cinema theater is also quite good, Good place for kids to enjoy their time. You can have a cycle rental to visit the place",
  "tripadvisor_monas_700": "Taman Mini Indonesia is not in the city centre but taxis are cheap and we found Blue Bird totally reliable. On display are houses from all parts of the country as well as museums, cable cars, a little train and even buses. There is also a water park. If you have your own transport, you can take it in.The park...More  ",
  "tripadvisor_monas_701": "Good glimpse of culture and architecture, but could have been much much better if better maintained etc.",
  "tripadvisor_monas_702": "In this attraction, there is a collection of Indonesian houses from all provinces. It's like going around the country itself. Also, there are mini museums, a cable car and a diorama of Indonesia. The part that I most enjoyed are the places of worship: there's a mosque, churches and temples. However, knowledge of Bahasa Indonesia is vital since there would...More  ",
  "tripadvisor_monas_703": "The place is huge for nothing. People starting to forget it, not much to see, not much to do. It takes 1 day trip to spend there where you can go somewhere else. Not coming back.",
  "tripadvisor_monas_704": "Taman Mini Indonesia Indah (TMII) at Jakarta city is a one stop center for those who like to know about Indonesian and related cultures and subcultures. It is a brilliant showcase...read more ",
  "tripadvisor_monas_705": "Taman Mini Indonesia Indah (TMII) at Jakarta city is a one stop center for those who like to know about Indonesian and related cultures and subcultures. It is a brilliant showcase which reflects a complete diversity of the country. On top of that, TMII which is a big area offers various tourist attraction which includes bird park, science centers, cable...More  ",
  "tripadvisor_monas_706": "If you are interested in Indonesian tradition and architectures, this place is just right for you. However, you have to go through those heavy traffic to get here.",
  "tripadvisor_monas_707": "Taman Mini Indonesia is one of the coolest parks to go to in Jakarta by far. You can explore the different types of Indonesian food, historical culture, traditional ceremonies, native people, museums, botanical gardens, and more. Its a huge park with so much to do but you can't do it all in one day. It is best to take your...More  ",
  "tripadvisor_monas_708": "if you want to know more about indonesia. u can visit here. see the building the culture and the dance. and the type of costume",
  "tripadvisor_monas_709": "I thing that it is interesting place for people who are interested in different cultures and architectures, because it is not posible to see all from Indonesia,but this attraction is the place where you can see it. It is very huge park and 1 day is not enough to see all of it.",
  "tripadvisor_monas_710": "coz i like country culture and its subculture, its traditional house, traditional ceremony, natural etc.",
  "tripadvisor_monas_711": "Don't go there when it is raining. It is a great park. You will learn history, cultures and buildings, but the rain ruined my visit!",
  "tripadvisor_monas_712": "It is a great place to know the diversity of Indonesia culture. There you can see traditional houses of each province in Indonesia. Inside the houses there are unique museums. Lots of intersting places for families but mind the weather, if its hot you might prepare yourself with hats and sunglasses.",
  "tripadvisor_monas_713": "Very very poorly maintained. Could be a brilliant showcase for all of Indonesia.Give it to Disney to manage and you'll put Indonesia on the map!",
  "tripadvisor_monas_714": "My wife and I went to the TMII on the very first day of travel. There are other touris that were visting this area. You have to pay the enterance fees to enter this park. After that, for any other rides( bus/train) you have to pay. One the places we went is the insects world. To my astonisment there were...More  ",
  "tripadvisor_monas_715": "If you don't have much time to travel around Indonesia, this place is the answer. Taman Mini Indonesia Indah or TMII for its famous name, is a place where you can see miniatures...read more ",
  "tripadvisor_monas_716": "If you don't have much time to travel around Indonesia, this place is the answer. Taman Mini Indonesia Indah or TMII for its famous name, is a place where you can see miniatures of houses, clothes, and any other historical stuff. It also has a science center, bird park, cable car, and many other lovely places. Bring your family here!",
  "tripadvisor_monas_717": "You will have to spend the whole day and you will get a glimpse of miniature Indonesia. Take the cable car and get an aereal view. Go to the various sections and know about the craft and culture of Indonesia's various provinces.",
  "tripadvisor_monas_718": "I love the varieties of animals and the fact that they walk around the park as if asking to be fed. The animals are friendly and there are zoo keepers(?) who walks around to make sure that the animals and visitors are safe. Before reaching the park, make sure to get carrots from the street vendors.There are photo opportunities...More  ",
  "tripadvisor_monas_719": "This place in East Jakarta is known for its beautiful Miniature of Indonesian culture. All aspects of daily life in Indonesian provinces are depicted in separate pavilions. You will find here a good collection of Indonesian architecture, clothing, dances and traditions. There is a lake with a miniature of the archipelago in the middle of it.You will also find...More  ",
  "tripadvisor_monas_720": "This place has really made me wanna travel around the country and discover all these beautiful places in their natural environment.Been there twice and already considering a 3rd visit. Very comprehensive and really worth the visit!At the end of the visit it's nice to go for a dive at the attached water park.The entry fee is near...More  ",
  "tripadvisor_monas_721": "It was about an hour from the CBD (w/o out traffic). The park itself was huge with the different provinces/cultures of Indonesia all represented. You can spend the whole day there just going around and still not finish everything. We were there for about half a day and only saw maybe half of the sights. Wear comfortable clothes/walking shoes and...More  ",
  "tripadvisor_monas_722": "It is mainly a big park that has buildings distinctive of different regions in Indonesia. There are several museums within the park which required separate entrance fees which I gave a miss. I covered the entire park on foot but there were options for a cable car, a mini train and a monorail to get around the place.If you...More  ",
  "tripadvisor_monas_723": "Built with the inspiration of our first lady Tien Suharto, this park is so stunning. It resemblance Indonesia in miniature, so in just one day tour tourist can have a clear view of Indonesian culture. The facilities are so complete and well managed. There's also an At Tin big and beautiful mosque , also Museum Purna Bhakti Pertiwi that you...More  ",
  "tripadvisor_monas_724": "Taman Mini is pretty cool because it contains the different cultures of Indonesia in one place. But overall, it just felt like a tourist trap. It's a one-time experience.",
  "tripadvisor_monas_725": "This park represents the different cultures of the provinces in Indonesia. It is so huge that you can tour it by car, by bicycle, by monorail or by cable car. Most of the attractions are about the different houses and costumes worn by Indonesians. What's best for me is looking at the miniature Indonesian Archipelago at the lake.There are...More  ",
  "tripadvisor_monas_726": "Dari jaman kecil pernah ke sini beberapa kali..Truly Indonesia in miniature...with traditional houses of every province in Indonesia..so before you go to many beautiful places...read more ",
  "tripadvisor_monas_727": "Dari jaman kecil pernah ke sini beberapa kali..Truly Indonesia in miniature...with traditional houses of every province in Indonesia..so before you go to many beautiful places in Indonesia...come and visit Taman Mini..With 10.000 Rupiah for an entry ticket, you can spend so much time here and take many beautiful photos...Enjoooy",
  "tripadvisor_monas_728": "I booked this through the hotel as an afternoon guided tour. Traffic, as always in Jakarta, atrocious, thus just to get there and back swallowed several hours. The place is huge and includes good museum on history, culture and arts and crafts of Indonesia and typical houses from various islands. I've learned interesting cultural details from my lady guide; they...More  ",
  "tripadvisor_monas_729": "It gives a broader view in matching what we would like to see first when we're about to travel around Indonesia. Suggestion: I need to get the itinerary first then would go for which province miniature that I would like to visit.5 years ago, I spend the weekend to visit every spot of it.",
  "tripadvisor_monas_730": "So... if you tell me that you don't have the time or money or both to explore the whole Indonesia, complaint no more! Come to TMII. I mean, seriously, you should come to this place.I came in the morning and went off quite later in the afternoon because this place was huge and amazing. There were so much things...More  ",
  "tripadvisor_monas_731": "Indonesia is very rich in cultures and beautiful panoramic views, this mini park is a representative of all that we have. If you only have 1 day but you want to cover all Indonesia, go to TMII.",
  "tripadvisor_monas_732": "Wanna see Indonesia? Try come here, besides miniatur of Indonesia its also has bird park, which i love most. i like round TMII by train, i love the view from upstairs. and don't missed the show at theater Emax",
  "tripadvisor_monas_733": "There are too many food hawkers around...The visitors and government should have taken good care of the cleanliness.The park represents Indonesia, therefore we must work together to be responsible for its future existence",
  "tripadvisor_monas_734": "You can come to all provinces in Indonesia, but it will take loooong time and spend much money. Make it faster and easier...Come to TMII...At TMII, you can see all (almost) traditional culture, house, clothes, handicraft, and any ethnic. Also you can see many museums. You need more than 1 day trip if you want to know more.Don't...More  ",
  "tripadvisor_monas_735": "The collection of houses from each Indonesian province alone is value for money and time as well as the the museums and the bird exhibits,there is something for everyone here, all the houses and sculptures and stuff like masks is great to understand more about this unique and incredible country.The park is huge and packs all the diverse cultures of...More  ",
  "tripadvisor_monas_736": "I went there last year in June with my local friends.This place is quite large and you can rent the bicycle for riding around (They've many type of bicycles for group with any styles.) I think this place is one of the place you must visit when you go to Indonesia.There're many activities to do for the visitors.One place but...More  ",
  "tripadvisor_monas_737": "Indonesia is a vast archipelago. To see all, you would need weeks if not months. So what would one do, if he/she only had one day to spare? Go to Taman Mini Indonesia Indah...read more ",
  "tripadvisor_monas_738": "It's a great place for international tourists and students to know more about places in Indonesia and the cultures. It's not a place for pleasure.",
  "tripadvisor_monas_739": "Indonesia is a vast archipelago. To see all, you would need weeks if not months. So what would one do, if he/she only had one day to spare? Go to Taman Mini Indonesia Indah (TMII)! You get the simpler and smaller version of Indonesia, complete with ethnic building for each province. In the weekend, there is some cultural activities on...More  ",
  "tripadvisor_monas_740": "i never visit to place , but if have a time in holiday i go it and i think that this place is tell history indonesia , this is my hobby if can go so many place to trying eating and take a picture with my friend",
  "tripadvisor_monas_741": "we liked the way is made, lot of history, neat and well spread accrossgood architechture, lot of activities however need atleast one day to visit the entire park",
  "tripadvisor_monas_742": "This is the fast way to explore Indonesia, we take a long tour and learn about so many places in Indonesia, I recommend to start your tour by mini bus to save your energy because this place is to big to explore in just one day.",
  "tripadvisor_monas_743": "Too crowded , however tourists like us can spend a day .We had seen miniature island of Indonesia like BaliFew models of buildings and temples were quite educative and good informative explanation boards were quite useful.",
  "tripadvisor_monas_744": "A lot of the pavilions were closed for renovation.The park itself was big, and walking around under the hot sun is really not recommended.Recommendation: Check whether the park is fully up and running prior to your visit. And make sure you drink plenty of water.They do have the \"buggy\" services around the park, although you have to...More  ",
  "tripadvisor_monas_745": "a place where a lot of things can be done to improve the visit. can see a lot of old indonesian culture here but i wish it was more planned to include more fun.",
  "tripadvisor_monas_746": "A great way to see the history and culture of Indonesia in the convenience of one place. We walked though a few museums, but didn't have the energy to see everything. Took a rickety monorail ride around the park (praying that its wouldn't fall down) and stopped at the bird park. Such a variety of things to see. Avoid the...More  ",
  "tripadvisor_monas_747": "Brilliant - you will need a day to do it (possible even more). We thoroughly enjoyed this and thought it was one of the highlights!",
  "tripadvisor_monas_748": "All of Indonesia in one place. A great way to appreciate the diversity of this large country. Start your visit with a tour of the large site by minibus for just 3000Rp each. Well...read more ",
  "tripadvisor_monas_749": "All of Indonesia in one place. A great way to appreciate the diversity of this large country. Start your visit with a tour of the large site by minibus for just 3000Rp each. Well worth it for the entertaining commentary by the driver. Muesum of Indonesia is worth a visit and provides respite from the heat too. You even get...More  ",
  "tripadvisor_monas_750": "Do you want to know Indonesia? Let's start from Taman Mini. It's located in East Jakarta. A park that will introduced you to so many culture of Indonesia.You can see the traditional house of each province. There's a lake too, that have a miniature island of Indonesia. So before you getting started to go to each province maybe it's best...More  ",
  "tripadvisor_monas_751": "If you want to see entire Indonesia, this is the place to be. Using the cable car, you will be up in air viewing major Indonesia islands scattered on a lake. Taman Mini also exhibits traditional houses and customary clothings from tribes all over the country. Bring lots of water if you plan to walk around.",
  "tripadvisor_monas_752": "Monas is Indonesia in a small park. Very amazing. Only some of the venue still empty and tend to be neglected. Lack of parking system. In the other hand maintenance of some broken equipment are less. And also need to be more concern of the sanitation.",
  "tripadvisor_monas_753": "Very good place to know Indonesia quickly. An extensive theme park set in over 100 hectares on the outskirts of Jakarta; the All Indonesian islands are realistically reproduced in miniature in a central lake and around the lakes, there are pavilions. Each pavilions is representative of each province firm the traditional architectural style in miniature to a wonderful display of...More  ",
  "tripadvisor_monas_754": "We went there on june, it was sooooo hot day. It was a huge place to walking around. If you with kids, make sure u bring the stroller along and bring plenty of drink. We enjoy there alot, but sad things to said, the street stall that selling ice cream there tried to make us pay 3 times more than...More  ",
  "tripadvisor_monas_755": "it's actually nice to go there if you don't have time to go all over indonesia. they have couple of sample from each provinces in indonesia ... the traditional house, clothing, sometimes dances ... the area is quite green ... i just cant stand with the heat",
  "tripadvisor_monas_756": "The idea of bringing traditional homes from all over one's country is great especially for tourists. It cuts the need to go to every part of the country to experience traditional architecture. This place is huge, and the best time to view it is when it is cooler than what it was in early January because the heat is exhausting...More  ",
  "tripadvisor_monas_757": "It is a beautiful park containing historical museum having past relics of cultures of different island of Indonesia mainly Java, Sumatra and Bali. The place has lots of rised for children and adults as well. I also enjoyed the ride on the cable car around the park.",
  "tripadvisor_monas_758": "If you are interested in Indonesia's culture this place might interest you. You can find shows of traditional dances here. But you have to check the schedulle first.",
  "tripadvisor_monas_759": "Good place to visit. All provinces of Indonesia represented here.Takes a minimum of 4 hours or more to see all the places. So you may have to skip some provinces. Avoid peak...read more ",
  "tripadvisor_monas_760": "a mini indonesia just as the name suggeststakes u to most of the major indonesian habited islands tour without getting wet or waiting for boats or planesgives u a feel of the culture and scenes of what indonesia is made ofa lot of improvements still needs to be made but it still is weekend family hangout and...More  ",
  "tripadvisor_monas_761": "Good place to visit. All provinces of Indonesia represented here.Takes a minimum of 4 hours or more to see all the places. So you may have to skip some provinces. Avoid peak period visit. Cable car and monorail is packed to the brink.",
  "tripadvisor_monas_762": "In one place you can get a quick glance of what Indonesia is all about, with all the diversity in culture, language etc. It's very interesting and educative.",
  "tripadvisor_monas_763": "check the hours before you go...many things closed early when we were there because of Ramadan. The \"rides\" looked a little old",
  "tripadvisor_monas_764": "If we have no much money for traveling round Indonesia because this country is so big then you may take alternative to go to miniature park at Jakarta. We can see many traditional houses in small size. To reach the place is so easy. Take any travel. Simple.",
  "tripadvisor_monas_765": "Allot one day for this park, as this is huge! I made the mistake of squeezing this park in our one day trip in Jakarta, arriving there by late afternoon. We hardly had any time to go around the place before darkness fell.Even so, we enjoyed the seeing the different house styles in Indonesia. It gave us a glimpse...More  ",
  "tripadvisor_monas_766": "it was a fun way to spend half a day, and find out more about indonesian architecture :)I would suggest, but not for children: truly is more of a museum type park than an entertainment one!",
  "tripadvisor_monas_767": "It is a good way to learn about the various facets of Indonesia. I loved the houses of various provinces there. There are interesting things like the electricity museum etc. The cable car provides a birds eye view of the entire place. Difficult to cover the place in a day, so pick and choose what you would like to see....More  ",
  "tripadvisor_monas_768": "It's a nice place to see Indonesia in one day (or two). A lot of traditional house and clothes. However it needs much improvement from the management. Some houses look very dead and dusty..",
  "tripadvisor_monas_769": "We spent a day there and enjoyed it. Do your homework before going and find the places you really want to see. Walking around in the heat is difficult but you can hop on the mini-bus going around if you know where you're going.We took the cable car but didn't feel very safe so got off half way around....More  ",
  "tripadvisor_monas_770": "It only cost 9,000 rupiahs to get in but there were additional charges for each pavillion. I really enjoyed the opportunity to go inside traditional homes from many areas of...read more ",
  "tripadvisor_monas_771": "It only cost 9,000 rupiahs to get in but there were additional charges for each pavillion. I really enjoyed the opportunity to go inside traditional homes from many areas of Indonesia and I learned a lot about the country. Rode the cable car--fun! Unfortunately for me I was there during Ramadan so many attractions and restaurants werre closed. The park...More  ",
  "tripadvisor_monas_772": "This is another must see place if you are doing tourism in Jakarta.Here you will be able to see many different type of house from different islands of Indonesia.It is kind of visit whole Indonesia culture and buildings in one unique place.",
  "tripadvisor_monas_773": "a place with very much complete miniature of indonesia>> good place to visit with children to learn how many variatif of indonesian culture",
  "tripadvisor_monas_774": "Because of a local election, my business trip was cut from 3 to 2 days. With the extra day, my customer took me to Taman Mini Indonesia. She had never been there either. Since the election day was a holiday, there wasn't so much traffic on the road so it took about 1 hour to drive there from central Jakarta....More  ",
  "tripadvisor_monas_775": "Everytime my friends come from abroad, I'll take them here. Indonesia consists of thousands of islands with different ethnicity and uniqueness, so Taman Mini Indonesia Indah will be a good introduction of Indonesia.Taman Mini Indonesia Indah provides a miniature of traditional houses all over Indonesia, with the collections of traditional costumes and furniture as well inside the houses. In...More  ",
  "tripadvisor_monas_776": "I heard about the place for long long time now and luckily invited to visit it by my relatives who is a permanent resident of the city that just 45 minutes away from here.What a great idea that our former first lady Madam Soeharto to take the initiative to build the complex summarizing the entire islands complete with its...More  ",
  "tripadvisor_monas_777": "TMII (Taman Mini Indonesia Indah) is the best introduction to what Indonesia has to offer in diversity and culture, especially for visitors who have little time to explore the Indonesian islands. During weekends and holidays, TMII is an ideal theme park for families to become more acquainted with other regional cultures.",
  "tripadvisor_monas_778": "Though some will say that this place is not \"organized\" enough, or even if some of the attractions are not \"world class\", the collection of houses from each Indonesian province alone is worth the time and money, for a self described \"Indonesian Freak\" like me it was an incredible experience, also the museums and the bird exhibits, will go back...More  ",
  "tripadvisor_monas_779": "We had been to taman mini national park in jan. the park is huge and packs all the diverse cultures of Indonesia within itself. If you are going to indonesia for the first time and are starting with jakarta, best place the get complete knowledge of the history, cultures, art, architecture.The cable car ride is awesome, because it takes...More  ",
  "tripadvisor_monas_780": "we spend half a day covering only small of this park, needs a few days,very good displays, however maintence of walkways is ordinary.well worth a look",
  "tripadvisor_monas_781": "It's a big park so you have to drive around with your car to visit one to another place. Some of the facility needs to be renovated.",
  "tripadvisor_monas_782": "It's a big park so you have to drive around with your car to visit one to another place. Some of the facility needs to be renovated.",
  "tripadvisor_monas_783": "I like the sky lift as I can see quickly what is there down on the ground and choose what we like to see more closely.Just a bit too much to do in one day",
  "tripadvisor_monas_784": "educative, large.... u can go to all place in indonesia just for 1 day only...",
  "tripadvisor_monas_785": "Spent more time in traffic than out in the park. Since each area is maintained by the region it represents, there was a wide variety of upkeep. Some were even closed and in disrepair. Would have been better without the crowds.",
  "tripadvisor_monas_786": "The park is huge. Like really huge. I'm not really sure if it's possible to visit every building and every attraction in just one day, especially if you're just on foot! We visited several museums and learned quite a lot about the history of Indonesia and the culture. We took the cable car and saw from above beautiful lakes and...More  ",
  "tripadvisor_monas_787": "The park itself has houses from all over Indonesia which you can drive past. There is an amusement park and fresh water aquarium too. I visited the Aviary and was amazed by the number of birds. I didnt even know half of them existed. The Aviary was the best bit for me.",
  "tripadvisor_monas_788": "We like visiting Taman Mini with the kids. They run around the wide open spaces between Indonesian houses from all over the islands. I would recommend going when Indonesian schools are in session so that you are not overly crowded at the park. It is true that during the \"down times\" the museums and reptile park and other separate buildings...More  ",
  "tripadvisor_monas_789": "You can get most of the way to this attraction by busway and then walk a short distance a good way to see the park is to take the cable car for rp 25,000 it's well worth the view and taman mini is a must see attraction in Indonesia it's not too far from Jakarta and is cheap to get...More  ",
  "tripadvisor_monas_790": "The bigest miniature of traditional culture in indonesia with a lot of entertainment in particular places, it has the bigest amazing imax theathre and birds park...family adventures,water park,souvenir shops, retaurants which you can visit....staying in unique hotel inside the are so you got million pleasure in a day.",
  "tripadvisor_monas_791": "Despite its name, this place is *huge*. There is everything here from the Imax theatre (recently introduced), to museums of all sorts. There is also a water amusement park (deceptively called Snow Bay), where you can indulge in all sorts of water sports. Gondola lifts, railroads, and plain car roads provide access and views to all attractions. We started with...More  ",
  "tripadvisor_monas_792": "Long time ago TMII until 2010, there is no new attractions. But since Snow Bay, and now until 4D, Balloon fly, it's all attractive!",
  "tripadvisor_monas_793": "It was the most beautiful and complete place to get to know Indonesia's culture and diverse traditions, but now TMII is not as beautiful as it had been. People litter everywhere, the buildings was not maintained and quite dirty",
  "tripadvisor_monas_794": "Long time ago TMII until 2010, there is no new attractions. But since Snow Bay, and now until 4D, Balloon fly, it's all attractive!",
  "tripadvisor_monas_795": "An unplanned visit with my friends after 3 days of shopping in Jakarta. It's a fun trip for me as I always prefer sightseeing to shopping and TMII provides a worthy experience.Initially we use car to go round the place (as it is so huge and the weather is too hot to walk around) but after a few stops,...More  ",
  "tripadvisor_monas_796": "This large park is a nice place to go to get a taste of the differences in architecture, customs, and clothing across the vast expanse that makes up the nation. The park is not super organized (operating hours, concessions, maintenance, centralized information office), and the amount of translated information is limited. But, by Indonesian standards it is well done. I...More  ",
  "tripadvisor_monas_797": "Taman Mini Indonesia , good place to see indonesia at one place",
  "tripadvisor_monas_798": "we got a small glimpse of Indonesia, but it is poorly maintained, very untidy and dirty. A pitty.",
  "tripadvisor_monas_799": "This place gives you a glimpse of the whole country in miniature. There can be many tourists on certain days but it is also popular with locals. Good spot for appreciating Indonesia, its people and culture - Bring an umbrella and water to drink.",
  "tripadvisor_monas_800": "Taman Mini is a bizarre product of the Suharto regime. It presents a simplistic, tidy version of Indonesia in line with General Suharto's 'Unity in Diversity' policy. It is very poorly maintained, contains many broken displays and people are allowed to drive vehicles through the park so it feels like a congested Jakarta street. There are some good museums, but...More  ",
  "tripadvisor_monas_801": "Actually TMII has a great potential to be developed..but there's no maintenance at all at TMII...too bad",
  "tripadvisor_monas_802": "On the one hand it is big. Really big. Many museums reflecting different cultures of Indonesia. Many are repetitive. There are kiddie rides, trains, more museums, plenty of places to see Indonesian culture. Not terribly well designed and erratic in quality. Nice ride over the lakes with the islands below shaped like Indonesia.",
  "tripadvisor_monas_803": "Despite being a little dated the park is still in good shape, and constitutes a good way to learn about the different cultures of Indonesia.It showcases pavillions for each of...read more ",
  "tripadvisor_monas_804": "Pleasant walking around a park with all of Indonesia's states represented.",
  "tripadvisor_monas_805": "Despite being a little dated the park is still in good shape, and constitutes a good way to learn about the different cultures of Indonesia.It showcases pavillions for each of the islands of the country with real size houses and display of tipical dresses and other cultural displaysthings, music, handcraft, etcYou must visit the Bali and Papua pavillions...More  ",
  "tripadvisor_monas_806": "A real mixed bag, worth a look but it isn't Disneyland!",
  "tripadvisor_monas_807": "I went with some friends for my birthday last year. This place is old and really cheesy, but it was GREAT fun, and there are tons of things to do. Everyone who goes to Jakarta should go here at least once, Indonesian and foreigner.",
  "tripadvisor_monas_808": "We arrived at ``Mini Indonesia'' on a Saturday, and it was very crowded. There was no one at the information booth. ``Mini Indonesia'' has a water park, some amusement rides, and an Imax Theater showing: ``Flying Monsters,'' ``T. Rex,'' and ``Forces of Nature.'' We heard rumors of a cultural show on Sundays. The park has churches, mosques and temples as...More  ",
  "tripadvisor_monas_809": "The park shows majority Indonesia heritage, houses and clothes. The park is big and you need to spend some time and walk around to see all the stuff. I do not have much interest on the heritage, thus I just took some shot and away. It's a good place anyway to see all the traditional houses from other part of...More  ",
  "tripadvisor_monas_810": "We decided to go to Taman Mini to have a walk with some relatives who had come to visit us.Taman Mini is much nicer in the early morning when there is not so much traffic. Unfortunately, the park is open to the traffic so walking there in the afternoon is quite annoying as you get hassled by all these...More  ",
  "tripadvisor_monas_811": "This is the most dirtiest family park I have ever been. Messed up and just too over crowded by hawkers. Stay away, people and the employee are nothing friendly but perhaps this was actually more Jakarta than Indonesia",
  "tripadvisor_monas_812": "Go visit this place if you're curious about Indonesian heritage but got not much time to wander around the country. You could see various of traditional houses, clothes, others from different part of Indonesia. There are museums all around the area, from animals to science museums, also theatres like Keong Mas 3D theatre, imax, and 4d. One cheap trip to...More  ",
  "tripadvisor_monas_813": "If you do not have time to explore this large and beautiful country, take time to visit the Taman Mini Indonesia Indah (TMII, Beautiful Indonesia Miniature Park) located in Jakarta South, which gives a good introduction to what this country has to offer in terms of diversity and culture.Set on about 250 acres of land, the park presents a...More  ",
  "tripadvisor_monas_814": "Great traditional houses for tourists and kids, especially the Minangkabau, Papua, Bali and Javanese houses.",
  "tripadvisor_monas_815": "almost all of indonesian traditional houses and dances canbe seen here",
  "tripadvisor_monas_816": "Great traditional houses for tourists and kids, especially the Minangkabau, Papua, Bali and Javanese houses.",
  "tripadvisor_monas_817": "This is a huge place with many things to offer. The quality of attractions are very mixed, some are very nice while others are terrible.Taman Mini mainly features traditional houses and culture from all provinces in Indonesia. Some houses are well maintained with fine displays of traditional clothes and instruments. Occasionally there are some cultural performance such as traditional...More  ",
  "tripadvisor_monas_818": "Well, it was worth it... sort of. I couldn't quite explain what I felt about the place. I guess I give them points for trying to come up with a great park (especially since one of the reviews called it the Disneyland of Indonesia!) . The entrance itself looked grand, but the insides looked neglected. As if it had once...More  ",
  "tripadvisor_monas_819": "A theme park in Jakarta, it has much to offer the visitor. The Skylift is a gondola which will take one on a ride across the landscape of the park allowing you to see the various attractions from the air.There is a very large water park where people can swim and use water slides and generally enjoy swimming in...More  ",
  "tripadvisor_monas_820": "You will see different kinds of houses of Indonesia.. that's it..",
  "tripadvisor_monas_821": "Must visit place for traveler, even little bit far from city centre :)",
  "tripadvisor_monas_822": "There are cable cars with 2 different stop. There are lots of houses from different province & race to learned. You can visit & enter each of them.",
  "tripadvisor_monas_823": "The park is quite nice and gives a good overview of Indonesia. However, I wasn't aware before of the fact that everything needs to be paid extra, so I was rather reluctant to see more things as it gets quite expensive. Also went with the skylift, which doesn't make sense at all: normally, you would expect that you can leave...More  ",
  "tripadvisor_monas_824": "Taman Mini Indonesia Indah is a summary of Indonesian culture, the place is nice well maintained.To tour around the place, a tour car are available at every station. it would take the guest around the park. it will stop at each of the Museum and \"Anjungan\" which host the traditional house of each province.other method to tour around...More  ",
  "tripadvisor_monas_825": "Taman Mini Indonesia Indah (Taman Mini for short) is located around 20km to the east of Jakarta city center. I always try to bring my business guests to this place if they have...read more ",
  "tripadvisor_monas_826": "It's a great idea--and looks like it was on its way to a miniature replica of all things Indonesian, but either this park has never had an operator who truly cared or it has been a long time: many things are broken and other things are under construction. Were this an American Park Service project, I would say it likely...More  ",
  "tripadvisor_monas_827": "A great place to study Indonesian culture, but the place need update and redecorate.Also need better food choices.",
  "tripadvisor_monas_828": "Taman Mini Indonesia Indah (Taman Mini for short) is located around 20km to the east of Jakarta city center. I always try to bring my business guests to this place if they have some time to spend in Jakarta. It is true that it is not really a miniature of Indonesia, but with a car you could see all the...More  ",
  "tripadvisor_monas_829": "Taman Mini is really neat. It's really big but it is a miniature Indonesia showing all the different regions and cultures. It is possible to do it walking but it is much better if you have a car.",
  "tripadvisor_monas_830": "I don't know why so many dissapointed people write their review here. I had wonderful 4 hours at this park and want to return there again and again. I walked through the whole park and visited many building there. I had two trips by aerial cableway and saw from the top also. There are many building works inside and interesting...More  ",
  "tripadvisor_monas_831": "Need maintenance and renovation,it should Indonesia miniatur can be better and more clean :)",
  "tripadvisor_monas_832": "If you visit Indonesia and dont have time to go to other place, you can go to this place. The concept was to have all area in Indonesia in the miniature park. But please dont be mistaken this as miniturk in Istanbul or madurodam in hague. This mini park is bigger. You cannot find miniature format. But, what you can...More  ",
  "tripadvisor_monas_833": "If you want to see the entire layout of the country of Indonesia and get a taste of the culture, drop by here for a visit.",
  "tripadvisor_monas_834": "Indonesia are large country and archipelago. To visit all the entire country is difficult, but you seem like traveling to almost Indonesia in this Miniature Park. Try it :)...",
  "tripadvisor_monas_835": "if you want to know indonesia in one day, come to this place.. but please bring your own car/vehicle since the public transportation/attraction is always full by visitors",
  "tripadvisor_monas_836": "The best place to have a short tour of Indonesia !!",
  "tripadvisor_monas_837": "The best place to have a short tour of Indonesia !!",
  "tripadvisor_monas_838": "it's owned by Soeharto Family, create by Ibu Tien Soeharto, Soeharto's wife of course. It's great landscape with so many Indonesian Culture inside, and briliant idea to make everything is here.sky train, waterboom, Theather 3 D (if i am not wrong the first in ASIA).Better u spend 1 day to visit TMII, it's so big, located South of...More  ",
  "tripadvisor_monas_839": "You can learn about diversity in Indonesia culture, including the common sense of its unity. The building, sculpture, apparel as cultural heritage describe cultural wisdom between human, Lord and the universe",
  "tripadvisor_monas_840": "Taman mini contains not also miniature islands, they also have somekind of differences ceremony sometimes. Very representative of indonesian heritage. At least we could have the huge view of indonesian cultures here. My favorite in Javanese part...",
  "tripadvisor_monas_841": "A great place to review Indonesian culture. Beware on holidays can be too many people.",
  "tripadvisor_monas_842": "This park was made to introduce the vast archipelago of Indonesia and the diversity of the country. You can catch glimpses of traditions across provinces in Indonesia in this place and will be amazed to see how \"rich\" Indonesia is. This park may be a great introduction of Indonesia's culture. There are many routine cultural events held in this place....More  ",
  "tripadvisor_monas_843": "If you don't have time to visit all 33-provences in Indonesia, you could get a touch of culture of each province here. They have all 33-provences showcase with each houses, clothes as well as interesting dances (usually on weekends). Highlight of these areas are Bali, Jawa Tengah, Kalimantan Timur, Sumatera Barat. Don't miss Science Museum (Museum IPTEK) with their earthquake...More  ",
  "tripadvisor_monas_844": "a great complex that help guest to know what inheritance that Indonesia have... I've been there when i was so little.. and it still in my memory.",
  "tripadvisor_monas_845": "really well maintained with variety of fishes.good place to bring children.",
  "tripadvisor_monas_846": "You can see traditional building, dance, music equipment in Indonesia without going down to each provinces... Just come here and explore in one or two days.",
  "tripadvisor_monas_847": "You can learn a lot about Indonesian culture by visit Taman Mini Indonesia Indah, during saturday and sunday, they will perform parade with traditional costume, very cheap ticket...read more ",
  "tripadvisor_monas_848": "You can learn a lot about Indonesian culture by visit Taman Mini Indonesia Indah, during saturday and sunday, they will perform parade with traditional costume, very cheap ticket, but you must prepare to walk around this venue coz not many free minivan travels around.",
  "tripadvisor_monas_849": "This is a good place to know a bit more about Indonesia and its culture. Before you travelling around the real island, its a good choice to visit this place and select your perfect destination.",
  "tripadvisor_monas_850": "We visited Jakarta more than a year ago, but I'm sure this attraction hasn't changed. It's in the midst of the city, and is a replica of Indonesia: a water feature showing the islands (the larger ones); small buildings, mostly wood, replicating the dwellings of the 26 provinces, each with displays of that culture. The park is one sq. km,...More  ",
  "tripadvisor_monas_851": "Very big amusement park. Not really far from our home. There are plenty options for children to play and see educational spots and museums.",
  "tripadvisor_monas_852": "Right after we came through the big gate and paid our very cheap entrance fee, we start our journey to see the miniature of Indonesia. Every province in Indonesia represent with one arena. Include all their house, clothing, the people and you can get short tour with the guide if you really have time for it. We just do the...More  ",
  "tripadvisor_monas_853": "Basically presents the arts, crafts and traditional symbols of each provinces. On a good day, you might find dance shows and witness ceremonies (done by those living in the capital city)",
  "tripadvisor_monas_854": "in this place you can see all indonesia tradisional houses and art performance its a must visit place...",
  "tripadvisor_monas_855": "To pay a visit will not bother you. It's nice if you have kids.",
  "tripadvisor_monas_856": "I cannot really explain what it is like to visit this place, you have to go! Yes, you can see all the different cultures of Indonesia there - one minute you can be in Bali, then next in Aceh.It is indeed Indonesia in Miniature - so you MUST take the cable car (made in the UK, so no worries...More  ",
  "tripadvisor_monas_857": "A practical destination if you dont have time to explore Indonesia. The Bird Park is quite well maintaned, although it is not as big as Jurong Park. The Imax Theater is still being used. Quite clean with spacious parking area...the problem is ...it is so artificial.",
  "tripadvisor_monas_858": "This is a good place to find out about the history of Indonesia and there is alot to know. There is not much choice with food outlets and always best to bring your own!",
  "tripadvisor_monas_859": "if you do not have time to travel a round Indonesia because Indonesia is a very big country, but in the other hand you have a big interest about the Indonesian culture please come to taman mini Indonesia indah is a nice places to visit. but in the weekend in taman mini is so crowded, is will be better if...More  ",
  "tripadvisor_monas_860": "the collections, the details, the infrastructures and the accommodations. also not pricey, fits to all type of visitors",
  "tripadvisor_monas_861": "Here you can see a glimpse of Indonesia, just take a gondola to see the miniature of every island in Indonesia. not just see the miniature, you also can see the attraction from every province in Indonesia. if you came here, don't forget to watch theater keong mas",
  "tripadvisor_monas_862": "This is a good place to find out about the history of Indonesia and there is alot to know. There is not much choice with food outlets and always best to bring your own!",
  "tripadvisor_monas_863": "Taman Mini is a bit difficult to get to. We went by TransJakarta bus and then had to catch a mini-bus in order to get to the park. Still, I don’t recommend going there by taxi, because of the dreadful traffic which can lead to higher prices. You must take your time to visit the park, because it is very...More  ",
  "tripadvisor_monas_864": "Want to know about Indonesia in one place? Here's the place. If you have limited time on exploring Indonesia, just come to TMII. It's not boring, as well.",
  "tripadvisor_monas_865": "This place is to huge with minimal public transportation inside the Park - it would be very tiring to look around the park - and they also have limited entertainment.",
  "tripadvisor_monas_866": "It's indeed the miniature of Indonesia. You can see many buildings and cultures that represent all the provinces in Indonesia. But, I think they still need to improve the quality of services and cleanliness because so many people go there, especially during the holiday",
  "tripadvisor_monas_867": "This park is called Mini Indonesia Park, but there is nothing miniature about it... aside from several museums, there are model houses from various Indonesian tribes, so you can see what a typical house from a particular region looks like. If you are lucky like we were, you might even stumble upon some tribal festivities. We got to different groups...More  ",
  "tripadvisor_monas_868": "I visited this place several times. Surprisingly, the place hasn't change at all. We only sees new waterpark facilities there. I hope that the promote and develop this place professionally to maintain people needs.",
  "tripadvisor_monas_869": "We visited early on a Saturday morning. The park opens at 8am. We walked around all the attractions and visited a few museums. You will need more than one visit to see everything...read more ",
  "tripadvisor_monas_870": "It was established by the former first lady of Indonesia during oppressive regime of Soeharto. The idea was great, too bad it is not well maintained nowadays and people know it the most because they have so many places for traditional wedding ceremony...",
  "tripadvisor_monas_871": "We visited early on a Saturday morning. The park opens at 8am. We walked around all the attractions and visited a few museums. You will need more than one visit to see everything. Being two tall Europeans, we became an attraction especially with the children who all wanted their photo taken with us! They were all very friendly though!",
  "tripadvisor_monas_872": "Indonesia had islands, many culture, also many native language, diversity in one place. Cheap price",
  "tripadvisor_monas_873": "This park consist of numerous museums and attractions, but must be noted that every building here charge their own ticket. I suggest avoid the tandem bikes and we rent 2 bikes and go to the bird park, fresh water museum and insect museum. We also saw a short film in the 4D theater and relax at the Chinese garden. Everything...More  ",
  "tripadvisor_monas_874": "There are many sample houses from different area like the west sumatera house.... Dislike their open hours until 5pm",
  "tripadvisor_monas_875": "We were surprised by the large park with buildings of different architecture and there was also an enclosure for the Komodo Dragons. Near the entrance is a miniature Borobudur. Other than this, most of the structures in the park are large life-size structures.The old-dated train is a popular way of travelling round the park.",
  "tripadvisor_monas_876": "It is amazing place, mainly with local Indonesian, a place that tourist that want to know Indonesia should visit",
  "tripadvisor_monas_877": "This huge park - set around a man-made lake that's filled with miniature islands representing the different parts of Indonesia - is clearly a big attraction for local children and their families at the weekends. It's slightly surreal for foreign tourists, but interesting enough if you're looking for something to do in Jakarta (I wouldn't dedicate time specifically to it)....More  ",
  "tripadvisor_monas_878": "If the idea of being dangled in a rust bucket over a dirty lake, or peddling a sad and sorry looking 'paddle duck' across the same algal bloom infested water is appealing, then Taman Mini is for you. For anyone else: avoid it.Sure, the collection of unique architectural monuments from across the archipelago is impressive - and convenient -...More  ",
  "tripadvisor_monas_879": "This is a HUGE area with a lot of museums, theater, zoo, culture parks, shops, water parks.. all meant to introduce Indonesian culture, geography and resources.Seems to me that each of them is under different management, so there are really mixed reviews for each attraction. Me and husband spent almost 5 hours but still not enough to go to...More  ",
  "tripadvisor_monas_880": "A huge park showcasing Indonesia in miniature!It's not far from my heart as I have seen parks like this even in my countryIt was a neat and great experience to appreciate...read more ",
  "tripadvisor_monas_881": "I visited the Taman Mini Indonesia Park. It was fabulous. The concept of a mini replica of the archepelago nation should be appreciated. For those who cannot afford to spend weeks going around the vast country, the Mini Park is an ideal site to have a look at the Indonesian culture and variety, all in one day.",
  "tripadvisor_monas_882": "When I told people I met in Indonesia that I just visited the really big park called Taman Mini Indonesia Indah in Jakarta, they would laughed a little and said,”Oh Yeah, the one built by Madame Ten Percent!” At first I did not know that expression. But when I sat down in the library of Selasar Sunaryo Art Space in...More  ",
  "tripadvisor_monas_883": "I went there during the Waisak Day holiday and the place is pretty crowded. I can only give an objective review of this place and decide for yourself whether you want to visit this place. It is very average in my opinion.Positives1) The IMAX theater is great if you understand Indonesian.2) There are a number of traditional...More  ",
  "tripadvisor_monas_884": "A huge park showcasing Indonesia in miniature!It's not far from my heart as I have seen parks like this even in my countryIt was a neat and great experience to appreciate the many faces of IndonesiaIt's no surprise that it is popular among many visitors as new attractions are added as years go by!The cable car...More  ",
  "tripadvisor_monas_885": "Dear all,it is really hard to find, the signs disappear as you get closer. And there's a high chance (as happened to us) to get a taxi driver who just moved to Jakarta.Then it took us 2 hours to get back to the Sudirman/Central Business District/Central Jakarta area so that didn't help.Exhibits are run down, crumbling away....More  ",
  "tripadvisor_monas_886": "I was in Jakarta, Indonesia for about 45 days and the only thing i did for 43 days was to travel between my hotel and work. So what did in two days? I saw Indonesia.The two places i visited in jakarta were 1. Sepa Island 2. Taman mini Indonesia.When i enquired with the locals about TMI, i got...More  ",
  "tripadvisor_monas_887": "Ideal for a good insight into the culture and architecture of Indonesian.",
  "tripadvisor_monas_888": "This place is a MUST TO Do when you visit Jakarta- you can view various of indonesian cultures from Sumatera to Irian - from their traditional house to their cloths.There's a cable car where you view miniatur of Indonesia island on the pond.You can rent bike to tour around the park. There's also a museum near the entrance,...More  ",
  "tripadvisor_monas_889": "This an awsome place for all visitors to go to when in Indonesia.Prepare for a good walk about and have at the least a good 4-5 hours if not a whole day.It houses the 'traditional homes/houses, pavillions, museums,flower gardens, temples and other attactions from every Province in Indonesia.You casn also take a Sky Lift cable car ride...More  ",
  "tripadvisor_monas_890": "We visited in July 2010, mid-week. Although the major portion of this park was finished in the 1980's, I found it a very useful way to gain an overview of the many different architectural, heritage and cultural variations that this beautiful country offers. We took the chair lift which allowed an overall impression and a quick way to see how...More  ",
  "tripadvisor_monas_891": "Certainly a great overview of Indonesia and its many provinces. Enjoyed the Bird Park, and the reptile enclosure signified by a great Komodo Dragon is good - and the highlight of...read more ",
  "tripadvisor_monas_892": "Certainly a great overview of Indonesia and its many provinces. Enjoyed the Bird Park, and the reptile enclosure signified by a great Komodo Dragon is good - and the highlight of this is, for a small fee - you can go into Bima's (the Komodo dragon) enclosure, touch and stroke him and of course take as many photos as you...More  ",
  "tripadvisor_monas_893": "very beautiful amusement park, if you want to see all indonesia in one day! it's very big so you need to rent a motorbike to visit all or to arrange with the taxi driver (the cost it's the same). perfect for children.",
  "tripadvisor_monas_894": "In this park you receive a good overview of the different kind of lifestyles in this country.Visiting this museum is a little bit like you have seen the whole country, what is not possible if you stay her for a few weeks.",
  "tripadvisor_monas_895": "From a Princess Cruise ship, we were taken on a bus tour all around Jakarta, and this park was one of the stops. It seemed nearly deserted or off-season, but the stop was a clean and welcome relief after being on the bus all day. The bird park portion of the park is worth the whole stop there - amazing...More  ",
  "tripadvisor_monas_896": "Taman Mini is located in East Jakarta, a substantial distance from Central Jakarta where most tourists are based. This is one reason not to bother going there.The other is that it contains a fairly sad looking collection of cement copies of traditional buildings from around the country. Although its a place beloved by many Indonesians to most western eyes...More  ",
  "tripadvisor_monas_897": "the museums and traditional houses are actually nice.if you want to lie and tell someone back home that you travel all around Indonesia, then this is the right place. just take plenty of pictures in front of every traditional houses. you'd be in Sumatra, Java, Papua, Sulawesi and Borneo in only one day!value for money goes to the...More  ",
  "tripadvisor_monas_898": "Recently, me and my friends went to TMII as a field trip task. So, this review is written from a teenager perspective. I really don't recommend anyone who brings teenagers or small children to this place. This place might be huge, but there's nothing that teenagers can enjoy. In this place, you can see the houses of every cultures from...More  "
}