{
  "tripadvisor_monas_0": "banks is type of business that is depend on technology. so how banks works before computer was born? well.. they do everything manually. you will find many collection about bank...read more ",
  "tripadvisor_monas_1": "banks is type of business that is depend on technology. so how banks works before computer was born? well.. they do everything manually. you will find many collection about bank business from colonial era. my favorite collection is a ledger thats so huge and old where bankir write (literally) every transaction they made. amazing.",
  "tripadvisor_monas_2": "If you want to learn about Mandiri bank history, this is the right place. There's story behind Mandiri bank until now. You can see too some an old bank machine.",
  "tripadvisor_monas_3": "Museum Bank Mandiri is one of the authentic museum in Jakarta with its colonial art deco. The museum itself displays an interesting scenery, what struck me the most is statue of Hermes, the god of shepherds. But I must say, Museum Bank Mandiri is very hot.",
  "tripadvisor_monas_4": "Just opposite of the old central railway station (BEOS).It was a Nederland Bank back on early 19's and now become museum.If you like history and architecture you should like this histories building, Saturday and Sunday a lot people visit this museum and photographers often use this building as their background.Enjoy Indonesia!",
  "tripadvisor_monas_5": "I went there on a date. It was a very nice venue. Displays were interesting and informative. To my surprise, parking was available that was secure and close to the museum. I will go back. You always miss something.",
  "tripadvisor_monas_6": "Bring your children to this museum. it well arrange, educative and interactive display so it will be fun for children even for adult.",
  "tripadvisor_monas_7": "The building is well maintained. The set up brings you back to the past, of how banking used to be done. Love the windows.",
  "tripadvisor_monas_8": "the display mostly covered in dust and you have to pay for that. the ventilation is really bad so you will find this place really hot and lack of oxygen. the building itself was a deutch architecture which would be hard to enjoy since the atmosphere is not convenience.",
  "tripadvisor_monas_9": "If you love museum, old town, and heritage building, so you have to come to Mandiri Museum. Located in around Jakarta old town city, and near to Jakarta Kota rail station. You can find many more incredible things about bank's history, money, and something so surprises you've been never found before.",
  "tripadvisor_monas_10": "Not like the next Museum which more 'better', Mandiri museum seems still hold the old look, i know that great, but makes the tourist not comfortable.Especially the ground level, dark, gloomy make me feeling creepy :) see history and feeling spooky, you should visit this museum!",
  "tripadvisor_monas_11": "Went there around 9.30AM of Aug. 13, 2016 with my son. It's located in Kota Tua area, Jakarta, near the Jakarta Kota train station. There is a parking lot In the front of the...read more ",
  "tripadvisor_monas_12": "Went there around 9.30AM of Aug. 13, 2016 with my son. It's located in Kota Tua area, Jakarta, near the Jakarta Kota train station. There is a parking lot In the front of the building, but it's rather small (my guess can take less than 15 cars). Upon entrance, on the left there's a working Bank Mandiri ATM. No entry...More  ",
  "tripadvisor_monas_13": "This museum is a static museum. It is quite interesting and there are some interesting displays. The architecture is the big feature.",
  "tripadvisor_monas_14": "Free for mandiri account members, Big historical building and many rooms, old schools & dusty. some places look like spooky. Show many things of Bank Tools",
  "tripadvisor_monas_15": "This places is located in old citi, jakarta kota. You can find the indonesia banking history in here. And because the building has an unique interior design, some of movie, comercial or music video was shoot here. So you can meet celebrities (if you are lucky) and taking your time to have a picture, no doubt the interior design is...More  ",
  "tripadvisor_monas_16": "nice to visit if you are around Jakarta Kota, but not their best museum arounda bit old and dusty and need improvement",
  "tripadvisor_monas_17": "This museum really made me feel like I was back to the colonial days. The setup of the banking hall is very much historical. Highly recommended.",
  "tripadvisor_monas_18": "The mandiri museum is architecturally more beautiful than central-bank museum next to it. The stained glass on the second floor is beautiful, the old meeting room is majestic, the lead colored ceramic blocks on the first floor and second floor is perfect. But the poor maintenance shourds its beauty. Some of the section, especially underground safe and hajj-savings section is...More  ",
  "tripadvisor_monas_19": "Most of things were antique equipment and unique shape, but the building so old and bit \"scary\", the environment seem so old.. but if you like Museum, you can see all equipment of bank by time to time.",
  "tripadvisor_monas_20": "I came here on weekdays, just to found out that this is an old abandon building without any serious intention to build a decent museum. Most of the exebition is dirty and in some section, it looks like abandoned warehouse.I think as one of the biggest bank in Indonesia, Mandiri could do it better than the current.",
  "tripadvisor_monas_21": "this museum tell us about the history of money, in Indonesia especially. what happen with the indonesian economic before independence day. the first until current money also showed in this museum.",
  "tripadvisor_monas_22": "The museum was nicely built with ACs inside and a very conducive place to hang out with friends while learning some history.",
  "tripadvisor_monas_23": "The museum was nicely built with ACs inside and a very conducive place to hang out with friends while learning some history.",
  "tripadvisor_monas_24": "Learn as many as you can because this museum tells us what was happen in the colonial era's and telling us how the economy begin during the Dutch landed in Jakarta (Old Batavia City)",
  "tripadvisor_monas_25": "I love the building. It's an oldie but definitely a goodie. I love the tile, I love the high ceiling, it's cool inside eventhou without aircon, just like typical oldstyle houses back in the past. Kids should be excited here as they can learn about history of money. The entrance fee is very cheap. I would want to visit again...More  ",
  "tripadvisor_monas_26": "it was very nice to visit this museum, a bit creepy but very nice to visit thiscleanstrategicnicecity center",
  "tripadvisor_monas_27": "location of this museum is quite strategist, it near train station that connect jakarta-bogor and also busway shelter. majority of it collection is related to history of Indonesia banking system.",
  "tripadvisor_monas_28": "It locates near our house at Old Town. I used to walk there. Great place for museum lovers. Need to be repainted more often.",
  "tripadvisor_monas_29": "I make my visit here at 9.30 which is good because there haven't so many people yet.Nothing much to see, but the architecture of the building is quite good and they have many old office equipment like printer machine, typing machine, safety-box, etc. and also the history of the atm and others.The one i like from this museum...More  ",
  "tripadvisor_monas_30": "This museum is exactly accross Kota Train Station (Beos). In my opinion, this is one of Indonesia's well maintained museum. It also children's friendly with its audio visual. There's a room where you could currencies from around the world, and Rupiah's History. This place also regularly used for photo exhibition.",
  "tripadvisor_monas_31": "well i can say this site is really like time machine to bring u back to the ancient one. This place is so original by Batavia Bank and that were a beginning of Bank Indonesia.if u wanna take a picture is good, but make sure to keep ur belongings well cause be care full with pick pockets there. The...More  ",
  "tripadvisor_monas_32": "Located in Jakarta old town.If you're in Jakarta and interest to do museum trips, this museum is not bad to visit because it's located near transportation public area such as busway and train station.One of my favorite spot was in the corner of typewriters display.",
  "tripadvisor_monas_33": "I went there while viisting Kota Tua. Not much to see in the museum. However, the museum trip would enrich your knowledge about the history of Indonesian banking. The entry fee is...read more ",
  "tripadvisor_monas_34": "I went there while viisting Kota Tua. Not much to see in the museum. However, the museum trip would enrich your knowledge about the history of Indonesian banking. The entry fee is so cheap, just IDR 5000 or USD 40 cent",
  "tripadvisor_monas_35": "Bringing your kids here should be great.They should learn lot of things here, especially for the money history.Cheap, clean, convenient..",
  "tripadvisor_monas_36": "The building and the properties stored there are clean and have quite good maintenance, but the museum itself doesn't show so much infomation and a bit boring.",
  "tripadvisor_monas_37": "This Building have several collection that very rare like bond and securities, also huge box. The story of this building also interesting. In basement you can find box not also for saving money and document but also for send dead people",
  "tripadvisor_monas_38": "the combination of the antique collection and old building, visiting the museum would make you feel like you're not in the 21st century! i love seeing the typewriter collections put on the wall, and the diorama of the bank with people in cowboy customs.",
  "tripadvisor_monas_39": "Actually, their collection interesting enough, diorama how's the bank operating earlier times. Too bad, this place untreated. Dust everywhere, Statues sculpture old and already worn out. And no aircond or good ventilation here. I hope this place renovated and maintained better.",
  "tripadvisor_monas_40": "This museum holds a paraphernalia of banking activities, back from early 20th century or perhaps before. This museum is free of charge when i visited it in January 2016 (hopefully it will stay free)In my opinion the building itself is interesting to observe and explore, particularly for those who like old building architecture or those who like to see...More  ",
  "tripadvisor_monas_41": "i like the building of this museum. but seriously there's nothing much to see in this museum. unless you really keen on this kind of subject.",
  "tripadvisor_monas_42": "This museum located near fatahilah square and stasiun kota. Its collection about bank. Like atm, cashier machine, diorama bank. At second floor u can find many pictures about bank mandiri before untill now.Honestly, this museum isnt interesting very much for me..",
  "tripadvisor_monas_43": "this museum has a mixed review, although i have given it a very good this is because its worth seeing. as a museum its run down and if you accidentally find yourself on other floors (not open) its not well maintained at all. this could be a really nice museum. what i like is seeing the complete layout as it...More  ",
  "tripadvisor_monas_44": "we can study about history of bank mandiri, a little bit hot cause they don't have ac, a large collection of old things like old kind of atm, calculator, buku besar, old cheque...read more ",
  "tripadvisor_monas_45": "we can study about history of bank mandiri, a little bit hot cause they don't have ac, a large collection of old things like old kind of atm, calculator, buku besar, old cheque book, the have diorama banking hall in the old times so you can imagine banking in those days. Big building but dusty and hot. If you have...More  ",
  "tripadvisor_monas_46": "This place originaly is ex-Bank Export Import Indonesia. Was take over by Bank Mandiri several years ago. And now become a Mandiri Museum. You can look how the old bank works with a lot of diorama (teller, banking machine, etc) on the Dutch Colonialism Era. They also have a big money safe on the basement area and also old safety...More  ",
  "tripadvisor_monas_47": "This is the first place where me and my wife met. This museum is very well managed. Clean and tidy. The staff also helpfull and has a wide variety of collection.",
  "tripadvisor_monas_48": "You only have to pay IDR 5,000 to enter, and you free to go everywhere around this museum. I really amazed with the strong structure of this place. It was build in 1933 and now, it is still standing strong in 2015. The high ceiling, the neat structure and the detail rooms looks so beautiful and jaw dropping, especially when...More  ",
  "tripadvisor_monas_49": "There's little English (or Indonesian) explanation in this glorious old building. There's a lot of dust and random objects though, which make for an interesting poke around for an hour or so. You can almost imagine the splendour of the old banking hall, and the lower level safety deposit boxes are interesting to see. The mannequins will likely give you...More  ",
  "tripadvisor_monas_50": "but I never been there and I am Indonesian. I think is a amazing, excellent Museum and I request for anyone!",
  "tripadvisor_monas_51": "The best feature for this place is the stained glass, the collection itself not really on well maintained.",
  "tripadvisor_monas_52": "So, last time my friend from Vietnam come for 3 days, then i bring them to Museum Mandiri, Kota Tua, for me personally it was my first time also to come here. Their building was great and i quite enjoy to come here, you can know Indonesia currency history here, how economic had been starting here as well, i will...More  ",
  "tripadvisor_monas_53": "Been here several times to shoot movies. But I actually did have several free times to take a look around the museum. It stands in a huge property. I don't really know the history about this place but based on what I've heard is this building was established since the Dutch Colony era. The artifacts in the museum all related...More  ",
  "tripadvisor_monas_54": "i went to this place last January for gathering. i look around this place, it is a nice museum but lack of care and maintenance. lots of space open and unclean.",
  "tripadvisor_monas_55": "Nice museum with diorama , this old building was built by the Dutch, You should come if you visit Kota Tua Jakarta, If you have Bank Mandiri account you don't have to pay entrance...read more ",
  "tripadvisor_monas_56": "Nice museum with diorama , this old building was built by the Dutch, You should come if you visit Kota Tua Jakarta, If you have Bank Mandiri account you don't have to pay entrance ticket.",
  "tripadvisor_monas_57": "This is a place where you can find any historical stuffs of Bank Mandiri. Bank Mandiri is a Public Bank in Indonesia, which Mandiri means \"do it by your self\". Here, you can see the first equipment of this bank such as a machine to count the money. Also the first generation of ATM in Indonesia. Not only the machine,...More  ",
  "tripadvisor_monas_58": "One kind off a place to experience both learning and relaxing at the some time. Its fun to know how's money and banking developed in Indonesia a long-long time a go.",
  "tripadvisor_monas_59": "museum bank mandiri is located in old town, you can reach here by commuter line stop in kota station. the entrance is free.",
  "tripadvisor_monas_60": "An antique palce to visit, you would feel Deutch era in the middle of the capital town. Easy access by Transjakarta but very crowded.",
  "tripadvisor_monas_61": "Mandiri Museum is a Museum named from Mandiri Bank in the old time. Here we can see the Bank Style in the Old Period on Dutch Period. We can see all the Equipment on the old time in this museum.",
  "tripadvisor_monas_62": "I'd love to visit historical places such as this museum. As I went by for some times there, there was not so many changes in every visit of mine. I like the smell of history of how Mandiri built and its horror atmosphere. The history of each property written both in English and Indonesian (for some)The entrance fee is...More  ",
  "tripadvisor_monas_63": "private museum manage by Mandiri Bank, will take you to a beautiful artdeco build in 19 century. Mandiri Museum have complete collection of bank properties of bank mandiri and it siblings. relax at the museum cafe after enjoy the building and the collection will complete your visti at mandiri museum",
  "tripadvisor_monas_64": "A nice place to visit in Jakarta, especially if you want to know about banking history in Indonesia. Check out the door of the Main Vault and the mirror and layout for security reason. To go there, better take TransJakarta since the parkir area is limited and the bus stop is in front of the Museum",
  "tripadvisor_monas_65": "This is a historical building where they provides information from banking business during Indonesian past include during colonial period. What makes me stunning is the basement where all the specimens from safe deposit box. It looks like a prison, but now i know the reason why the Dutch brings them to keep their money securely.",
  "tripadvisor_monas_66": "this place is worthed to visit. you also can find some historical place near by mandiri museum..its located at Kota, you can take transJakarta bus and stop at kota station.",
  "tripadvisor_monas_67": "After visited the Bank Indonesia museum just next to it, it is a huge disappointment to see this museum. The collections are poorly maintained. Bank Mandiri should give more attention to its asset and provide AC.",
  "tripadvisor_monas_68": "this place is worthed to visit. you also can find some historical place near by mandiri museum..its located at Kota, you can take transJakarta bus and stop at kota station.",
  "tripadvisor_monas_69": "This Museum is old build by Dutch and very nice architecture and design, you will know the historical of Bank Mandiri from beginning, Bank Mandiri is acquisition from some of government bank since Indonesia was faced economic crisis, but this place very good to visit especially for people who is like museum",
  "tripadvisor_monas_70": "it may not as sophisticated as Museum Bank Indonesia.the display in the museum is quiet enough to bring visitors back about a century ago.",
  "tripadvisor_monas_71": "Finished in 1925 in Dutch Colonial Art Deco Style, for Nederlandsche Handel Maatschappij, which later became ABN Bank in The Netherlands. The NHM branch in Batavia, established around 1826, needed a more spacious office, as business was booming. After 1960, already having been nationalized, this building was owned by Export-Import Bank, or Bank EXIM. Now a museum, owned by Mandiri...More  ",
  "tripadvisor_monas_72": "History of Bank in Indonesia. The location at \"Kawasan Kota Tua\" near from Museum Fatahilah. I found old bank server from IBM in this place and other old stuff like documern etc, interesting. With old decoration.",
  "tripadvisor_monas_73": "Museum Bank Mandiri provides full knowledge about money history, especially Indonesian money. The museum is comfortable, easy to access and nicely maintained. Free of charge. All Indonesians must go there. You will gain more history of Indonesian money as well as feel more attached to heritage.",
  "tripadvisor_monas_74": "Beware of the traffic.make sure you go there in weekends or any holiday.Best way is by train. Local train Bogor-Jakarta Kota. After that, you can walk to the museum.Dont forget to enjoy the night view at weekends around this area.",
  "tripadvisor_monas_75": "marvelous heritage of banking with a lot beautiful space....although sometimes a little bit creepy since the building its very old :)try the night walks tour in this museum ! its lovely !",
  "tripadvisor_monas_76": "Loving the idea of old financial stuffs being displayed as part of the bank history. The typewriter corner is also interesting. But in order to work and interest people, it needs a serious cleaning and maintenance. Will be a great place if this can be done.",
  "tripadvisor_monas_77": "If you are in Jakarta and interest to do museum trips, this museum is not bad to visit. To know about Mandiri historical and what happened about typewriters in the past. You can...read more ",
  "tripadvisor_monas_78": "If you are in Jakarta and interest to do museum trips, this museum is not bad to visit. To know about Mandiri historical and what happened about typewriters in the past. You can enter the museum for free if you have mandiri card. My fav spot was in the corner of typewriters display. Too bad there is no guide to...More  ",
  "tripadvisor_monas_79": "The place is big and very interesting to be visited. However no staff can give us explanation about the history of this place. If u have Mandiri ATM then u can go in for free by showing your Mandiri ATM card",
  "tripadvisor_monas_80": "The museum show the private collection from Mandiri Bank. It all looked interesting at first, but the collections have stain in some parts. A lot of dust and lack of fresh air made the building is not comfortable for long visit. The museum needs service maintenance for sure to attract more tourists.",
  "tripadvisor_monas_81": "This museum provide the old machines and equipments which are use in banking world. Old type writer, stamps, old computer, old deposito (which is hand writing!) Most of activity are manual at that time. And you'll find their unique method in handle all the job.",
  "tripadvisor_monas_82": "What makes this museum interesting is the fact that most of the exhibits are the old office equipment that usually ends up in a landfill somewhere. This means that older visitors who worked in offices from the 1960s to this millennium will recognize the old office machines, computers etc that they used to do their day to day work and...More  ",
  "tripadvisor_monas_83": "First time I walked into the building, the spooky atmosphere is really strong. It's getting worse in the basement where it shown us some kind of history of banking in diorama.But when I get to the library, it has some of cool stuff to read and relax. If you're interested in history and banking, you may like this one.",
  "tripadvisor_monas_84": "Loved the interior of the museum especially the beautiful stained glass window going to the second floor. Also loved the long quiet corridors, brown floor tiles, marble counters and even the pretty courtyard in the middle if the building.The exhibits were well displayed and the information were very clear. We loved looking at all the machines over the past...More  ",
  "tripadvisor_monas_85": "For students, you're free to enter. You just have to write your name and your school/university name down in a guest book.I have come to this museum several times. And I do appreciate the development that's showing. Literally, over the years, the museum was trying to stay 'new'. Really, if you compare the after and before, you would see...More  ",
  "tripadvisor_monas_86": "First i visited this museum that located in Kota, Jakarta, it is so scary and spooky.. I got the mystic feeling when I walk around the museum. The museum is so dark and full of mystic. Everybody likes to visit this museum because of its mystic, not the history itself. Okay, nothing to do here. But I saw people take...More  ",
  "tripadvisor_monas_87": "This museum is located in Kota Tua, near Harmoni. The place was a bank, but now functioned as a museum. The entry ticket is very cheap, with no guide at all. We enter the museum and there are a lot of rooms visit, they displayed a lot of historical items in banking back then. Also stories about Bank Mandiri.The...More  ",
  "tripadvisor_monas_88": "You can enter Bank Mandiri Museum for free and you’ll find so many historic artifacts regarding to the journey of Indonesian finance history. This place is very strategic, easy to...read more ",
  "tripadvisor_monas_89": "You can enter Bank Mandiri Museum for free and you’ll find so many historic artifacts regarding to the journey of Indonesian finance history. This place is very strategic, easy to reach for any backpacker but keep your wallet safely, because the issue said that some tourists are a victim of a pick pocket.You can reach the place by TransJakarta...More  ",
  "tripadvisor_monas_90": "its close to the old town area, just few blocks away a good museum and everything seems to be neatly done and well-kept though theres no air conditioning",
  "tripadvisor_monas_91": "I went to Fatahillah square and wasn't really impressed with it, but the massive building of Mandiri Museum held my attention. I decided to visit it . The entrance fee is just 2000 Rp . there is no Air conditionning in the building but the ceiling is very hight, keeping the rooms cool . The museum is disorganised , no...More  ",
  "tripadvisor_monas_92": "The whole place seems like a poorly lit and ventilated warehouse. The exhibits include some old office equipment (old keyboards, typewriters, ATMs etc) and they were all poorly maintained and presented, making it seem like flea market than a museusm. There is no airconditioning in the building making it really stuff and warm to visit. Give this place a miss!",
  "tripadvisor_monas_93": "When you come to Fatahillah area, you can find Mandiri Museum easily. Especially when you use Trans Jakarta Busway, just stop and use underground road, and will be in the front of Mandiri Museum.From the front, it's looked nice, with old building. But I can't find any nice lighting or good performance inside. You've just found many old machine,...More  ",
  "tripadvisor_monas_94": "MANDIRI MUSEUMLocated right next to the Bank Indonesia Museum, it is in an art deco building set up in 1929. As the Dutch Factorij Nederlandsche Handel Mastschsppij. Bank Mandiri was formed by the merger of several failed banks, and took over the entire two-storey building as a museum. It presents Indonesia’s banking as it was in the early 1930s...More  ",
  "tripadvisor_monas_95": "The architecture is great; colonial style. The collections are quite complete so we can know the bank's history and how they worked. On special occasions, the museum allows visitors to see them construct the colonial time where people (Europeans, Indonesians, Chinese) transacted in the bank. Also, we can go to the top of the building and see Jakarta Old Town...More  ",
  "tripadvisor_monas_96": "Very well built....paintings and sculptures are great....loved the ant concept on the main gate.. this is a nice place to visit..... Its not very crowded and is situated in convineant location...when you visit Jakarta mark it on your list",
  "tripadvisor_monas_97": "The architecture of the building shows a mix of Indonesian and European architecture, not much to see, but worth to pay since the ticket only less than 5000 rupiah.",
  "tripadvisor_monas_98": "Very easy to access. With public transport, just take Trans Jakarta (known as busway) koridor 1 from Blok M. Alight at the last station: Kota. It's right in front of the bus station.This museum is an heritage. It describes the old style of Indonesian Bank. Very interesting for those who passionate by heritage. I saw some students took class...More  ",
  "tripadvisor_monas_99": "it's located not far way from Fatahilah. side to side with Bank Indonesia (real bank not museum).U have to pay higher than the ticket..... donation again...inside u can see...read more ",
  "tripadvisor_monas_100": "it's located not far way from Fatahilah. side to side with Bank Indonesia (real bank not museum).U have to pay higher than the ticket..... donation again...inside u can see any kind of money we use, and bank equipment, nice place for knowledge.Front of the bank is 'STASIUN KOTA' Train station. and right side of the bank is...More  "
}