{
  "tripadvisor_monas_0": "At first i was afraid to enter the building. The colonialism nuance still there. But, don't forget, this place offer you to learn history of money and banking in Indonesia...read more ",
  "tripadvisor_monas_1": "At first i was afraid to enter the building. The colonialism nuance still there. But, don't forget, this place offer you to learn history of money and banking in Indonesia, especially in Jakarta. If you can go to the basement there's a large aisle that will lead you to storage room which contained a lot of specimen of safe deposit...More  ",
  "tripadvisor_monas_2": "A look at the older Indonesia. One of the most beautiful buildings in the city. Well preserved. Was closed when I visited.",
  "tripadvisor_monas_3": "a totally complete experience of Indonesia independence history .would suggest to bring kids to Museum BI, on top of that you can do a museum marathon since many museums are around Museum BI (eg: Museum Bank Mandiri, Museum Wayang, etc)",
  "tripadvisor_monas_4": "Located in the heritage building with some good views for taking pictures, we can see the history of money-currency & banking in Indonesia. Very Informative. Only need 1,5-2 hours to round the area. Facility: large parking area, small cafe, renovated toilets, & small merchandise counter.",
  "tripadvisor_monas_5": "If you want to learn about the history of Indonesia currency, this is the place to visit. The self-guided tour has various historical information to offer. Expect to spend about 30 minutes walking around.",
  "tripadvisor_monas_6": "Very inspiring very informative, beautiful decor, cozy place, in this kind of museum you will find up and down of world currency. In my opinion if you go there with family will much fun because you can tell about the history of Indonesia economy. This is a 4 star museum, please visit the museum soon.",
  "tripadvisor_monas_7": "We spent 1 and 1/2 hours and learned so much about the economic collapse of 1997/1998 and how the rupiah went from 2,000 to 16,000 to the USD in a matter of days. Modern, good English displays and a great informational material.",
  "tripadvisor_monas_8": "Love it! the building might look old but they provide you a clean and modern museum to be looked around. They also give you a thorough understanding of the finance system revolution by giving us a history path. It's like you are walking through the time, from the old time to now. And they also have this one room with...More  ",
  "tripadvisor_monas_9": "This museum was byfar the most worth-it museum I visited around the Kota Tua area. One, it gives free entrance for college students (show your student card for evidence). Two, the service was alright. Three, they let you in with your professional cameras while keeping your other belongings safe in their locker area. Four, the place were well air-conditioned. Four,...More  ",
  "tripadvisor_monas_10": "This mueum closes fast by 5pm so plan your day well so you have enough time to visit and see this place. This was a bank in the old days , a Dutch bank headquarters. Amazing architecture, coloured glass, views and very well maintained. There is no entrance fee. It was opened to public as late as 2009 but it...More  ",
  "tripadvisor_monas_11": "The museum itself doesn't look much from the outside (just an old colonial era building) however when you enter the location you will find a collection of pre Bank Indonesia...read more ",
  "tripadvisor_monas_12": "The museum itself doesn't look much from the outside (just an old colonial era building) however when you enter the location you will find a collection of pre Bank Indonesia (central bank) which is in the colonial time until modern day. The collections are very interesting and curated in very interesting way. There was a game to grab virtual coin...More  ",
  "tripadvisor_monas_13": "new modernization of this historic building which describe the history of money, bank, and method of transaction",
  "tripadvisor_monas_14": "When we arrived, the museum was temporarily closed for being full. However, it was re-opened after less than 15 minutes and we managed to get the tickets and entered. The space itself is a beautifully preserved antique building, with old-styled bank counter, wooden furniture, and several colorful stained glass windows. The exhibit was arranged chronologically and highly informative (though not...More  ",
  "tripadvisor_monas_15": "Situated in the center of \"Kota\" the old part of the Jakarta, Museum Bank Indonesia is an interesting place to see. The ancient building itself bring the caracter to the museum. It is modern, very well presented, with rich colection of ancient money from Indonesia and all over the world.",
  "tripadvisor_monas_16": "When Modern meet Old Story it will be awesome! it always be a great mix, you can see so many historic photos, read great stories and awesome old things like typing machines and big (really) bookkeeping. I recommend you to come at 8 am so you can enjoy with peacefully and feel satisfy. We can see a short of video...More  ",
  "tripadvisor_monas_17": "This is a great place in jakarta,,,for u guys,,if u dunno where u have to go in jakarta,better go to kota tua,,in the day u can looking for the museum,so many since from long time ago,And at night its grat place to spend your time with friend or special prend,its really nice at nite,talking or walking or kulinary,its perfect,i...More  ",
  "tripadvisor_monas_18": "The museum impressed us with the organisation and modernity of exhibits. Get there early to avoid school tours and the rush of visitors.",
  "tripadvisor_monas_19": "find out there are some historical story inside this building, the room temperature were good since there is an air conditioner, the place itself is clean and well maintenance, you absolutely need to go to this place :)",
  "tripadvisor_monas_20": "I arrived at the museum at about 3pm so only had 1 hour to your. I recommend about 2 hours to take everything in at a good pace.Overall a great educational experience. You get to learn about Indonesia's banking and link with political history and transition from Dutch and Japanese rule to self governance.There is also a section...More  ",
  "tripadvisor_monas_21": "One of the very few museums in Indonesia that are so well presented, this museum is definitely worth visiting. Apart from the history of the state bank, you will learn considerably of the history of Indonesia from the nicely displayed objects throughout the museum. The beautiful building is well-air conditioned, providing comfort throughout the visit as well as a nice...More  ",
  "tripadvisor_monas_22": "this museum is very interesting, especially for indonesian history loverthe interior is nice and and gives off modern feel",
  "tripadvisor_monas_23": "this museum is very interesting, especially for indonesian history loverthe interior is nice and and gives off modern feel",
  "tripadvisor_monas_24": "This is one of must visit places in Jakarta especially when you take your foreigner friends. Not only this museum is located nearby the famous Museum Fatahila, it also offers wide range of coins and paper money collection from all over the world. In addition, the visitor will learn about the history of Indonesia side by side with the development...More  ",
  "tripadvisor_monas_25": "The building heritage with good maintenance.For muslim traveler we can shalat in mosque in backyard building.Easy to take public transportation.No reastaurant or cafe in building area, so area is clean, if you want to eat or drink, you cross over the street to Taman Fatahillah (one of object traveling)",
  "tripadvisor_monas_26": "This museum took place in the heritage building, a real bank operated in dutch colonial era, so you may feel 1920s ambiance in the main hall, resembling Great Gatsby film for me.The tour starts in the main hall. Previously used as reception area, this museum show graphic and mural of people doing bank transaction, so we may imagine how...More  ",
  "tripadvisor_monas_27": "I think it's one of the modern museum in Jakarta.. Well equipped with AC and screen which will tell you the history of Indonesian money.it's quite dark inside so you maybe want to be careful if you bring children",
  "tripadvisor_monas_28": "You do not often come across a museum with this theme, and that makes this museum special. I enjoyed it, it provides a good overview of banking in the 1930s and also about the history of how this building was constructed. The building is really impressive.",
  "tripadvisor_monas_29": "I had no idea what to expect when I arrived here but found it to be one of the more interesting museums I have been to. The audio guide and displays gave me a great education about a subject I was mostly ignorant about. Plus, where else are they going to let you hold a bar of gold?!",
  "tripadvisor_monas_30": "Bank Indonesia Museum is located in Jakarta, Indonesia. This Museum Bank worth to see. You will find lot of information about old currencies on its display collection, Also collection of currencies around the world.",
  "tripadvisor_monas_31": "When I arrived, there were a lot of visitors lining up to visit the museum; most of them were locals. The museum was quite informative, but most of the information was focused on the local currency and history of the banks in Indonesia. The entrance fee is cheap (only IDR 5000), and if you have a student card, it's free!...More  ",
  "tripadvisor_monas_32": "The place is very comfortable, clean and air conditioner function well.Different from the other museum which have dust in every place in museum, this museum is very maintained and modern..I like this museum.",
  "tripadvisor_monas_33": "Somewhere between Dutch colonial administration and early Indonesian administration, this building was the central (Javanese) bank headquarters.The retail banking interface...read more ",
  "tripadvisor_monas_34": "Somewhere between Dutch colonial administration and early Indonesian administration, this building was the central (Javanese) bank headquarters.The retail banking interface (e.g. counters for depositors) you can see at the start of the (paid) museum exhibit, with the added modern comfort of air-conditioning. Behind that are exhibits explaining Indonesia's currency & monetary system from Dutch administration to the 2000s. By...More  ",
  "tripadvisor_monas_35": "The best museum on Jakarta old city, free to enter and offers hostory of economic and monetary history of Indonesia. Previously a Dutch De Javasche Bank building, it now offers european architecture taste in jakarta. The museum is air-conditioned and offer a modern-style architecture muslim-prayer building in the back",
  "tripadvisor_monas_36": "The Museum Bank Indonesia is an excellent museum in the head office of the bank which traces its past to colonial days to the present.It was quite different to what I was expecting - which was just a focus on the history of money in Indonesia. It looked at Indonesia's history and its effect on money - the effect...More  ",
  "tripadvisor_monas_37": "This museum is absolutely the best. The restored Dutch building looks beautifully smooth and new. The air conditioning is really good and chilly for the hot Jakarta, and the exhibits are exquisite. Very good planning of the positioning and the exhibits are beautiful.",
  "tripadvisor_monas_38": "Good museum that mixes the political, social, and cultural history of Indonesia with the monetary and commercial history. As Jakarta has limited good sites, this ranks quite high.",
  "tripadvisor_monas_39": "I've lived a few years in Jakarta and I'm familiar with Indonesian culture. For this reason, It was interesting for me to visit this Museum which can help for a better understanding of the country.",
  "tripadvisor_monas_40": "cheap, easy to reach, comfortable, and super interesting! it also locates near kota tua and you can visit this before going around kota tua.",
  "tripadvisor_monas_41": "Most of the rooms and chambers are equipped with air conditioner. The building is its biggest and main collection of this museum. The museum always clean and maintained. Very enjoyable.",
  "tripadvisor_monas_42": "The Museum of the Bank of Indonesia is intend to help educate the public about the role that the bank plays in the Indonesian economy. The Bank was first established by the Dutch authorities as a circualtion bank for the Dutch East Indies in the early 19th century. The Bank first issued its rupiah currency under Japanese occupation in 1944;...More  ",
  "tripadvisor_monas_43": "The museum was well organised and had good modern presentation. But the contents were restricted to the history of central banking in Indonesia. It doesnt even talk about the common man's perspective of banking. i.e. When was credit card introduced, ATM etc. So that got a little boring unless you are really keen to learn about the macro finances of...More  ",
  "tripadvisor_monas_44": "Government should be concern with museum.The museum should be have a good management to caring all historical stuffs inside. ;)",
  "tripadvisor_monas_45": "Government should be concern with museum.The museum should be have a good management to caring all historical stuffs inside. ;)",
  "tripadvisor_monas_46": "I was running out of rainy day places to visit but was presently surprised by this we'll run informative museum.It sound not be last on your list but you need a little understanding of the country's history to get the most from your visit",
  "tripadvisor_monas_47": "that was a very complete museum that describe the history of money in Indonesia, and had a lot of samples of all money that used to use by Indonesian community. kids have a lot of fun to see all of that things. maybe they can make another videos that can make kids or visitors more interest.",
  "tripadvisor_monas_48": "Although we failed to see the museum collection itself (we arrived just before closing on a Friday noon), we were most impressed by the architecture of the lobby area, including its historic Dutch stained glass.",
  "tripadvisor_monas_49": "Quite a good maintained museum, but I don't know why i still found funky smells on the gold chamber. They have good collection of money around the world, and Indonesia itself. Quite comfortable for old museum. Overall, quite impresive",
  "tripadvisor_monas_50": "Good place to be observed in weekend and teach your children about money and it's history and also refresh our mind from daily routine",
  "tripadvisor_monas_51": "The places is quite good, all rooms have the aircon and it is more modernized than the other museum. When you visited the website, it is stated that the visitor have to make a requesment letter first, but actually you may visit without it.The museum are filled with the world and indonesia financial history, money currency from many countries,...More  ",
  "tripadvisor_monas_52": "This is a 5-star museum in Jakarta and a must-visit one. As you can learn from its name, this is a museum about money, especially the history of money and economy in Indonesia.If you come in group and with appointment, you can enter for free. If you are go-show, then you'll have to buy the ticket which is very...More  ",
  "tripadvisor_monas_53": "This is my second experience visiting Museum Bank Indonesia, this museum Well Maintenance, and have good collection . We have to paid Rp 5000,- for entrance fee I think its really worth it . The building clean and have colonial architecture . We can see the old furniture and money time to time in Indonesia .",
  "tripadvisor_monas_54": "This is an excellent museum to learn some of the history of banking in Indonesia and even some of the general history of the country. At first, I thought this wouldn't be a great visit because when we got there no one seemed interested in giving us directions or telling us where to start. But once we figured it out,...More  ",
  "tripadvisor_monas_55": "Located in Jakarta Old Town.Beautiful building and very well organised.Thumbs up.I am really proud of this museum!",
  "tripadvisor_monas_56": "Visited here in the year 2009. If you want to know history about Indonesia, especially Jakarta trading in the former time, here is good place to go.Also you can find a that the building was build some hundred years ago and still in good condition. That you can find the architecture is good.",
  "tripadvisor_monas_57": "I had not heard about this museum before but was informed about it by my son who went here on a school field trip.The museum is housed in an old colonial-era building and its history is well-described and fascinating. Especially for Dutch people visiting Jakarta, this is a must-see attraction as they will recognise many words and terms.The...More  ",
  "tripadvisor_monas_58": "as a customer of one of the largest Bank in Indonesia, we were entertained on a fine day to visit this Central Bank Museum. this old and historical building is situated at the Old Town of Jakarta and very well located across the Railway Central Station as well.They exhibit the old days Banking operation and some valuables items that...More  ",
  "tripadvisor_monas_59": "Located in Jakarta Old Town.Beautiful building and very well organised.Thumbs up.I am really proud of this museum!",
  "tripadvisor_monas_60": "why i told u its one of the best museum? because it is! and if you like classical architecture, this building is perfect!",
  "tripadvisor_monas_61": "You can learn about the history of Indonesia trough the history of bank system.The museum's exhibitions are comparable with the best you can find around the world and are very well organized. The historical aspect of the building is surprisingly well maintained, while including interesting modern features. The Numismatic Collections displays are excellent - both the way that are exposed...More  ",
  "tripadvisor_monas_62": "Very nice concept, design, dioramas, and also the flow. Reading all the dioramas, you would know anything about bank indonesia and also history of money itself in Indonesia. Situated right next to Transjakarta and Stasiun Kota Train station, make this museum very reachable. They also have very spacious parking lot and quite big masjid behind the main building",
  "tripadvisor_monas_63": "Beautiful old colonial building very well restored with lovely historical features kept inside and out. Well worth a visit loads of explanations and exhibits on Indonesian financial system and political timeline.We visited on a walking tour so had a guide explaining things but you could do this with the written information on your own.",
  "tripadvisor_monas_64": "I always recommend people to visit hereJakarta is located in the old city and occupies a former hospital building era of the Dutch East Indiesthe contents of an interesting museum , combines modern elements so that visitors linger exploreopen Tuesday - Sunday from 9 am to 3 pm with ticket prices are cheap",
  "tripadvisor_monas_65": "I have been there with my girlfriend during a long holiday. I think this is the best museum in Indonesia. Very attractive, a lot of information, good category arrangement so people can feel so real when you get inside every category area. Amazing and memorable museum in Indonesia that i very recommend for every local and international tourist. Visit Indonesia....More  ",
  "tripadvisor_monas_66": "It's a must go place if you go to Kota Tua. Beautiful architecture, full of historic value. Please pay a visit here.",
  "tripadvisor_monas_67": "Lovely museum. Lots of detail on the independent development ofIndonesia and the financial system. Well laid out and English descriptions are well written.",
  "tripadvisor_monas_68": "Well designed museum in Kota. The exhibits have information in English & Bahasa and there's a good post-Independence history of the Indonesian economy one can learn going through the museum. Great collection of banknotes from around the world and a cool building as well",
  "tripadvisor_monas_69": "It's a must go place if you go to Kota Tua. Beautiful architecture, full of historic value. Please pay a visit here.",
  "tripadvisor_monas_70": "I enjoyed it. It's quiet cheap and it gives a good picture of Helps Indonesia's history. Including recent history. You understand the difficulties Indonesia face for decades with Rupiah devaluation.I found it objective.",
  "tripadvisor_monas_71": "Worth a visit if you have time. Managed to get in 20mins before they closed and saw everything (quickly). Very interesting to learn some of Indonesia's rich history.",
  "tripadvisor_monas_72": "My friend the owner of the packer lodge Pak Ardy brought me here together with another Portugal friend. This museum is one of the best i have visited throughout Asia. Unfortunately we are bit rushing on that particular day as the museum closed at 3.30pm instead of 4pm. The entrance fees is cheap as well. This place is a good...More  ",
  "tripadvisor_monas_73": "A beautiful building well maintained that houses an excellent exhibition about the history of money in the Dutch East Indies as well as modern Indonesia. The exhibit is chronological and easy to follow, information was in English as well as Bahasa, guides were available for questions, and the building itself is beautiful. I enjoyed it.",
  "tripadvisor_monas_74": "(+)You can learn a lot on the history of money and trade and how it comes to inflation.(-)Not all texts are available in English. The museum is not suitable for wheelchairs. I didnot see any toilets.",
  "tripadvisor_monas_75": "The Bank Sentral Republic Indonesia (\"Bank Indonesia\") is the central bank of Indonesia. Bank Indonesia's history goes back to the days of the Dutch East India Company (VOC), which had a monopoly on the spice trade; more valuable than a gold mine. The Museum Bank Indonesia is a cut above most Indonesian museums. The displays are well presented and you...More  ",
  "tripadvisor_monas_76": "A very cheap exploration to go to jakarta, and very educAting. Only 5000 idr and you got to see mNy things about money, not only indonesians, but foreign currency too",
  "tripadvisor_monas_77": "The building itself and some of its quirks I found quite interesting. They had a unique system of getting the money from the street into the vault. They also had a good...read more ",
  "tripadvisor_monas_78": "i found this musem to be well presented, the way its been renovated means you dont get to see much of the old building and its just narrative throughout the exhibit. i found this was somewhat boring. a little interaction for children but otherwise the young would not be stimulated by this museum. nice building to view from the outside....More  ",
  "tripadvisor_monas_79": "If you're into old buildings and antiques like I do, you'll love this museum. This is the perfect place to take photos because the building is so BEAUTIFUL. However, this place is not a suitable for very active toddlers like my boys (sigh), as they will get bored easily.There is a small mosque at the back of the museum....More  ",
  "tripadvisor_monas_80": "The building itself and some of its quirks I found quite interesting. They had a unique system of getting the money from the street into the vault. They also had a good collection of ancient coinage as well as more recent money. Entrance fees are minimal and it is worth visiting.",
  "tripadvisor_monas_81": "This museum is not only about the history of the central bank of Indonesia but also equipped with fantastic collections on notes and coins from around the world as well as the antique office furniture from De Javaneshe bank period.",
  "tripadvisor_monas_82": "the entrance is no more gratis, but it's worth to pay 5000 IDR.The museum is really interesting about to learn about the past of Indonesian financal problems",
  "tripadvisor_monas_83": "The building, architecture.. everything about this place is physically awesome!Before entering, you must check in your bag. No bags are allowed. :( we had to carry all our stuff without being offered a bag of somewhat.If you are looking to take tour kids, this is the closest you will get to civilization. The newly renovated building is clean...More  ",
  "tripadvisor_monas_84": "Surely the best museum in Jakarta, at least! with the entrance fee of IDR6.000 (can't believe it, its so cheap!) u get to know the history of Indonesia oldest financing & currency system. totally a different kind of perspective when u enter the museum this time. this museum is very well kept and modern too. it's huge, really and don't...More  ",
  "tripadvisor_monas_85": "This museum is newly furnished and so high-tech with interactive displays and full-conditioned. A gem among the other rundown museums in Kota.",
  "tripadvisor_monas_86": "One of the well maintained museum in Jakarta. Very informative regarding the history of Indonesia's economic until current situation.",
  "tripadvisor_monas_87": "History in economic and finance perspective.. Cool museum! Located in Jakarta Old Town, explaining about the history of trade, money, moneter history in Indonesia",
  "tripadvisor_monas_88": "This museum shows the old fashion of banking. There are dolls that act like it. It is great place for kids, so they learn about the stream of money.",
  "tripadvisor_monas_89": "This museum shows the old fashion of banking. There are dolls that act like it. It is great place for kids, so they learn about the stream of money.",
  "tripadvisor_monas_90": "you can take your children to this museum, it's very comfortable place to study about Indonesian economic history and the making of money. your children will love it. unfortunately the cinema where we can touch money in were closed. but this museum has a lot of collection of indonesian money and also other countries currency.",
  "tripadvisor_monas_91": "One of the better museums of Jakarta in a very nice building. It starts with a short overview of the history of Indonesia. The museum explains the history of payment systems and the role of politics in financial and economic sector. The presentation is a good level and can compete with western museums. Dont forget to look at the architecture...More  ",
  "tripadvisor_monas_92": "Sure one of the best Museum here in Jakarta. Some of the contents is interesting like about Indonesian economic history. The entrance fee is ridiculous (Rp 5000) and it should be increased in order to keep better maintenance of this place that at the end still remain one of the best in all Jakarta. The building is nice.The presentation...More  ",
  "tripadvisor_monas_93": "I am quite often bored by musea, but this museum is a positive exception to that rule. The museum shows the history of the payment system in Indonesia and teaches one also about concepts of crisis, hyperinflation and the role of politics and the financial sector in Indonesia. Museum is very affordable and has AC and clear routing.",
  "tripadvisor_monas_94": "The museum is very well organised, almost as you would experience in a western country. The museum explains in a good way the history of money in Indonesia. The building it self is also worth while.",
  "tripadvisor_monas_95": "The bulding is very interesting (the characteristics of an old Dutch bank are very well kept) and full of curious detaills. The exhibition is very well organised, especially the part about Indonesian history",
  "tripadvisor_monas_96": "Some of the contents there were interesting, like the collection of money from various countries and from different years. Of course there won't be explanation of how fiat currencies come to be and how banking system in general works. I think It would be nice just for school children for their study tour.",
  "tripadvisor_monas_97": "I just think that if the place was handled better it could be one of the best museum in Jakarta. The cleanliness and the comfort of this place should be increased. Overall it is a nice place, though feel a bit spooky.",
  "tripadvisor_monas_98": "The surroundings are very dirty even though the PemKot is already trying hard to revamp the whole are into a nice city walk. But again, visitors (mainly local) should have more awareness towards the cleanliness of the areas in Kota Tua. That way, hopefully this area could be the icon for Jakarta with clean and convenient surroundings.",
  "tripadvisor_monas_99": "I admire the building structure. So classic and colonial. Here, we can learn history about Indonesia Bank (BI) and the money that was used in Indonesia since the Islamic Kingdom...read more ",
  "tripadvisor_monas_100": "I'm a veteran of many money and banking museums world wide, so finding this was the number one attraction in Jakarta was exciting (even if you do find that strange..). Sadly it was a huge disappointment. Sure there are lots of display items and dioramas. There's lots of flashing lights, flat screens and random videos, but there is little cohesive...More  ",
  "tripadvisor_monas_101": "I admire the building structure. So classic and colonial. Here, we can learn history about Indonesia Bank (BI) and the money that was used in Indonesia since the Islamic Kingdom Era.",
  "tripadvisor_monas_102": "A place to learn about Indonesian economic history in interesting way.It is in old Jakarta kota area. Understand it was free for visitors, but recently they introduced a charge of Rp 5,000/- ( which is less than USD 0.5 cent) for entry.",
  "tripadvisor_monas_103": "I am not such enthusiastic of this museum as I can read from the comments! The building is beatiful indeed and you can find a lot of information about the economic history of Indonesia. Some of the signs are illegible though and not well illuminated. I could not find anything special to be excited about.",
  "tripadvisor_monas_104": "Really enjoyed this very nice museum. Beautiful building and very well organised.Recommended also for children as the museum has many interesting areas and a very good way of displaying historic events.",
  "tripadvisor_monas_105": "In here you can learn all about money. From the history, what money is made off and also the process. You can also see many foreign currency here. This place is perfect for families to visit.",
  "tripadvisor_monas_106": "Definitely one of the must-visit, most informative and very well maintained museums in Jakarta. So you must visit this museum if you are into Indonesian history, and economic history of Indonesia.The description is well presented in both English and Indonesian. Exhibits are well-established and entrance ticket is extremely cheap (only Rp 5000).",
  "tripadvisor_monas_107": "Even if you're not into economic history, the inside of this colonial building is worth a visit. But actually, the museum is well made. There are English info texts and it is interestingly constructed with lighting, different displays etc.. this way it is also enjoyable for children. the content is slightly nerdy: From a general economic history of the spice...More  ",
  "tripadvisor_monas_108": "I went out for Kota tua and passed at the Bank Museum. This is the official Bank Museum while just next door, there is the mandiri bank museum with an exhibition of the colonial period. The official Bank Museum focus on the period of the last 70 years of independance. The highlight for me was clearly the explanation of the...More  ",
  "tripadvisor_monas_109": "just like another museum in Jakarta where it has poor maintenance and no clear concept of what to be displayed nor what the historic value or significant of the exhibit.The plus point is the holographic room where you could try to catch coins and bank notes to open a virtual explanation of the mint or the notes release. The...More  ",
  "tripadvisor_monas_110": "This place was a great reference resource of history of Indonesia. They have a wide selection of art, figurines, and all you can imagine. I went with a friend and we had a great...read more ",
  "tripadvisor_monas_111": "Indonesia bank museum is a economic museum of Indonesia. I think there are many things which learn about Indonesia history and economy. Because Walking tour guide explain that meaning of bank museum, I can understand more easy about Indonesia economy.",
  "tripadvisor_monas_112": "This Museum now feel very nice.. Good Improvement, since i visited last time. Now is very attractive with all TV/LCD. Now they charge 5000 Rupiah for one person. And for information there are no bag allowed to bring inside the Museum. They provide the place for keep our stuff in front of the entrance. Here we can see so many...More  ",
  "tripadvisor_monas_113": "This place was a great reference resource of history of Indonesia. They have a wide selection of art, figurines, and all you can imagine. I went with a friend and we had a great time and learned quite a bit about the history. You should get the audio helpers to listen and help you in your tour.",
  "tripadvisor_monas_114": "We really liked the museum since it gives a very interesting and detailed description of Indonesia's economic history from 18th (and before) until today. It is a good intro to your visit in Jakarta and Kota area.",
  "tripadvisor_monas_115": "Nice museum located in awesome Dutch-era building which was HQ for Dutch Indies central bank the Javasche Bank, built in the 1930s. Excellent modern displays with full interactivity, very interesting displays on history of Indonesian economy from pre-colonial era to post-Reformation era. The collection of old money is especially interesting. All for very cheap entry fee of IDR 5,000",
  "tripadvisor_monas_116": "Excellent museum. Nominal charge of IDR 5000 to enter. It has been maintained so well. Walk through Indonesia's past starting from the days of colonization all the way to its independence and formation of its own bank and currency.Hosts a display of currency from almost every country in the world from the mid 1900s.The displays, lighting and sound...More  ",
  "tripadvisor_monas_117": "You don't normally expect to see good and interesting museums in Jakarta. Jakarta is known more for its numerous poshy malls, pollution, chaos and bad traffic. But this museum of Central Bank of Indonesia slowly changes the image of the city. It is an absolute gem....you can find so many information about the history of the birth of Indonesian currency...More  ",
  "tripadvisor_monas_118": "We have no high expectation when we visited this place last year but it turn out that this place was awesome. This is a good place for everyone to learn about Indonesian currency and more especially their history. The entry fee is reasonable but the location is a bit hard for us to find and it is difficult to get...More  ",
  "tripadvisor_monas_119": "Modern museum with an exhibition of the rupiah/monetary system of Indonesia including historic events related to the currency. Entrance fee is 5.000 rupiah (€ ~0.35) and free for students. Staff is friendly Exhibition is interesting to see with a good combination of text (Indonesian  English) and relics.",
  "tripadvisor_monas_120": "Educational yet fun. Complete collection of Indonesian monetary history. Huge and clean. Staff are ready to help explaning. Antique building, well taken care of. Recommended for everyone.",
  "tripadvisor_monas_121": "The Museum surprised me. Even though the subject is not very interesting, the museum made it interesting. Very well maintained and worth a visit. Also nice for the little ones!",
  "tripadvisor_monas_122": "The Museum surprised me. Even though the subject is not very interesting, the museum made it interesting. Very well maintained and worth a visit. Also nice for the little ones!",
  "tripadvisor_monas_123": "To understand local currency history.. you need to go here to have more deeper understanding for the history of rupiah..",
  "tripadvisor_monas_124": "This museum located near the fatahillah square. The entrance fee is 5k for local adult and free for student. In the inside you could see the history of bank indonesia and the economy of indonesia itself. For me, i like the collection of money in here. And the museum is really modern that i feel the entrance fee is too...More  ",
  "tripadvisor_monas_125": "We can learn different money and currency use in different periods in Indonesia. It is professionally managed like museum in other countries, yet the entrance fee is very cheap. The building is also very beautiful. There are train station (Jakarta Kota) and trans Jakarta bus stop right in front of the museum. During ordinary day, better take busway or commuter...More  ",
  "tripadvisor_monas_126": "I love the Bank Indonesia Museum in Jakarta. It was so informative and very cheap. You'll learn all about the history of Indonesia's currency as well as the economical situation in the last 50 years. It was a good destination in Jakarta. A must see!",
  "tripadvisor_monas_127": "you can play catch the money, it was projected on screen from lcd projector. you can see the layout of longtimeago bank, like when i was a kid in 70s. with old calculator/ manual. typewriter, oldtime cheque, vault/ brankast.",
  "tripadvisor_monas_128": "Nice dutch buiding with some information on the finantial and bank history of Indonesia. The staff is good, but the museum is just average",
  "tripadvisor_monas_129": "Bring your camera with you and make sure arrive before 3 pm. the descriptions are both English and Indonesia so don't worry. If possible, ask Indonesian friend to company you. the museum itself is harmless but you need to be careful when walking through the surrounding area.",
  "tripadvisor_monas_130": "We enjoyed the museum. Descriptions are in English and tells a good story of the history and economic development of Indonesia as well as the creation of Bank Indonesia as a central bank.Good collection of currencies and some multimedia (screen viewing) exhibits.You must check in all bags, including small handbags, so please be ready to carry wallet, sunglasses...More  ",
  "tripadvisor_monas_131": "It's been honoured the best museum in Jakarta for 3 years in a row. Once you go in, you'll see why.It displays the history of Jakarta and Indonesia since the traditional tradings era until the post-econont crisis in 1998.The grand building itself has a lot of stories to tell and really good for pictures. A must visit when...More  ",
  "tripadvisor_monas_132": "in Museum Bank Indonesia you can not only see about various money from Indonesia and all over the world but you can see the building from old times. If you go to center of this...read more ",
  "tripadvisor_monas_133": "in Museum Bank Indonesia you can not only see about various money from Indonesia and all over the world but you can see the building from old times. If you go to center of this building, you will find big places inside the building like most of building in Europe. Its really amazing.",
  "tripadvisor_monas_134": "you can enter for free, and you can take a look how indonesian financial, started from the beginning of colonial's era to the crisis tragedy between 1997-1998.i think this is the best museum i've ever visited in Jakarta.",
  "tripadvisor_monas_135": "The location is right in the old city area of Jakarta where old buildings still well preserve. The museum is taken care of Bank Indonesia, the central bank of Indonesia. With great source of fund, no wonder the facility is equally the best. We can study the history of Indonesi'a currency and Bank Indonesia itself via displays and dioramas, play...More  ",
  "tripadvisor_monas_136": "Interesting history of Indonesia's trade and currency. History of the spice trade, the change from colonial to indigenous control and the currency fluctuations and high inflation during the early years of independence. The building itself is one of the few well preserved buildings from the colonial period.",
  "tripadvisor_monas_137": "If you want to know about the history of money and how they played thier role in Indonesia and the world, you must visit this Museum. The museum is so outstanding ambience and layout and they had whole bigger picture to present to you, not just a show case. Ask your kids along with you since they will love ad...More  ",
  "tripadvisor_monas_138": "This museum is conveniently close to the attractions (such as they are) of Fatahillah Square and we spied it on our walk around the vicinity. Crossing the road to get there was an adventure (as it is everywhere in Jakarta: step into the traffic, extend your hand towards the oncoming traffic and stride confidently across the road! :-)Entrance was...More  ",
  "tripadvisor_monas_139": "Even as somebody with a finance background, I spun through this museum in about 15 minutes. I don't think it was worth my time, and I would definitely not bring my kids ...",
  "tripadvisor_monas_140": "This is the first time I have visited a Bank museum and I find it very engaging. Museum Bank Indonesia tells you the role of the Central Bank in the history of Indonesia during the Dutch colonial days.Entrance to the museum is free. It has a extensive display of bank notes and coins from all over the world.At...More  ",
  "tripadvisor_monas_141": "More than just a museum on banking, it also provides the historical context of pre- and post-colonial Indonesia. I learned a lot about the economy, both past and current. It is also, per my hosts, one of the nicest, most comfortable and visitor friendly museums in Jakarta.",
  "tripadvisor_monas_142": "This museum is a little gem behind it's seemingly boring name. It only costs 5000rp per person. It is modern and has some interesting facts about the history of Jakarta and it's origin as a spice source for the rest if the world. It progressively takes you through it's monetary history to the modern era. The glimpse of the inside...More  ",
  "tripadvisor_monas_143": "Definitely one of the best museums in the whole of Indonesia. Finally one that also explain things in english language!Just wanted to inform that since the beginning of June...read more ",
  "tripadvisor_monas_144": "This museum is clean, free of charge with helpful staff. You can find many historical information of Indonesia. It is quite well-maintained, which is surprise for a museum here. It is worth a visit one in a life time.",
  "tripadvisor_monas_145": "Definitely one of the best museums in the whole of Indonesia. Finally one that also explain things in english language!Just wanted to inform that since the beginning of June 15 there is a small entry of 5k.",
  "tripadvisor_monas_146": "Jakarta?Do you know this city have a lot of history un-told?If you like history and wanna know how about Jakarta in old century you should come here. From here you can know how Jakarata developing followed by evolution of money. So if you come here, you might know history about money and how Jakarta city developing.",
  "tripadvisor_monas_147": "I want to recommend you to visit this museum because it is so cool and nice. Not only because its museum but also its exhibition inside, building, and collections display. Moreover, it is free to visit. It is near Kota Station and Taman Fatahillah.",
  "tripadvisor_monas_148": "it's free but it is beyond my expectation! very well- maintained, lots of great explanations and medias... I think they should charge some fees because it's too good. do not miss it!they have lockers, very near to the bus/ train stations. even a cafe is located at the back.",
  "tripadvisor_monas_149": "1) The building in here is very nice, if you like to take photos, there is a very good place to take.2) you can find out the history of Indonesia, and very organise to put the stories in here, feels like you go to the time tunnel3) The museum they close Sunday and Public Holidays, so please check...More  ",
  "tripadvisor_monas_150": "Entry fee Rp 5000.Simple collection.few outfits, old currency, some old furniture lots of ahdiovisual displays. 1 hr visit.",
  "tripadvisor_monas_151": "not informative enough since the informations are too formal . Should be more fancy. I only visit once.",
  "tripadvisor_monas_152": "free of charge, historical. A short runaway from the hot weather. friendly staff, get to see money of many countries and also the evolution of Indonesia money",
  "tripadvisor_monas_153": "For a very well preserved and maintained museum, I didn't expect the free entrance when I first came here.This museum basically tells you about banking, finance, and money history in Indonesia. They have a room in which they keep old Indonesian money since Dutch era. I think that's the most interesting room of all.One thing that I think...More  ",
  "tripadvisor_monas_154": "The best museum in Indonesia, very modern with contemporary art design. Enter for free (or cheap tickets). Wonderful collections and displays. The building architecture is good...read more ",
  "tripadvisor_monas_155": "I have been to Museum Bank Indonesia for two times now. This place has been the first museum I visited since I graduated from grade 6 :) lol (but true!). I have not been impressed with museum since I was a kid, due to the fact that they are mostly no more than a place where they store stuff, dusty....More  ",
  "tripadvisor_monas_156": "Amazed by the museum! Best museum in Indonesia by far as well as Ullen Sentalu in Yogyakarta. Ticket entrance is free.The building architecture is great, the museum contents wowed me many times. Better coming before 4 pm so you'll get a chance to enjoy the museum not in a rush due to closing time.",
  "tripadvisor_monas_157": "Was born and raised in Jakarta doesn't mean I know everything about my country, last Saturday I felt like doing nothing but museum trips in Jakarta, I was quite surprised but happy to know Jakarta has a good museums to visit. Museum Bank Indonesia is the one option. To know about banker perspective this museum really good to visit. And...More  ",
  "tripadvisor_monas_158": "The best museum in Indonesia, very modern with contemporary art design. Enter for free (or cheap tickets). Wonderful collections and displays. The building architecture is good aswell. Definitely must visit.",
  "tripadvisor_monas_159": "This museum is one of the better ones in Jakarta but it still doesnt mean its food. The building is nice but aside from that there is not much to see or do. Wouldnt go again and only recommend if you really dont have much to do in Jakarta and need to kill some time.",
  "tripadvisor_monas_160": "I visited there too early in the morning after the museum opened the gate.just short walk from kota's train station...its free...but too empty because it's just 8.30/in the morning...my kids not happy...because it's a kind of spooky?? Didnt know...but we just walk room by room fastly.....hahaha....",
  "tripadvisor_monas_161": "The museum tells the history of Indonesia in the perspective of a banker or economist. It is great for college students majoring in economics and human sciences.The museum is the top choice for a museum in Indonesia and it's very well kept.",
  "tripadvisor_monas_162": "I was surprised that we were not required to pay at all to enter this museum. It has a lot of helpful crew at the entrance. The museum itself was a colonial building which is very interesting to see. You can learn about Indonesian banking and economic history here. We can easily walk from the train station to reach this...More  ",
  "tripadvisor_monas_163": "The museum tells you the history of the monetary system and the national bank, while it describes the entire modern Indonesian history, and how they became the actual independent country.",
  "tripadvisor_monas_164": "I do not understand why others give this museum a great review. It has an odd collection of bank articles and machines, arrayed in random order, and without any decent signage. Oh and not a docent to be found, ever. So there you are, clueless, and pretty much wandering freely through what could be an amazing museum, but isn't. So...More  ",
  "tripadvisor_monas_165": "This is one of the places you can do in half an hour and combine with other places in Kota.So in itself it is not a place you should make a huge detour for. But if you plan to...read more ",
  "tripadvisor_monas_166": "This is one of the places you can do in half an hour and combine with other places in Kota.So in itself it is not a place you should make a huge detour for. But if you plan to visit the Old Batavia area, definitely do include this building. I always take visitors and the place still has this...More  ",
  "tripadvisor_monas_167": "i love this museum especially the building.. beautiful so thats why ive been here 7 times and never get bored.. in here you can learn bout indonesian money, indonesia monetary condition. they have lots of story bout indonesia money condition and theres a room where they collected money from all over the worldits cold inside and the building is...More  ",
  "tripadvisor_monas_168": "VERY interesting! Historicly and a must see, when you are in the old city. It actually consists of 2 big separated buildings, that are both interesting , each of them in their own special ways.",
  "tripadvisor_monas_169": "Don't be fooled by the name of this museum as it is not solely about the central bank or the Indonesian financial institutions. It also contains the information regarding the country's struggle against colonialism. I particularly like the section where you can check out the past and present notes of other countries. Also, the building itself is quite well-maintained. If...More  ",
  "tripadvisor_monas_170": "i love this museum where you you can see and listen to the history was very great and wonderful place you can see statues",
  "tripadvisor_monas_171": "through its collection of bank notes and coins from the various periods of the archipelago's history, the museum is an invaluable mean of learning about the history of Indonesia for the past 3 centuries",
  "tripadvisor_monas_172": "Teased by a TV show about this place, I went there sometime last December and turned out to be such a good decision to make. Very well maintained museum, which is rare in Indonesia, this museum tells a lot about a bit of historical puzzle during colonial era of East Indies. A must visit place. Now I have more places...More  ",
  "tripadvisor_monas_173": "The collections are really complete, start from ATM machines, calculators, money, stamps, everything! It's a great place to study, taking photos, or just walking around. Bring your kids along, they'll love it!",
  "tripadvisor_monas_174": "Fantastic bits of history of Jakarta - great internal displays and some original furniture still inside.",
  "tripadvisor_monas_175": "I was hesitant to visit based on the name of the museum, but was pleasantly surprised, and loved learning more of the history of Indonesia. Very nice.",
  "tripadvisor_monas_176": "This is a well done museum in Jakarta. It is located nearby Kota Tua, parking might be a challenge but the display and lighting is very well done.",
  "tripadvisor_monas_177": "This is a well done museum in Jakarta. It is located nearby Kota Tua, parking might be a challenge but the display and lighting is very well done.",
  "tripadvisor_monas_178": "Alright to visit, beautiful colonial architecture. Quite a lot to visit but gets really really busy during peak hours. Good visit",
  "tripadvisor_monas_179": "Fine and unique placeI went there in dec 31st Dec night ....the place is full with crowed ....all are waiting for 12 mid night to welcome the new year with Jakarta style. Horns all around..but well behaivor. No body disturbing each other....with such a massively packed area .....hats off to the indosMust visit place . here got hindu...More  ",
  "tripadvisor_monas_180": "A big great museum, old beautiful building ....You can get many historical information of this big country ...",
  "tripadvisor_monas_181": "At first, i was lil bit skeptical about visiting Indonesian museum. Yes, i am Indonesian and I know that usually Indonesian's museum is not well maintained. And for Museum Bank Indonesia, I have to admit that it's really well maintained . The big and clean building plus a nice interior inside. You'll see the history of money and how Rupiah...More  ",
  "tripadvisor_monas_182": "I thought that visiting this museum would be boring.However,I found I kinda loved it. It remainded me of the economics class I took in college but in a very interesting way. Museum Bank Indonesia gives the visitor a full review about banking history in Indonesia.They have diorama,and also some flat screens giving us various information about banking and a whole...More  ",
  "tripadvisor_monas_183": "One of the best attractions in Jakarta , located at old batavia nice bulding and much to see.If gives a very interesting brief about indonesia banking history moving through it's history and analyzing the finical crisis the economy faced and how it was dealed with.I hope only if there were more chairs for rest as the museum is...More  ",
  "tripadvisor_monas_184": "For me it is the best museum in town, they provide modern tools to displaying objects of the museum, nice decoration made us really into the museum.",
  "tripadvisor_monas_185": "The museum is quite big and there is a lot u can see !If u like historical place, i think this place is nice.U can take a lot of picture in there, don't forget to bring your camera!I will definitely go back there again -- especially because i went there in the afternoon and the museum were...More  ",
  "tripadvisor_monas_186": "This Museum based in the old headquarters of the Bank of Indonesia provides an informative overview of the history of the financial system of Indonesia set against a background of colonisation, war, revolution and financial meltdown, It also has an extraordinary collection of international coins and paper money.",
  "tripadvisor_monas_187": "Museum Bank Indonesia is one of the best museums I've been to. Collections are preserved well. Displays are very informative.",
  "tripadvisor_monas_188": "Museum Bank Indonesia is one of the best museums I've been to. Collections are preserved well. Displays are very informative.",
  "tripadvisor_monas_189": "Accidentally got a tuktuk here and was pleasantly surprised. Free entry and coat minding. Not everything is in English and is not in chronological order which was disappointing but overall a well curated interesting museum. Not sure how kid friendly but worth a visit if you're in old town.",
  "tripadvisor_monas_190": "Well maintain museum, there a lot of things we can see. Very clean, very nice crew. One of best museum i guess",
  "tripadvisor_monas_191": "This is one of a must visit museum in Jakarta. Very well organized and managed. Excellent maintenance. Modern and provide the history sistematically from time to time about money and economy journey in Indonesia.",
  "tripadvisor_monas_192": "In the Old jakarta there are many museums. One of the best kept maintained and organised is the BI Museum.It has two floors with different galleries and fortunately there is adequate English language explanation and thread. That makes it really inteesting!The museum has several themes but I found the history of Indonesia finance organisation intersting including the candid...More  ",
  "tripadvisor_monas_193": "Museum is portraying a very honest and clear history of the raise and fall of Indonesian economy. Clean, modern and shows the development scenario. The center of attraction is the Bank chest with old coins and notes from countries across the globe. I found some of olden days Indian Rupees that I have never seen in my life in India....More  ",
  "tripadvisor_monas_194": "Weird museum about the main banks history, which in hindsight made a lot of sense with Bstavia/Jakarta being a large trading hub. Wasn't most exciting, if could read Baha I'm sure you'd get more out of it. Interesting but don't rush to it.",
  "tripadvisor_monas_195": "its easy to catch there. you can go with transjakarta or KRL (electric train). near from Stasiun Kota (Central City Station), just need to cross the road. you can get alot of fun inside, unique building with old style and sometimes they have special events there.enjoy jakarta!",
  "tripadvisor_monas_196": "Interesting place for persons who interesting in financial aspects of Indonesia, the history of coins and financial country development. Worth seeing to know better about Indonesia and how the country start growing.",
  "tripadvisor_monas_197": "I was not very exited about it but it was really good! It has a lot of information, it is well built and orginized. Recommended",
  "tripadvisor_monas_198": "This museum is free and definitely worth a look if you are in the area. The old building is great in itself. The old interior of the bank is very cool. The exhibits are varied...read more ",
  "tripadvisor_monas_199": "I was surprised that I didn't have to pay for the entry ticket, alias it's free. I must admit that this is the best museum in Jakarta, compared to other museums in this region. I'm amazed with the facilities that this place offer, for example: Building with full AC and direction signs to help us in the museum. Enjoy!",
  "tripadvisor_monas_200": "This museum is free and definitely worth a look if you are in the area. The old building is great in itself. The old interior of the bank is very cool. The exhibits are varied, and some are more interesting than others. It's well laid out and there is English translations for most of the exhibits.",
  "tripadvisor_monas_201": "Unlike what Lonely Planet says, this is not a history museum \"loosely based\" on currency and trade, it's pretty specifically about the history of currency and the central bank. That said, it's well-designed, with plenty of English signage, and steps you through some of Indonesia's key fiscal changes in a way that manages to be engaging even though the subject...More  ",
  "tripadvisor_monas_202": "We enjoyed this museum. The fact that it could have beem more professionally laid out, and the physical state of the interior, just adds to the charm in my opinion. Obviously laced with propoganda, but very interesting.",
  "tripadvisor_monas_203": "well maintained and very clean.a good choice to bring your kids/ expat friends to visit & discover the history on Indonesia bank notes, etc.",
  "tripadvisor_monas_204": "This is sow much better than the average museum in Jakarta. There is much to read and they did a great job on creating a modern experience. On your way out, just before exiting be sure to step inside the hallway to the \"directeurs\" office and walk left to the end to find the little bar/restaurant.",
  "tripadvisor_monas_205": "A nice take on Indonesian museum. I did not expect the museum to be this modern, as this museum incorporated a lot of multi media display, with lighting and sound effect.A very good educational venue to learn on Indonesian monetary system from the age of the kingdoms back on the 7th century, to the monetary crisis on 98.worth...More  ",
  "tripadvisor_monas_206": "The museum was better than i expected. Signs are also in English, which is nice for foreigners. The financial history of Indonesia is explained. Furthermore, the museum has many currencies to see. The building itself is colonial and very beautiful.",
  "tripadvisor_monas_207": "it's spooky and not well maintain. but the building actually a vintage and you could walk around at Jakarta Old city anyway",
  "tripadvisor_monas_208": "It's been years since i was went there. This museum is located near Museum Bank Mandiri. Inside this museum you will find the history of Indonesian money until today and some mannequin that i found rather old. This is the alternative trip to spend a holiday in Jakarta, besides going to the mall.",
  "tripadvisor_monas_209": "This museum is maintained by Bank of Indonesia. The building looks amazing, well maintained, and all exhibition are well arranged.Not like most other museum in Indonesia, museum...read more ",
  "tripadvisor_monas_210": "Although not as comprehensive as the National Museum which is Indonesia's Smithsonian, this is easily the best museum in Kota (assuming the History Museum is still closed for renovations) and one of the best in Indonesia as well as in SE Asia - if you have realistic expectations about museums in SE Asia. The building itself is the restored old...More  ",
  "tripadvisor_monas_211": "one of the best and interactive museum in indonesia. its clean and cozy to walk around inside the museum. clear signage but need to give more explanation about the objects in this museum.",
  "tripadvisor_monas_212": "If you're not Muslim, then you're restricted to entry in some places and they'll hit you up for a donation when you leave. Still, it's worth seeing inside. The outside is dirty, crowded, smelly, and worth avoiding",
  "tripadvisor_monas_213": "I toured this museum. There are lots of video, and things to do. The museum provides a very comprehensive history about Indonesia, the bank as well as historical events that affected the history of this region. I enjoyed the tour. The facility is air conditioned. I was able to tour at my on pace. It was a nice tour. Afterwards,...More  ",
  "tripadvisor_monas_214": "This museum is maintained by Bank of Indonesia. The building looks amazing, well maintained, and all exhibition are well arranged.Not like most other museum in Indonesia, museum Bank Indonesia combine latest technology and old fashion. I felt like visiting museum in the Nteherlands👼This museum is good to be visited with children.Very educated",
  "tripadvisor_monas_215": "I never knew that we have a museum this good in Jakarta. I thought they only display money and such, but they are other things that's related to Indonesian's economic history. You can learn about that here, in a very interesting way. I love how they display everything, so we can experience the history quite well. They even paint the...More  ",
  "tripadvisor_monas_216": "I stopped in not quite sure what to expect and was very glad I did. It had a very interesting set of displays on the history of banking technology and being able to walk through all the old vaults and locked rooms was very neat. It is not often that this type of building is fully accessible, very glad they...More  ",
  "tripadvisor_monas_217": "A good deal of history and exhibits here. Almost all in both English and Bahasa Indonesia. Much of the descriptions alluded to events rather than describing them. Poor lighting throughout much of it. Beautiful old building. Free admission. On site cafe was pleasant; though the food was barely OK.",
  "tripadvisor_monas_218": "We went into the museum out of curiosity - we had never been in a bank museum before. Entry was free, and we were pleasantly surprised. The history of Indonesia was portrayed from the point of view of the banking industry, and it was very well done. An excellent way to spend an hour or two.",
  "tripadvisor_monas_219": "Very interesting museum located a few minutes walk from historical Cafe Batavia.Well restored colonial building and very educational exhibits.Do not miss the room with a large number of old coins some almost 1000 years old. You learn a lot about the history of the country, including the 1998 financial crisis.A must while in Jakarta and to be combined...More  ",
  "tripadvisor_monas_220": "One of must visit museum in Jakarta. Placed in \"Kota Tua\" which you can reach by Busway or another public transportation. You can learn about economy history in Indonesia from...read more ",
  "tripadvisor_monas_221": "The museum is international class..great collection of money from all over the world!amazing building and a very clear explanation of the history of money in indonesia..",
  "tripadvisor_monas_222": "One of must visit museum in Jakarta. Placed in \"Kota Tua\" which you can reach by Busway or another public transportation. You can learn about economy history in Indonesia from this place.The place is quite big and have a lot of things you can seeToo bad, in Indonesia museum is left behind. Now a day, People like Mall...More  ",
  "tripadvisor_monas_223": "This is a surprisingly interesting and well done museum, and its located right next to Taman Fatahillah, where there are plenty of other great things to do so that you can justify the trip by a full day enjoying old Jakarta. The museum is not huge but there's plenty to see. It's both surprising and enlightening how effectively it lays...More  ",
  "tripadvisor_monas_224": "Thanks to Bank of Indonesia who have been doing maintenance of this great architecture building. The museum let us know about the history of bank notes. Very well informed for the visitors. Including the history of the building. A second of must visit museum after the museum of national.",
  "tripadvisor_monas_225": "If you are a foreign traveler and this is your first time visiting Jakarta, you should visit this museum. Placed in Kota, where you will experience Jakarta ambiance when it still mentioned as 'Batavia' hundred years ago.The museum will let you understand how was the economy history and trend in Indonesia since the independence day.",
  "tripadvisor_monas_226": "Really... actually most museum in Jakarta has great content, but little curation, save this one. This reminds me of the mint museum in Washington DC and perhaps it is because many of the Bank Indonesia directors spent lots of their time shuttling to that museum during their visits to the capitol. Multi media and interactivity is the word and I...More  ",
  "tripadvisor_monas_227": "This museum for me just ok. But, if you want other attraction in jakarta, you should visit here..!Entry price is cheap.. but parking area a little bit difficult. The traffic so bad",
  "tripadvisor_monas_228": "The location is very easy to reach by Transjakarta bus or train. We can learn much of Indonesia's bank history. It's free. But you have to report your camera if you want to take any picture in the museum. You can find not only Indonesian money, but also other countries money. It's well managed and complete. The architecture of the...More  ",
  "tripadvisor_monas_229": "This Museum Bank open for free visit. it will you how the Bank in Indonesia work and more detail about Indonesia Bank aswell. Well place to visit .",
  "tripadvisor_monas_230": "Place to learn about history of bank on Indonesia especially Bank Mandiri. Safe deposit, vip room and all about bank history.",
  "tripadvisor_monas_231": "Located on Kota Tua's area, you ll find no difficulties in finding this place. The best place to learn the history of central bank of indonesia; as well as history on indonesian...read more ",
  "tripadvisor_monas_232": "Located on Kota Tua's area, you ll find no difficulties in finding this place. The best place to learn the history of central bank of indonesia; as well as history on indonesian economy. Well management museum, lots of attractive figures, with no entrance fee. Fantastic!",
  "tripadvisor_monas_233": "Must visit museum in Indonesia. Very well organized, useful information about banking history and system in Indonesia. It's closed to old town area so you can walk to near-by attractions eg Puppet museum, Fine art and ceramic museum, etc",
  "tripadvisor_monas_234": "Very Recommended. There is no ticket fee, but the very informatif - from here you also can visit other museum nearby",
  "tripadvisor_monas_235": "I love this museum even though I don't quite like the theme of this museum. This museum tells us about the history of money. However, I should admit that this museum has arranged a display professionally. It is on a par with overseas museum. Aircons are provided in almost every room. The entrance fee is free. They also provide lockers...More  ",
  "tripadvisor_monas_236": "Absolutely, I recommend this museum to all the travelers. Beside it's free entrance, you will amazed by their explanations through diorama, audio visual system, and written explanations one by one each from the collections. You will traveled from the historical colonial age through modern age of Indonesian monetary and financial situation here in one building. Also, do not miss the...More  ",
  "tripadvisor_monas_237": "We visited around 6 museum these days in this crowded city, someones with good intentions but no translations or good information about what are you looking. Bank of Indonesia cover all my expectations about what a museum have to have. People there speaks english (even some words in spanish) so this is good for getting the correct information. The story...More  ",
  "tripadvisor_monas_238": "The museum is a bit dark but the collection is comprehensive. Maybe a little more lighting will help. This is the only museum Ive been that focused on evolution of banking and money so it stands out for me. Admission is free so don't believe the guy at the counter who tried to make me pay. The other guy beside...More  ",
  "tripadvisor_monas_239": "Being a currency notes collector, i was very excited go to this museum. I had a chance to see several old coins and bank notes of Indonesia. I was more surprised when they didnt charge any fee. The place is pretty clean and well maintained.",
  "tripadvisor_monas_240": "Interesting insight on old bank and a very nice and well restored building in the old part of the city",
  "tripadvisor_monas_241": "I've been here many times and I was part of the restoration team. The only problem I have with this museum is that not all the areas are made accessible to the public yet, which is a pity because there are many more treasures to find. But maybe it is better this way so that we are surprised bit by...More  ",
  "tripadvisor_monas_242": "I loved it. It's an educational trip that give value for tourists. When I came there for a business, the Public Relation staff brought me to see the whole area of this museum and...read more ",
  "tripadvisor_monas_243": "Located near Old Batavia, this massive old building is well taken care off. The museum exhibits the history of trade and finance in Indonesia. Good place to visit with school kids",
  "tripadvisor_monas_244": "I went to this museum by train. It is located right at the front of Jakarta Kota Train Station. To get across just walk through the tunnel underground. To get to the tunnel get the left exit from the rail, the stair to underground is at the right side after the station exit.We have to go to the security...More  ",
  "tripadvisor_monas_245": "This is a really good place to visit and what's more, it is free. Their international banknote section is a great idea.",
  "tripadvisor_monas_246": "I loved it. It's an educational trip that give value for tourists. When I came there for a business, the Public Relation staff brought me to see the whole area of this museum and told the story, that was unforgettable moment.",
  "tripadvisor_monas_247": "It's a very good place to visit, especially for teenagers, because there're a lot of things that can be learned here. From Indonesia's economic history, independence financial crisis until now, complete collection of money and collection from other countries. Interior design is very unique. The entrance fee to the museum is free! The location is also very convenient, There are...More  ",
  "tripadvisor_monas_248": "nice and well displayed for indonesian and world money history, need more interactive and off building activities",
  "tripadvisor_monas_249": "Love the antique stuff they had. It's totally a hidden gem since not a lot of local knows its existence. The maintenance of this museum is very good so that when you got here, you always feel comfort.",
  "tripadvisor_monas_250": "As mentioned in the other reviews, the Museum of Bank Indonesia (MBI) is arguably one of the best museums in Jakarta. TCompared to its counterparts within the capital, the museum boasts informative exhibitions and dioramas, interactive displays complemented with optional audio guides. Considering that the museum has no entrance fee, it is definitely worth a visit. Below are the details...More  ",
  "tripadvisor_monas_251": "Been there for a photoshoot so i did not really take notice of what detailed info inside.One thing i can remember they have many collections of old big huge computers and type writers. Quite preserved and clean, worth to visit when you come to Jakarta and craving for histories. They also have many museums nearby, so its a one...More  ",
  "tripadvisor_monas_252": "Nice, well-maintained, super informative museum with good collection arrangement. Well worth the traffic :)",
  "tripadvisor_monas_253": "This was a nice, free, air conditioned museum on the history of banking. Beautiful building architecture. De worth a stop especially if you are in the Kota area.",
  "tripadvisor_monas_254": "This was a nice, free, air conditioned museum on the history of banking. Beautiful building architecture. De worth a stop especially if you are in the Kota area.",
  "tripadvisor_monas_255": "i bring my little brother to see this place. he like it so much and he want me bring him back again.",
  "tripadvisor_monas_256": "The museum occupies the old and charming colonial building that once was a functional bank. It is clean and well-maintained, especially compared to some of the other museum in the precinct. We were in luck that we came in right before the 15 minutes animation screened. The animation was about basic knowledge of trades & money and history of bank...More  ",
  "tripadvisor_monas_257": "It's interesting to go inside an old bank and see the old machinery used, the vaults... They have some mannequins placed around to mimic the old days. The place is not very well maintained though, it's cheap to go in. There is a small cafe you can grab a coffee or some pastries and there was a band playing some...More  ",
  "tripadvisor_monas_258": "This is one of the best museums around! It shows a great financial history of Indonesia and has a nice collection of coins/paper currency used over the years. The signs are all local language  English so it is easy for foreign visitors to appreciate it.Very well done museum and surprisingly free!In addition, be sure to visit the...More  ",
  "tripadvisor_monas_259": "I find many new information from my tour in this building, specially monetary history. The collections were complete!But, I found that many LCD was removed from its place and also turned off. The air conditioner also turned off in several places made the place not comfortable.Very sad, POOR MAINTENANCE.",
  "tripadvisor_monas_260": "Very entertaining museum on the origin of Indonesia money. We could see a huge history about bank of Indonesia. Not only the type of money but also the uniform of the staff. Everything made me so excited.No fee to enter. All of staffs were so great, they could speak English well. You will have a great time and a...More  ",
  "tripadvisor_monas_261": "This is a wonderful and fun Museum. There is no entry fee for this Museum, /At other sites/attractions in Jakarta, One of the things that we \"foreigners\" will get used to in Indonesia, is that there is a 'locals' price of admission and a 'foreigners' price of admission. sometimes, esp if you have local Indonesian friends, they can use their...More  ",
  "tripadvisor_monas_262": "I have always loved museums. At least for me, the existence of museums in a city corresponds well with how cultured the civilization on that particular population really is. Museum should have not only entertaining, but also be a place where transfers of history will transcend the test of time. A place to learn and a place full of important...More  ",
  "tripadvisor_monas_263": "This is probably one of the best and modern museum i've seen in Indonesia, the building itself is also very beautiful. There is no entrance fee which is great and the place is air conditioned! It's like a large time-machine that takes youback to history on how banking, money and spice trades are happening back in colonial times, i could...More  ",
  "tripadvisor_monas_264": "If you are visiting Fatahillah Square (you should), the museum is only about 5 minutes away via a pedestrian only street. The website says it opens at 7:30am but when I turned up...read more ",
  "tripadvisor_monas_265": "If you are visiting Fatahillah Square (you should), the museum is only about 5 minutes away via a pedestrian only street. The website says it opens at 7:30am but when I turned up they told me to come back at 9am. Although the glitzy mirror/glass/digital display is more of an distraction rather than being informative, an hour at the museum...More  ",
  "tripadvisor_monas_266": "This museum is a little long winded during the economic and financial information in the beginning, but does a good job of explaining a large chunk of history. You can read about imperialism and the national bank. The currency room is pretty sweet... you get to examine some old Indonesian money as well as money from around the world. Jakarta...More  ",
  "tripadvisor_monas_267": "From the old town, just walk a little further, we can see the integrity of the museum's most famous historical jakasta. I feel that It was like a time machine of Economic condition of living as true seafarers from Indonesia, the coming of colonial period, the independence of Indonesia, until now. Studied economics, I found this museum Furniture Gave a...More  ",
  "tripadvisor_monas_268": "I had a day in Jakarta and i figured Tripadvisor would be my best choice to guide me on where to spend my limited time. Therefore, checked the \"To Do\" list and decided on the number one ranked item, the Museum Bank. Now I must admit a museum about a bank doesn't strike me as a hot tourist destination. However,...More  ",
  "tripadvisor_monas_269": "The museum is a nice hotspot in Jakarta, clean, nice developped and cool.Gives a nice impression of indonesian history, well explained and presented.A pity that Jakarta has so less of these musea.",
  "tripadvisor_monas_270": "This is an amazing building and the exhibition is well worth a visit.It's located in Kota Tua, the old city. Entrance is free. Make sure you have a separate small bag with you where you keep money, camera, phone as you need to give up your bigger bag at the entrance.This museum is not just about the monetary...More  ",
  "tripadvisor_monas_271": "I went to this museum with my 11 years old son last week. Not much good museum in Jakarta, and this one of the best!. The colonial building so grandiose and having beautiful colorful stained glass windows that we could enjoy. The museum provide the history of the value source of Indonesian spice that become economically famous up to extremely...More  ",
  "tripadvisor_monas_272": "My kids loves the gold and coins section. So many things to see and learned there about Indonesian Banking history. The kids love it, very interesting",
  "tripadvisor_monas_273": "Its the best museum in the city. Free admission, full AC and they limit the visitors inside so its not packed (you might have to queue a bit). Museum is closed on Monday.",
  "tripadvisor_monas_274": "just a little walk from the old town, then you get to see more musseum! the place is free of charge not to say and air conditioned! very convinient after hot sweaty walk!",
  "tripadvisor_monas_275": "It was a free to visit. It was like a time machine of economic condition of Indonesia from living as true seafarers, the coming period of colonial, the independence of Indonesia...read more ",
  "tripadvisor_monas_276": "It was a free to visit. It was like a time machine of economic condition of Indonesia from living as true seafarers, the coming period of colonial, the independence of Indonesia, until now. There was also a big TV showing us the challenges and the opportunity of Indonesia economic in the future. There was also a room displaying money from...More  ",
  "tripadvisor_monas_277": "Quite good place to visit in Jakarta. You can see the history of Indonesia banking/money/currency.I had a bad memory in this place about hospitality so I would recommend you to stay for 1-2 hours here.",
  "tripadvisor_monas_278": "This was not very impressing but it gave me good history lesson and reminded me of the Dutch VOC's stronghold on the country and region, during the spice trade.The architecture of the museum leaves an impression of you.I would recommend that you don't spend too much time here.",
  "tripadvisor_monas_279": "Yes, we are the first three visitor of this museum in 2013. It was a great experience for me and kiddos during school holiday. We went thru the the museum without any other visitor since it was still 830am. Although it was well maintained, clean and neat, but something you won't miss is the strange effect of a big old...More  ",
  "tripadvisor_monas_280": "I have twice gone into there. the museum is very nice and organized.very reccomended museum if you want to visit to museum in Indonesia",
  "tripadvisor_monas_281": "Wander at will through this building which once held the Indonesisch Nederlands Bank. To be followed by a number of short lived banks that went spectacularly bankrupt! I wonder why?",
  "tripadvisor_monas_282": "Well managed, the interior is new and have kind of story-telling route.Most importantly, you won't get hot here.",
  "tripadvisor_monas_283": "A nice surprise, a well laid out museum in an interesting building - bit of stuff about the bank bit and money as expected but also about the Dutch settlement through to the Asian Financial Crisis. Interesting",
  "tripadvisor_monas_284": "was here on mar, 17th 2013, free ticket! the place was so beautifully designed, feels like time travelling. very clean, modern yet preserved the classics well. they have plenty of tourist information systems that can play videos, etc. oh, and there's a theater showing the history of bank indonesia.",
  "tripadvisor_monas_285": "Must be one of the best museums in Indonesia, easliey located opposite the Jakarta Kota Station.A must see for those interested in both colonial history and the development op modern Indonesia.",
  "tripadvisor_monas_286": "The building itself is worth a visit. No entrance fee, just leave your belongings at the entrance. Start with video presentation on the history of currency. Then go through...read more ",
  "tripadvisor_monas_287": "It surprisingly amazed me,it's very rich with its information,the design & the way they placed everything is just excellent,this museum is appropiate for people from any group of age,no matter how old/young they are,I'm pretty sure they'll have fun & gain lots of knowledge.",
  "tripadvisor_monas_288": "The building itself is worth a visit. No entrance fee, just leave your belongings at the entrance. Start with video presentation on the history of currency. Then go through informative dioramas on the history of Bank Indonesia and Indonesia's economy in general. View currencies from days gone by.",
  "tripadvisor_monas_289": "The staff are great, and very friendly. The building is lovely in itself, in a historic part of town. Nice to see if you have a spare afternoon in balmy jakarta",
  "tripadvisor_monas_290": "worth a wander around, if just to get out of the heat. Have a cool drink on the veranda as you levitate above the masses.",
  "tripadvisor_monas_291": "Free...yet a fascinating display of Indonesia's economic development from pre colonial times to the present day.",
  "tripadvisor_monas_292": "Get in there you will know the background of banking of the country, an educative museum by their collections.And also artistic on the layout and modern.",
  "tripadvisor_monas_293": "well typical museum in Indonesia doesnt have aircon but this one does have. I like the modern equipment compared to other museum. crowded area but accessible by train or transjakarta",
  "tripadvisor_monas_294": "Bank notes and coins are well presented and preseved in this museum. And there's an informative history / background of the the banking system of the country. Amazed by the collection of Indo bank notes of the past!",
  "tripadvisor_monas_295": "When history is beautifully mixed with cutting-edge technology and elegantly artistic touch, that's what Museum Bank Indonesia to me....Surprisingly cozy, great lay-out and informative as well as entertaining displays make my visit there with my family very enjoyable. An educative visit for kids for sure, but also for me et my hubby...History of banking in Indonesia, the economic...More  ",
  "tripadvisor_monas_296": "Museum Bank Indonesia, is one of the very exciting museum in Jakarta. Even though you have never gone to museum, this museum is very exciting, very informative and with AC inside.You can learn more about Indonesian Money from Hindi Era.",
  "tripadvisor_monas_297": "you will see the history of Indonesian Central Bank including the history of money and coins!The building itself made during the colonialism of Dutch government. Which is very...read more ",
  "tripadvisor_monas_298": "you will see the history of Indonesian Central Bank including the history of money and coins!The building itself made during the colonialism of Dutch government. Which is very classic. Usually this museum also a favorite object spot for any architectural photographer.",
  "tripadvisor_monas_299": "It's well managed, very attractive for children, they attract the visitors with media, such as big screen and another. They have collection, indonesian Rupiah from all ages.",
  "tripadvisor_monas_300": "Once I entered this museum, I wasn't really impressed for beginning of their display. However once entering the journey chamber, I was impressed with modern technology applied in interpreting money and Indonesian economic history. The museum flow was very nice..It would be perfect if this museum also provide multilingual interpreter machine or headset.",
  "tripadvisor_monas_301": "Modern interior, air-conditioned, interactive display, you can see tons of money specimen from all over the world.",
  "tripadvisor_monas_302": "Since September 19, 2012, there's a brand-new \"audio-guide\" in Museum Bank Indonesia.It contains all of the detail about the Museum's exhibitions in 3 different languages, Bahasa, English, and French.However, this facility can only be used on Tuesday and Thursday at IDR50.000.",
  "tripadvisor_monas_303": "The most modernized museum in Kota Tua area. The museum provides you with the history of economy, finance, and currency in Indonesia. Just put it on you must-go list and you won't regret it.",
  "tripadvisor_monas_304": "We almost passed up this museum and were surprised to find it very interesting and very nice. The museum presents the history of Indonesia through the lens of finances.",
  "tripadvisor_monas_305": "The Jakarta Museum of Fine Arts and CeramicsLocated at Fatahillah Square, Jakarta, it is housed in an exquisite little building of classical architecture, with Doric columns, set up in 1820. It had once housed the Dutch East Indies’ Council of Justice. It was converted in to a museum in 1976. Apart from beautiful antique ceramicware from China, Japan and...More  ",
  "tripadvisor_monas_306": "yeah this is so far the most modern museum in Indonesia that I have ever visited. and it's FREE ! this museum tells you about the history of Bank Indonesia",
  "tripadvisor_monas_307": "I love ancient stuff, because it is rare there is also a nice place, I just loved the Indonesian bank museum",
  "tripadvisor_monas_308": "Gives you an idea of what it must have been like when the dutch were in-charge.It is very close to the central train station and other art galleries.",
  "tripadvisor_monas_309": "Surely Museum Bank Indonesia is one of the best Museum in Jakarta I've ever been to. It is recently renovated, very clean and gives you a lot of information regarding to Indonesia's history. It also has lots of collection which is located in such a neat way Would recommend every tourist to visit here, and dont forget to bring your...More  ",
  "tripadvisor_monas_310": "This is a good place to bring kids for them to learn one of important Indonesian history.",
  "tripadvisor_monas_311": "Gives you an idea of what it must have been like when the dutch were in-charge.It is very close to the central train station and other art galleries.",
  "tripadvisor_monas_312": "spends a lot of time teaching minutia, and doesn't do a great job explaining the fundamental reasons for the hyperinflation of the country or the history of spice trade well.",
  "tripadvisor_monas_313": "Among the museums in Jakarta, I think Museum Bank Indonesia is a top-notch, a must visit. From here we will be brought to a time tunnel where we could experience Indonesia economy journey of history. I was with my 9yo son visiting Museum Bank Indonesia and he was really excited to observe each of the museum part. Some useful tips...More  ",
  "tripadvisor_monas_314": "Jakarta has few attractions: there is not really a lot to see, but it makes a pleasant, cool and free couple of hours diversion away form the traffic hell",
  "tripadvisor_monas_315": "a surprise - the museum is located inside the former bank, so it is an opportunity to see the bank from the inside. Good collection of technical artefacts as personal computers or ATM's. Presentation is very XIX century, but as the museum is located at Kota - it perfectly blends in the running down ambiance of the area.",
  "tripadvisor_monas_316": "To be honest, I was extremely skeptical of the place before the visit. I was bowled over by the museum in the end. It's certainly worth a visit. After the visit, you should visit a nearby cafe for a drink. That will be a lovely way to spend the afternoon.",
  "tripadvisor_monas_317": "Unlike other museums in Jakarta, this one is recently renovated, with better presentation materials and fun to explore. Supported by new technology to explain the history and also old money from all over the world, highly recommended for kids and adults.",
  "tripadvisor_monas_318": "The museum is located in the old kota (kota tua) district in central jakarta and is managed by Indonesia's central bank; Bank Indonesia. the museum's beautifully preserved architecture and excellent interactive displays inside would probably make it one of the best museums in Jakarta. Once inside, visitors are taken into a chronological journey to witness Indonesia's economic history from the...More  ",
  "tripadvisor_monas_319": "Museum Bank Indonesia is one of the museums in Jakarta. Especially museum show about money. The museum is very nice and modern compared to other museums, almost like a museum that...read more ",
  "tripadvisor_monas_320": "The best museum in Indonesia, very modern with contemporary art design. Enter for free (or cheap tickets). Wonderful collections and displays. Definitely must visit.",
  "tripadvisor_monas_321": "Museum Bank Indonesia has set an excellent sample of museum as a source of knowledge and not just a \"storage\" of old historical stuffs. Located in the old Bank Indonesia building in Jakarta's old town area, Museum Bank Indonesia gives historical education of Indonesia's early monetary system. The museum was very well runned and well faciliated with fun things to...More  ",
  "tripadvisor_monas_322": "Old and major office building across Beos Station in Old Town of Jakarta. You could see history of the Indonesiaa's biggest bank in a relatively well maintained old builiding in Jakarta.You could combine it with your plan to Monas, National Museum and Fatahillah Square .",
  "tripadvisor_monas_323": "Indonesia have many historical places and many people have never gone there. But if they go to BI Museum, it's 100% different.All interior are very nice, cool with AC inside, nice lighting, presentation and unbelievable, this is a good place to learn more about Indonesian money history.",
  "tripadvisor_monas_324": "If you are wandering around Old Kota, it's worth dropping in on this exhibition not so much for the interior of the building (it is a lovely old building on the outside but unfortunately has been completely gutted on the inside and a modern exhibition installed ), but because in a relatively short time you can get a good idea...More  ",
  "tripadvisor_monas_325": "Museum Bank Indonesia is one of the museums in Jakarta. Especially museum show about money. The museum is very nice and modern compared to other museums, almost like a museum that is d outside Indonesia. They have a great collections ! you can learn many things and have new experience. equipped with multimedia devices and audio. and provided a theater...More  ",
  "tripadvisor_monas_326": "The facade and overall outside looks for this museum is as mentioned by previous reviewer. The lobby is reminiscing an old world charm with modern touch of air conditioning system and security gates being prepared for its grand opening.A small bag deposit counter is located directly to the right of the grand staircase then the temporary reception is located...More  ",
  "tripadvisor_monas_327": "Opened in December 2006, Museum Bank Indonesia is easily one of the most modern and professional museums in Jakarta. It is located in Jakarta's 'Kota' district, which forms the city's historic core. During the colonial era this was the city of Batavia, capital of the Dutch East Indies. The museum is housed in a magnificent colonial building which underwent a...More  "
}