{"tripadvisor_monas_0":"The artworks on display are pretty much muxed but some are of very good wuality. Its fun to see a indonesian collectors way of collecting and exhibiting.Full pass us 75000 only...read more ","tripadvisor_monas_1":"The artworks on display are pretty much muxed but some are of very good wuality. Its fun to see a indonesian collectors way of collecting and exhibiting.Full pass us 75000 only gallery is 35000 there is also student discount.Rooms are cosy cooled and somehow industrial. Nice staff and free refreshment.","tripadvisor_monas_2":"There are many art galleries in Jakarta, yet not all of them are open to public. This one is open for public and very accessible.","tripadvisor_monas_3":"Considering the lack of cultural activities (western standard) in Jakarta I think this museum very well deserves 5 stars.I am not such a big modern art lover, but some artwork was really beautiful and technically remarkable.It is relatively small although on 3 levels. 1h is enough to visit it taking your time.75000 adult ticketLandmarks not so...More  ","tripadvisor_monas_4":"This gallery is worth a visit. It has a permanent collection of Indonesian Art and a fabulous space for contemporary artworks. Check their website for the current exhibit. I go regularly, inspired every time.","tripadvisor_monas_5":"Jakarta is not known for its art galleries and museums but Art:1 is a small but interesting collection of painting and pieces.","tripadvisor_monas_6":"This is a fairly recent art space. Silghtly difficult to find but quite delightful. It has its own owners collection which is interesting. then it has changing exhibitions and a permanent collection of contemporary art. I found it well laid out and interesting","tripadvisor_monas_7":"Art:1 new Museum is a nice place if you like art. This place is easy to find. Nice exterior and interior. But kind of lack of art.","tripadvisor_monas_8":"it was a great day to visit art:1 with my friend. the place can be found easily, and located in the centre of Jakarta. actually we dont need to pay for the ticket. but to enter the museum, the price for students is Rp 50.000. during the visit, a man from art:1 accompanied us to tell about the paintings and...More  ","tripadvisor_monas_9":"I can say it SUCKS to rely on their opening hours just to find out after 45 minutes in the car that on public holidays when everybody has the time and mood to come...they are closed (of course without mentioning that on the website).And while I am writing this I see other disappointed people turning around at the gate...","tripadvisor_monas_10":"I must say that as a art lover who have been traveling around SE Asia for 7months this is by far the best Art Museum I have visited.There is a free part of gallery that you can see and also the main gallery for 75.000/ person.Art in Indonesia plays big part of youth culture, I hope with tourist...More  ","tripadvisor_monas_11":"Really nice place, but doesnt have much variety of art. They still have to put more. But it was worth it for 75 thou rupiahs.There is also a guy that was really helpful, never...read more ","tripadvisor_monas_12":"Really nice place, but doesnt have much variety of art. They still have to put more. But it was worth it for 75 thou rupiahs.There is also a guy that was really helpful, never caught his name thou. Definitely recommend the museum for a visit.","tripadvisor_monas_13":"That is by far the best Museum for modern Art I have seen in Southeast Asia. Indonesia is such a vibrant and creative place. The museum it's masterpieces and the architecture is comparable to museums you can visit in Europe or the US. Well chosen modern artworks combined with a beautiful architecture. This really is a must for visitors to...More  ","tripadvisor_monas_14":"The museum is divided into two parts, one with free entrance, one with ticket of 75.000 rupees.It host Indonesian artists, unfortunately you will not find any international big name, but still it may worth a visit.The museum is located in North Jakarta, 10 minutes from international exhibition centre in kamayoran.You need to go there by taxi and...More  ","tripadvisor_monas_15":"this place is wonderful. pretty good. i never seen a place like this. what a way to mix up old and new art in one place","tripadvisor_monas_16":"new contemporary art museum. spent a couple hours there and enjoyed it, with a couple of friends. took a lot of photos. art museum is located on side street, tucked away, and our taksi driver had difficult time locating, but for Jakarta this is not unusual(taksi drivers getting lost). would definitely make a return visit.","tripadvisor_monas_17":"Pity it's small - we were done in an hour. That said, the exhibits are excellent, and the curator helpful. Exhibits were modern (paintings and sculptures) and by prominent Indonesian artists. I'm told that they sometimes have classes for kids, but not on the day I was there. Entrance fee was about 70k - 80k - expensive for Jakarta, but...More  ","tripadvisor_monas_18":"The tickets are so cheap. Clean, well maintained, but should provide more guides (English or mandarin speaking)","tripadvisor_monas_19":"I actually expect that this place is more than a place to let you see art, but also to experience something. Went with a 8-yo and a 3-yo, I'm kind of disappointed that, as oppose to some other reviewer said, they do not have program such a painting workshop, or clay making etc. The recepsionist informed that such program needs...More  ","tripadvisor_monas_20":"Very hard to find even the taxi drivers did not no where it was.well worth the find. Down side was it would have been nice to have looked round on are own.","tripadvisor_monas_21":"The art1 museum was a refreshing stop in Jakarta. It was great to see them promoting aspiring artist and have to have free access to the \"Art Space\". When we visited the museum it was also showcasing the talents of some local teenage musicians. I will most definitely visit this place next time I come to Jakarta to see the...More  ","tripadvisor_monas_22":"I don't even consider myself to really understand art, but i really liked this. some very interesting visual stimulation. quite a big variety of genres. i just wish i had time to...read more ","tripadvisor_monas_23":"I don't even consider myself to really understand art, but i really liked this. some very interesting visual stimulation. quite a big variety of genres. i just wish i had time to visit the paid parts. the main gallery is free, and the extra pass only costs around 75,000rp (~8 USD)recommend this one. also they let you take pictures!","tripadvisor_monas_24":"This art gallery was one of the nicest visit we made during our trip to Jakarta. I love the architectural design of the building and the artwork inside is simply marvelous, add friendly and helpful staff and a cup of coffee on the roof area of the building, definitely a nice place for art lovers to go to. The museum...More  ","tripadvisor_monas_25":"Art:1 is one of the newest galleries in Jakarta and a very exciting one as well. I paid a visit there when a photography exhibition was held and got a chance to look around the building. Not only does it show the photos from the exhibition, but the 2-building with modern architecture gallery and museum also showcase a lot of...More  ","tripadvisor_monas_26":"Art:1 is one of great art gallery in Jakarta. They have lot of good painting from any great Indonesian painter, old or newcomer painter.The design is good and simple, really fit for such as gallery design.the staffs are really friendship. They love to help visitor for information or explanationand the last...here, there's one geocache hidden here...I already...More  "}