{"tripadvisor_monas_0":"I was keen to visit because I've recently read about songket, the beautiful gold thread cloth from Kelatan. This was a great place to learn more: there are good displays with...read more ","tripadvisor_monas_1":"I was keen to visit because I've recently read about songket, the beautiful gold thread cloth from Kelatan. This was a great place to learn more: there are good displays with helpful explanatory notes, and a wide range of exhibits. Entrance is free, and there's a gift shop and cafe. Currently under renovation, the temporary entrance/exit meant extra walking because...More  ","tripadvisor_monas_2":"i don't recall much but it was old and musty. there was several interesting textile display but certainly not too much. it should have been designed more modern and interactive to attract youngsters more.","tripadvisor_monas_3":"Museum textile is located around crowded area. You might take Taxi to get there. Monday and public holidays are closed.I visited with my family and 1 other family. We start from Batik Gallery to see many kinds of batik from different location in nationwide. Then we continue to see Wastro Room that show us the raw material used and...More  ","tripadvisor_monas_4":"The front building showcases different exhibitions throughout the year. If you venture behind the initial building you will find the workshop where you may be taught how to make your own batik square, at a cost. The staff speak limited english however tourists can easily get by. No AC in the workshop so dress accordingly and bring water and snacks....More  ","tripadvisor_monas_5":"The museum contains some beautiful batik pieces. I enjoyed viewing them but wished I could have had a guide to explain the history and significance of the various pieces or at least signs in English. The best part of the visit for me was the workshop, where for an additional fee, you are shown how to make your own batik.","tripadvisor_monas_6":"Most of Museum Textile Museum collections are batik. Any kind of batik like batik pesisir, batik pagi sore, batik hokokai, etc. People can take batik course here.","tripadvisor_monas_7":"Go early to the museum and make your own batik. Give yourself at least an hour to two hours to trace, wax and have your fabric dyed. It costs 75,000 rps.","tripadvisor_monas_8":"Each time I passed the Textile Museum, I wished How I would love to visit it, I fell in love with the architecture of the colonial stykle building. Luckily, I got an invitation to visit this Museum twice, the first time is at a Batik Lasem exhibition and the second time, the painting of Batik on porcelain by Mrs. Arlinda...More  ","tripadvisor_monas_9":"Indonesia has zillion of textiles in its culture, it is simply sad when knowing the museum of textile is unable to reflect that. they have probably some dozen of example, but without any further explanation about the history or the cultural background. I would expect the museum explained the historical meaning of each pattern of batik, but I found only...More  ","tripadvisor_monas_10":"The textile museum offer a very large variety of textiles, batik more then others. Sometimes there are temporary expositions of textiles from around the immense Indoneisa that have one of the most big variety of fabrics from differents regencies. The building is not so well managed. The bookshop is little and not so good for the choice. Doesn't exist a...More  ","tripadvisor_monas_11":"This place is more than just a museum where old dusty fabrics are kept. The building is a large beautiful dutch colonial house with a large green garden. Go further to the back...read more ","tripadvisor_monas_12":"The museum itself is very small and unless you're REALLY REALLY interested in Indonesian traditional batik (I am!) then I think you'll find this museum a bit boring.We took our kids (5 & 7yo) there and they offered a batik drawing activity at the back of the museum. It doesn't cost much and the kids get a handkerchief size...More  ","tripadvisor_monas_13":"This place is more than just a museum where old dusty fabrics are kept. The building is a large beautiful dutch colonial house with a large green garden. Go further to the back yard, you will find the herb garden that is used for fabric natural colouring, gazebo to relax and to play angklung, but most importantly you will have...More  ","tripadvisor_monas_14":"A quiet place in the midst of Busy jakarta traffic. The trainers are friendly and helpful. the museum is kept well. One can learn the art of batik and understand the history of textiles.A must visit in Jakarta.","tripadvisor_monas_15":"I've never been inside this museum before. It is not a modern museum but very nicely decorated with Indonesian traditional style. The museum displays many beautiful textiles/cloths from all over Indonesian regions. Indonesia is not about Batik only but we do have other wonderful traditional cloths. Foreign tourists must not miss this museum!Pay a small fee of 5000 IDR...More  ","tripadvisor_monas_16":"I've been here twice now. It's a beautiful museum with a lovely collection of all types of Indonesian fabric. The batik collection is particularly good. You can also take classes here if you are inclined.","tripadvisor_monas_17":"I came here for a wedding invitation and surprised to find such interesting place in the busy jungle of metropolitan. It is an old historical dutch building. There are occassionally exhibitions related to textile and batik painting lessons.","tripadvisor_monas_18":"This is a beautiful museum dedicated to the history of Indonesia's amazing textiles. You will find beautiful examples of their art as well as knowledgeable guides to help you learn. They also offer batik classes.","tripadvisor_monas_19":"It is a must go for Indonesian Woman who should learn about the textille in Indonesia. We can also learn how to make our own batik.To get there is quite easy. If you go from Slipi Junction, go straight through Jl. KS Tubun, after Hotel Santika Premiere Slipi Jakarta and RS Pelni, take the right side at the end...More  ","tripadvisor_monas_20":"having a mueum that exist in jakarta to offers a nice ambiance and experience, the you should try to visit and learn the greatness of indonesia textile, even in jakarta museum is not that favors due to heavy commercials malls build. but to get a change to get the delicate experience for me its just set you in a different...More  ","tripadvisor_monas_21":"Being a fashion designer, the first spot i planned to visit was of course the textile museum, so i did.I had a very hard time looking for it,though, as it was tucked in a very busy street (a bit in the shabby part of the city) so even my cab driver had no clue how to get there, GPS...More  ","tripadvisor_monas_22":"This place is fun, we can take a short course to make a batik. Collection of the batik is amazing from a lot of place and same of the collections was very old.","tripadvisor_monas_23":"This musuem is another gem of Jakarta. However, its quite far in West Jakarta and takes an effort to get there.It houses many kinds of Indonesian textiles and is well laid out. It has frequent special exhibitions and live demonstrstions which I saw and was impressed.If you have the time do go to this colonial era building.","tripadvisor_monas_24":"This place is fun, we can take a short course to make a batik. Collection of the batik is amazing from a lot of place and same of the collections was very old.","tripadvisor_monas_25":"It's a little sad due to lacn of funding but presents the most wonderful display of textiles - mainly batik but some ikat. Occasionally has exhibitions of private collections which should not be missed.It has an information and teaching centre in a separate building as well as a small gallery shop.It is hard to find by taxi, but...More  ","tripadvisor_monas_26":"Small museum with several rooms showcasing different styles of Batik and its history. There's also a Batik shop out back where Batiks are made sometimes in classes/demonstrations. Museum is ok, best for adults only as there's nothing here for kids under 12 to see or do. One visit and you'll be set. No reason to plan an outing around stopping...More  ","tripadvisor_monas_27":"You will see the colonial building behind the street vendors. very unfortunate with this great building but cover with so many street vendors. after you came in the museum area it so shady with a lot of big trees. but the textile collections not to attractive for me.if you have more times you can participate for batik workshop.here's...More  ","tripadvisor_monas_28":"This museum is small, and in the main building there was a special exhibition of a local modern designers. However, the regular exhibition of batiks in the side building is a gem! You can see a big variety of good batiks, their patterns and fabrics, there. I spent only 10 minutes in the main building, but about an hour in...More  ","tripadvisor_monas_29":"The place is lovely, the recent fashion designer exhibit by Buti exhibit was fantastic! I will definitely go back and will take guests but hopefully the museum will have more information on the batik and the history, etc. I really had hoped to have a chance at making batik but that area was closed, as was the gift shop. They...More  ","tripadvisor_monas_30":"I visit this museum each time I come to Jakarta and it has been interesting to observe the growing pride the Indonesian people are taking in presenting this rich cultural aspect of their lives.The main batik museum has now been moved to what was originally the residence for the Dutch Governor. This building is still in the same complex...More  ","tripadvisor_monas_31":"Our trip guide stopped at Museum Tekstil. We had to register while going in.So many nice new fashions especially for marriage day. Many ladies were listening to explanation by the designer by Indonesian language.","tripadvisor_monas_32":"The textile museum earns brownie points for its great collection - but since only a fraction of the collection is on view at any one time (the displays change frequently; special exhibits showcase spectacular cloths), one really has to live in Jakarta to enjoy it all. Museum staff are friendly and helpful. In a side building there are often batik-making...More  ","tripadvisor_monas_33":"Beautifully laid out, great explanations, keeps changing, hosts many varied events.For those who want to see more about the batik, tenun, ikat and songket traditions this is a...read more ","tripadvisor_monas_34":"Beautifully laid out, great explanations, keeps changing, hosts many varied events.For those who want to see more about the batik, tenun, ikat and songket traditions this is a must...","tripadvisor_monas_35":"Located in city center, an old, but well maintained French style Colonial mansion and garden. Inside this museum are full of historic and local batiks. Also has museum shop, filled with hand made batiks. I strongly recommend this museum for fabrics lovers.","tripadvisor_monas_36":"Be prepared to spend three hours and more if you want a beautiful batik cloth to take home! I really enjoyed my time here though if you're not a patient person who likes drawing and painting I don't think this is the right place for you. I felt like after learning how to make Batik, I appreciate the indonesian culture...More  ","tripadvisor_monas_37":"I loved making my own batik for $7.00 but it took over 2 hours. Little ants bit my bare feet as I worked. I moved away from the ants. (You have to remove your shoes). Husband was thoroughly bored.The rest of the museum is smallish and I didn't really appreciate the work involved in batik until I tried to...More  ","tripadvisor_monas_38":"I went there with my roommate from US, which she was really excited to know all about batik in the museum. So they let us to make our own batik tulis and we can keep them after. She also bought a Kebaya which is a very beautiful traditional clothes from Indonesia and matched her really well. The place is so...More  ","tripadvisor_monas_39":"what we really enjoyed doing here was we could make our own batik. This was a new and a learning experience. i did not find the museum very interesting thou.If you want to learn to make your own batik, then this is a good place.","tripadvisor_monas_40":"The museum allows you first hand learn the art of batik making. I thought it is easy, but its the opposite. My wife and I enjoyed and labored doing the batik design.","tripadvisor_monas_41":"In a very well restored old house, it worth while for those interested in Batik, a very well organized and presented exposition of Batiks and the tools to make it.","tripadvisor_monas_42":"Forget about the rest of Jakarta, this is the place to spend time. This Museum has examples of Batik and woven textiles from all over Indonesia. It is the only place in Indonesia that you can see the breadth and depth of the craft of weaving, from the relatively simple through to what is really high art. It is a...More  ","tripadvisor_monas_43":"This was a wonderful experience. After looking through a display of woven cloths, at the moment from the north of Sumatra (it changes), we were able to make our own batik. An excellent and extremely patient teacher helped us to use the wax for the patterning and then we saw the whole process. A highlight of visiting Jakarta!","tripadvisor_monas_44":"Make sure you wander around & explore the different buildings. The main building had a great exhibit from a particular tribe when I was there including a woman weaving a bag...read more ","tripadvisor_monas_45":"Make sure you wander around & explore the different buildings. The main building had a great exhibit from a particular tribe when I was there including a woman weaving a bag - fantastic to watch!There's a second building that does have a/c and both old & modern batiks so you can see the different styles.There's a garden to...More  ","tripadvisor_monas_46":"Indonesian should be proud of themselves since they are very rich people. They are rich of tradition and customs.We can not miss a chance to Textile Museum because batik is one of the most traditional value of Indonesia.The most interesting thing in the trip was that I could make a batik by my own.Very cheap and well-equipped....More  ","tripadvisor_monas_47":"i love fashion, and there is so much kind of batik i found arround. Indonesia is very rich of the culture, and they should proud of it","tripadvisor_monas_48":"We went to the museum during the end of Ramadan. Unfortunately, the do-your-own batik experience and the gift shop were not open due to the holiday. In addition to the shop, the museum consists of two buildings. One is not-air-conditioned and contains older batiks. The newer building is air-conditioned and has some very beautiful and artistic contemporary batiks. Well worth...More  ","tripadvisor_monas_49":"The museum itself is good. But that's all.What I enjoy the most about this place is that it has a batik workshop behind the museum.By only paying 40k IDR , you could make a batik handkerchief.Malam (wax), canting, fabric and the fire equipment is provided by the workshop.But you could also buy the complete set if...More  ","tripadvisor_monas_50":"Obviously the most interesting attraction from this museum is that you can make your own batik. Don't expect that you'd be given a thorough explanation on the process or the history behind the making of batiks, as the people tending to the place do not seem to care too much. But it is quite an experience to just be able...More  ","tripadvisor_monas_51":"I like the atmosphere once I got inside the compound of the museum. However the outside surrounding was distracting...those street vendors 'almost' hid this gems.","tripadvisor_monas_52":"This museum is steadily improving from visits in the past. They have very well curated exhibitions on Indonesian textiles. There is also in an adjacent building exhibitions of superb batik on loan from the Batik Foundation. In another building is room filled with a myriad of loom types and textile related equipment. In another building, there are batik demonstrations and...More  ","tripadvisor_monas_53":"learning how to make my first batik there, very interesting.old batik collection and also for ikat.","tripadvisor_monas_54":"An interesting visit to the Textile Museum..Situated near Tanah Abang Market, it might be a bit difficult to find the place at first..but the building itself is very historical..Many rare batiks are displayed and several traditional fabrics can be seen as well..some patterns are very fascinating, at least for me! Some of them might not be available anymore,...More  ","tripadvisor_monas_55":"Learning to do batik in small piece of cloth. What an experience!Glad to bring home the masterpiece :). Lesson is good. Place is warm cause need room temperature so that the wax...read more ","tripadvisor_monas_56":"Learning to do batik in small piece of cloth. What an experience!Glad to bring home the masterpiece :). Lesson is good. Place is warm cause need room temperature so that the wax keep fluid.","tripadvisor_monas_57":"No comparison with the collection in Singapore museum. The collection is poor, with very scarce information and explanations, light insufficient.","tripadvisor_monas_58":"I went there a Wednesday and in terms of volume, I was the only one in it! The fabrics were quite unique, I think some prints are either expensive to buy as replica outside or not available for purchase at all. The collection is also not that many. Again,DON'T EXPECT TOO MUCH.There is a small store to the right...More  ","tripadvisor_monas_59":"My first intention was to try the \"batik\" process. After all the hassle of getting there (traffic etc), I was amazed by the museum complex, which is nothing compared to what I expect. the surrounding was very nice and calm, with big shady tree. After only paying 2000IDR (US$ 0.20), we get to check out all different kind of textile...More  ","tripadvisor_monas_60":"it was nice to know that Batik was actually originated in Indonesia and actually able to learn \"Batik Know How\"","tripadvisor_monas_61":"a pitty that the DKI government would not spent more money for the upkeeping of a place which would interest tourists","tripadvisor_monas_62":"Went there during weekend when the museum exhibited the 'Islamic Influence in Textile'. Abundant collections of rare Batik from all parts of Indonesia, with complete description of each cloth; hand-painted, machine printed, natural dyes, chemical dyes, woven, ikat, Kain Panjang, Destar, Sarong; Informative and beautiful! Enjoyed the old-Dutch architecture building and interior, also. Clean and well maintained facility.There was...More  ","tripadvisor_monas_63":"Went there once with friends and our children about a year ago by invitation of a friend who work there. The fee to the museum is cheap, yet the place was so quiet on a Sunday, barely nobody was there but our small group. The ranges of textiles and fabrics are pretty extensive and beautiful, but not very well kept....More  ","tripadvisor_monas_64":"A good alternative to shopping is a visit to this museum. It will help you to better appreciate Indonesian textiles especially batik.","tripadvisor_monas_65":"Many rare collections, including from other countries. A must for textile lovers or those who have business in the industry.","tripadvisor_monas_66":"When my friend suggested to visit this museum, I was very excited as we can create our own batik masterpieces there.You probably need around a few hrs if you plan to do a few...read more ","tripadvisor_monas_67":"Nice textiles but poorly looked after. The location is not exactly great being right in the center with all that traffic.","tripadvisor_monas_68":"Great collection and you can also try to make your own batik.","tripadvisor_monas_69":"When I say, 'Its kind' I mean very specialized museums. This is devoted to Indonesian textiles, and it's wonderful, even if one is not interested in textiles, and I'm not. (But my wife is.) Cheap admission, a nice old building, good descriptions, lovely fabrics. I didn't mind the two hours we spent there. (My wife could have spent all day.)...More  ","tripadvisor_monas_70":"the collection are ok , they have some old fabrics from all over Indonesia and the place was a colonial building like many other museum in Jakarta or Indonesia but to get there is really really hard with the traffic, its for sure one of the busiest street in jakarta because so close to Tanah Abang market and also from...More  ","tripadvisor_monas_71":"When my friend suggested to visit this museum, I was very excited as we can create our own batik masterpieces there.You probably need around a few hrs if you plan to do a few batik. It is 75000 rupiah per piece, for a square handkerchief size. First you trace the picture on the cloth and then wax it. The...More  ","tripadvisor_monas_72":"Sort of in the outskirts of town, as the streets get narrower and the poverty more visible, you'll find a little oasis of a compound that is the Textile Museum. This used to be a private home, and retains an intimate feel. From time to time, there are interesting exhibitions, which is when you should visit. Otherwise, there isn't quite...More  ","tripadvisor_monas_73":"THis is a very interesting place even if you (like me) don't particularly like batiks. The building was once the home of a French merchant in the 1700s and is very beautiful. The textiles are exhibited well, and changed often so you can always go back to see different ones. You learn a lot about where the good ones come...More  ","tripadvisor_monas_74":"My daughters and i headed to the textile museum on a very rainy day, and we had a ball. The museum part itself is really only interesting to those of us who are really into textiles and the history of them. However, the batik making part is for everyone 'crafty' or artistic.We started with grand ideas and very quickly...More  ","tripadvisor_monas_75":"Went to the museum early in the morning, was greeted by the receptionist. She was cheerful and very informative. She will explain all activities in the museum.Nothing to shot out about the museum collection. The collection, although precious, but only conserve just as it is. Some explanation come only in Bahasa, no English translation. No guide available, so you...More  "}